{
  "lifePath": {
      "1": {
      "title": "Số chủ đạo của bạn là 1 - Nhà Lãnh Đạo Tiên Phong & Độc Lập",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Số 1 đại diện cho sự khởi đầu, cái tôi và nguồn năng lượng dương mạnh mẽ. Nếu bạn mang số chủ đạo 1, bạn giống như một mũi tên luôn lao về phía trước. Bạn sinh ra không phải để đi theo đám đông mà để khai phá những con đường mới.</p><p>Cuộc đời bạn là hành trình của sự tự khẳng định. Bạn sở hữu lòng kiêu hãnh bẩm sinh và khao khát được công nhận là \"số một\", là duy nhất trong lĩnh vực mà bạn theo đuổi.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm nổi bật",
          "items": [
            "<strong>Quyết đoán & Dứt khoát:</strong> Bạn ra quyết định rất nhanh, dám làm dám chịu và hiếm khi hối hận về lựa chọn của mình.",
            "<strong>Sáng tạo & Đổi mới:</strong> Bạn ghét sự rập khuôn. Tư duy của bạn luôn tìm kiếm giải pháp mới mẻ, khác biệt.",
            "<strong>Tập trung mục tiêu:</strong> Một khi đã xác định đích đến, bạn có khả năng tập trung cao độ, không gì có thể làm bạn lung lay.",
            "<strong>Độc lập tự chủ:</strong> Bạn không thích dựa dẫm hay nhờ vả. Khả năng tự đứng trên đôi chân mình là vũ khí mạnh nhất của bạn."
          ]
        },
        {
          "type": "list",
          "title": "Điểm hạn chế cần khắc phục",
          "items": [
            "<strong>Cái tôi quá lớn:</strong> Sự tự tin thái quá dễ biến thành kiêu ngạo, khiến bạn khó chấp nhận cái sai và ít chịu lắng nghe lời khuyên.",
            "<strong>Độc đoán & Áp đặt:</strong> Bạn thường muốn mọi việc phải theo ý mình, dễ gây áp lực cho người xung quanh.",
            "<strong>Bảo thủ:</strong> Bạn rất khó thay đổi quan điểm cá nhân, đôi khi trở nên cứng nhắc và thiếu linh hoạt.",
            "<strong>Cô độc:</strong> Vì luôn muốn đi đầu và tự gánh vác mọi thứ, bạn thường cảm thấy cô đơn ngay cả khi đang ở đỉnh cao."
          ]
        },
        {
          "type": "text",
          "title": "Bài học cuộc đời",
          "content": "<p>Vũ trụ thường đặt bạn vào những hoàn cảnh buộc bạn phải đơn độc chiến đấu để rèn luyện sự <strong>Tự Chủ (Self-Reliance)</strong>. Tuy nhiên, bài học lớn nhất của Số 1 không chỉ là làm vua một cõi, mà là trở thành một nhà lãnh đạo thực thụ.</p><p>Bạn cần học cách hạ cái tôi xuống, lắng nghe và thấu hiểu. Đích đến cuối cùng là dùng sức mạnh của mình để nâng đỡ, bảo vệ người khác thay vì áp chế họ. Hãy nhớ rằng: <em>Một nhà lãnh đạo giỏi tạo ra những nhà lãnh đạo khác, chứ không phải tạo ra những kẻ phục tùng.</em></p>"
        },
        {
          "type": "text",
          "title": "Góc nhìn tình cảm",
          "content": "<p>Trong tình yêu, bạn là người nồng nhiệt, chủ động và thích chinh phục. Bạn muốn là người che chở và là chỗ dựa vững chắc cho đối phương. Bạn rất chung thủy và có trách nhiệm.</p><p>Tuy nhiên, mặt trái là tính sở hữu và kiểm soát cao. Mối quan hệ của bạn dễ ngột ngạt nếu bạn không học cách tôn trọng khoảng trời riêng của người ấy. Bạn phù hợp nhất với một người đủ tinh tế để nhu mì khi cần, nhưng cũng đủ độc lập và cá tính để bạn nể phục.</p>"
        }
      ]
    },
    "2": {
      "title": "Số chủ đạo của bạn là 2 - Sứ Giả Hòa Bình & Trực Giác",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Số 2 là hiện thân của sự cân bằng, hòa hợp và tình yêu thương. Trái ngược với sự mạnh mẽ của số 1, bạn mang năng lượng của sự kết nối và hỗ trợ. Bạn sinh ra với sứ mệnh trở thành \"chất keo\" gắn kết mọi người lại với nhau.</p><p>Bạn sở hữu một tâm hồn nhạy cảm và tinh tế hiếm có. Trong một tập thể, bạn thường không phải là người đứng đầu ồn ào nhất, nhưng lại là người thấu hiểu và nắm giữ trái tim của mọi người.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm nổi bật",
          "items": [
            "<strong>Trực giác cực nhạy:</strong> Bạn có khả năng cảm nhận được cảm xúc của người khác và dự báo những rắc rối trước khi chúng xảy ra.",
            "<strong>Khéo léo & Ngoại giao:</strong> Bạn giải quyết mâu thuẫn rất tài tình, luôn tìm ra giải pháp \"đôi bên cùng có lợi\".",
            "<strong>Lắng nghe & Thấu cảm:</strong> Bạn là bờ vai vững chắc để người khác tâm sự, vì bạn biết cách lắng nghe bằng cả trái tim.",
            "<strong>Tận tụy & Hỗ trợ:</strong> Bạn hạnh phúc khi được giúp đỡ người khác thành công và tỏa sáng."
          ]
        },
        {
          "type": "list",
          "title": "Điểm hạn chế cần khắc phục",
          "items": [
            "<strong>Quá nhạy cảm:</strong> Bạn dễ bị tổn thương bởi những lời chỉ trích nhỏ nhặt hoặc cảm xúc tiêu cực của người khác.",
            "<strong>Thiếu quyết đoán:</strong> Vì sợ làm mất lòng người khác, bạn thường lưỡng lự và khó đưa ra quyết định dứt khoát.",
            "<strong>Phụ thuộc cảm xúc:</strong> Bạn có xu hướng dựa dẫm vào người khác và sợ sự cô đơn.",
            "<strong>Cả nể:</strong> Bạn thường không dám nói \"Không\", dẫn đến việc ôm đồm và chịu thiệt thòi về mình."
          ]
        },
        {
          "type": "text",
          "title": "Bài học cuộc đời",
          "content": "<p>Vì bản tính thích hòa bình, bạn thường né tránh xung đột và tự đánh mất bản sắc của mình. Do đó, bài học lớn nhất của Số 2 là <strong>Thiết lập ranh giới (Boundaries)</strong>.</p><p>Bạn cần học cách nói \"Không\" một cách cứng rắn và hiểu rằng: Yêu thương bản thân không phải là ích kỷ. Bạn chỉ có thể giúp đỡ người khác tốt nhất khi chính bạn đang vững vàng và hạnh phúc. Đừng để lòng tốt của mình bị lợi dụng.</p>"
        },
        {
          "type": "text",
          "title": "Góc nhìn tình cảm",
          "content": "<p>Tình yêu là lẽ sống của bạn. Bạn lãng mạn, dịu dàng và luôn đặt người yêu lên vị trí ưu tiên hàng đầu. Bạn khao khát một mối quan hệ bền chặt, gắn kết như hình với bóng.</p><p>Tuy nhiên, bạn cần tránh việc kiểm soát đối phương bằng sự quan tâm thái quá hoặc trở nên bi lụy. Mối quan hệ lý tưởng cho bạn là sự bình đẳng, nơi bạn được trân trọng và lắng nghe, chứ không phải là nơi bạn hy sinh đơn phương.</p>"
        }
      ]
    },
    "3": {
      "title": "Số chủ đạo của bạn là 3 - Người Truyền Cảm Hứng & Sáng Tạo",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Số 3 là con số của sự biểu đạt, niềm vui và trí tuệ sáng tạo. Bạn giống như một đứa trẻ vĩnh cửu của vũ trụ - luôn tò mò, hoạt bát và mang lại tiếng cười cho mọi người. Năng lượng của bạn rực rỡ và có sức lan tỏa mạnh mẽ.</p><p>Bạn sinh ra để tỏa sáng trên sân khấu của chính mình, dù đó là sân khấu nghệ thuật hay trong các cuộc giao tiếp đời thường. Tư duy của bạn cực kỳ nhanh nhạy và sắc bén.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm nổi bật",
          "items": [
            "<strong>Hoạt ngôn & Giao tiếp:</strong> Bạn có khiếu ăn nói bẩm sinh, khả năng sử dụng ngôn từ linh hoạt để thuyết phục và thu hút người khác.",
            "<strong>Sáng tạo không giới hạn:</strong> Đầu óc bạn đầy ắp những ý tưởng độc đáo, nghệ thuật và giàu trí tưởng tượng.",
            "<strong>Lạc quan & Hài hước:</strong> Bạn là vitamin vui vẻ của mọi người, luôn nhìn thấy điểm sáng trong những tình huống tăm tối nhất.",
            "<strong>Thông minh & Nhanh nhạy:</strong> Bạn tiếp thu kiến thức mới rất nhanh và có tư duy phản biện sắc sảo."
          ]
        },
        {
          "type": "list",
          "title": "Điểm hạn chế cần khắc phục",
          "items": [
            "<strong>Thiếu tập trung:</strong> Bạn dễ bị phân tâm bởi những điều mới lạ, dẫn đến việc \"cả thèm chóng chán\" và bỏ dở giữa chừng.",
            "<strong>Khẩu nghiệp:</strong> Sự hoạt ngôn đôi khi biến thành nói nhiều, nói dai hoặc vô tình buông lời sát thương người khác khi nóng giận.",
            "<strong>Cảm xúc thất thường:</strong> Tâm trạng của bạn lên xuống như tàu lượn siêu tốc, sáng nắng chiều mưa.",
            "<strong>Hời hợt:</strong> Đôi khi bạn chỉ lướt qua bề mặt vấn đề mà thiếu đi sự sâu sắc cần thiết."
          ]
        },
        {
          "type": "text",
          "title": "Bài học cuộc đời",
          "content": "<p>Mặc dù bề ngoài bạn luôn vui vẻ, nhưng bên trong bạn cũng có những nỗi buồn sâu kín khó nói. Bài học lớn nhất của Số 3 là <strong>Quản trị cảm xúc và Sự sâu sắc</strong>.</p><p>Bạn cần học cách lắng nghe nhiều hơn là nói, và học cách đi đến cùng của một vấn đề thay vì bỏ cuộc khi chán nản. Hãy sử dụng khả năng ngôn ngữ của mình để truyền động lực và chữa lành, thay vì để châm chọc hay than vãn. Sự kỷ luật sẽ là chìa khóa biến tài năng của bạn thành thành tựu thực tế.</p>"
        },
        {
          "type": "text",
          "title": "Góc nhìn tình cảm",
          "content": "<p>Trong tình yêu, bạn là người tình thú vị, lãng mạn và luôn biết cách làm mới mối quan hệ. Bạn ghét sự nhàm chán và tẻ nhạt. Bạn dễ bị thu hút bởi những người thông minh, có ngoại hình đẹp hoặc có tài lẻ.</p><p>Tuy nhiên, bạn có thể hơi vô tâm hoặc hay ghen tuông vô cớ. Để hạnh phúc, bạn cần một người bạn đời biết lắng nghe, bao dung với tính khí thất thường của bạn và đủ thú vị để cùng bạn \"chơi\" suốt cuộc đời.</p>"
        }
      ]
    },
    "4": {
      "title": "Số chủ đạo của bạn là 4 - Nhà Kiến Tạo & Kỷ Luật",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Số 4 là biểu tượng của sự vững chắc, trật tự và thực tế. Nếu số 3 bay bổng trên mây thì số 4 là móng nhà cắm sâu vào lòng đất. Bạn là người xây dựng nền tảng cho mọi thứ, từ công việc, gia đình cho đến xã hội.</p><p>Bạn coi trọng sự thật, quy trình và kết quả rõ ràng. Bạn không tin vào may mắn, bạn tin vào sự nỗ lực và mồ hôi nước mắt. Người khác tìm đến bạn khi họ cần sự an tâm và một giải pháp chắc chắn.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm nổi bật",
          "items": [
            "<strong>Thực tế & Chi tiết:</strong> Bạn có khả năng tổ chức, sắp xếp công việc tuyệt vời và tỉ mỉ đến từng chi tiết nhỏ.",
            "<strong>Kiên trì & Chăm chỉ:</strong> Bạn không ngại khó, ngại khổ. Một khi đã nhận việc, bạn sẽ làm đến nơi đến chốn.",
            "<strong>Đáng tin cậy:</strong> Bạn là người giữ chữ tín hàng đầu. Lời hứa của bạn nặng tựa ngàn vàng.",
            "<strong>Nguyên tắc & Kỷ luật:</strong> Bạn sống và làm việc theo kế hoạch, chuẩn mực và tôn trọng luật lệ."
          ]
        },
        {
          "type": "list",
          "title": "Điểm hạn chế cần khắc phục",
          "items": [
            "<strong>Cứng nhắc & Bảo thủ:</strong> Bạn rất khó chấp nhận những thay đổi đột ngột hoặc những cách làm mới chưa được kiểm chứng.",
            "<strong>Quá an toàn:</strong> Bạn thường chọn lối mòn an toàn nên dễ bỏ lỡ những cơ hội bứt phá lớn.",
            "<strong>Khô khan:</strong> Bạn thường tập trung vào công việc mà quên mất việc thể hiện cảm xúc, khiến người thân cảm thấy xa cách.",
            "<strong>Tham công tiếc việc:</strong> Bạn dễ bị cuốn vào công việc đến mức quên cả chăm sóc sức khỏe bản thân."
          ]
        },
        {
          "type": "text",
          "title": "Bài học cuộc đời",
          "content": "<p>Cuộc sống của bạn thường gặp nhiều áp lực do chính bạn tự đặt ra. Bài học lớn nhất của Số 4 là <strong>Sự Linh Hoạt và Cân Bằng (Balance)</strong>.</p><p>Bạn cần hiểu rằng: Thay đổi là quy luật tất yếu của cuộc sống. Hãy học cách thả lỏng, bước ra khỏi vùng an toàn và chấp nhận rủi ro trong tầm kiểm soát. Hãy dành thời gian để tận hưởng thành quả lao động và kết nối cảm xúc với gia đình, thay vì chỉ biết vùi đầu vào công việc.</p>"
        },
        {
          "type": "text",
          "title": "Góc nhìn tình cảm",
          "content": "<p>Bạn không phải là người lãng mạn kiểu tặng hoa hay nói lời đường mật, nhưng tình yêu của bạn thể hiện qua hành động thiết thực. Bạn chăm lo kinh tế, sửa chữa đồ đạc và tạo dựng một mái ấm vững chắc.</p><p>Bạn tìm kiếm một mối quan hệ lâu dài, cam kết hôn nhân rõ ràng. Tuy nhiên, hãy cẩn thận đừng biến tình yêu thành trách nhiệm khô cứng. Hãy học cách mềm mỏng hơn và chia sẻ cảm xúc nhiều hơn với bạn đời.</p>"
        }
      ]
    },
    "5": {
      "title": "Số chủ đạo của bạn là 5 - Kẻ Phiêu Lưu & Tự Do",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Số 5 nằm ở trung tâm của biểu đồ số, đại diện cho sự tự do, bất định và trải nghiệm. Bạn là cơn gió hoang dã không thể bị nhốt trong lồng. Cuộc đời bạn là một chuỗi những chuyến đi, những cuộc phiêu lưu và những thay đổi không ngừng.</p><p>Bạn sợ nhất là sự nhàm chán và lặp lại. Bạn khao khát được nhìn ngắm thế giới, nếm trải mọi hương vị của cuộc sống và kết nối với mọi tầng lớp con người.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm nổi bật",
          "items": [
            "<strong>Yêu tự do:</strong> Tự do là oxy của bạn. Bạn cần không gian để vẫy vùng và sáng tạo.",
            "<strong>Thích nghi tốt:</strong> Bạn giống như tắc kè hoa, có thể sống sót và tỏa sáng ở bất kỳ môi trường nào.",
            "<strong>Linh hoạt & Đa tài:</strong> Bạn khéo léo, nhiều tài lẻ và có khả năng xoay sở tình huống cực nhanh.",
            "<strong>Thu hút & Lôi cuốn:</strong> Bạn có sức hút tự nhiên, tràn đầy năng lượng và luôn là tâm điểm của các cuộc vui."
          ]
        },
        {
          "type": "list",
          "title": "Điểm hạn chế cần khắc phục",
          "items": [
            "<strong>Thiếu kiên định:</strong> Bạn dễ bị phân tâm, thay đổi mục tiêu liên tục và hiếm khi hoàn thành những gì đã bắt đầu.",
            "<strong>Ham vui:</strong> Bạn dễ sa đà vào các cuộc vui chơi, tiệc tùng hoặc các thói quen không lành mạnh (rượu bia, mua sắm...).",
            "<strong>Vô kỷ luật:</strong> Bạn ghét sự ràng buộc, nên thường gặp khó khăn trong việc tuân thủ quy tắc và giờ giấc.",
            "<strong>Cả thèm chóng chán:</strong> Nhiệt huyết của bạn bùng lên rất nhanh nhưng cũng tắt rất lẹ."
          ]
        },
        {
          "type": "text",
          "title": "Bài học cuộc đời",
          "content": "<p>Sự tự do là món quà nhưng cũng là cái bẫy của số 5. Bài học cốt lõi bạn cần tốt nghiệp là <strong>Tự Do Trong Kỷ Luật</strong>.</p><p>Bạn cần hiểu rằng: Tự do đích thực không phải là muốn làm gì thì làm, mà là khả năng làm chủ bản thân để không bị cuốn theo cám dỗ. Bạn cần rèn luyện sự kiên nhẫn, chọn lọc những trải nghiệm có giá trị và học cách cam kết đi đến cùng. Khi bạn có kỷ luật, năng lượng bùng nổ của bạn sẽ tạo ra những đột phá phi thường.</p>"
        },
        {
          "type": "text",
          "title": "Góc nhìn tình cảm",
          "content": "<p>Bạn là người tình quyến rũ, đam mê và đầy bất ngờ. Yêu số 5 không bao giờ chán. Tuy nhiên, bạn rất sợ sự ràng buộc gò bó. Nếu đối phương kiểm soát quá chặt, bạn sẽ tìm cách thoát thân.</p><p>Bạn cần một người bạn đời cũng yêu tự do, phóng khoáng và sẵn sàng đồng hành cùng bạn trong những chuyến đi. Sự tin tưởng và tôn trọng khoảng trời riêng là chìa khóa để giữ chân bạn.</p>"
        }
      ]
    },
    "6": {
      "title": "Số chủ đạo của bạn là 6 - Người Chăm Sóc & Yêu Thương",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Số 6 được ví là con số của người mẹ, đại diện cho tình yêu thương vô điều kiện, gia đình và trách nhiệm. Bạn mang trong mình trái tim nhân hậu, luôn khao khát được chăm sóc, che chở và chữa lành cho người khác.</p><p>Đối với bạn, nhà là nơi quan trọng nhất. Bạn sẵn sàng hy sinh lợi ích cá nhân để đảm bảo sự bình yên và hạnh phúc cho những người mình yêu thương. Bạn có khiếu thẩm mỹ và nghệ thuật bẩm sinh.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm nổi bật",
          "items": [
            "<strong>Giàu tình thương:</strong> Bạn bao dung, nhân ái và luôn muốn giúp đỡ người yếu thế.",
            "<strong>Trách nhiệm cao:</strong> Bạn là trụ cột tinh thần vững chắc, luôn gánh vác trách nhiệm gia đình và cộng đồng.",
            "<strong>Sáng tạo & Thẩm mỹ:</strong> Bạn có gu thẩm mỹ tốt, yêu cái đẹp và thường khéo tay hay làm.",
            "<strong>Khả năng chữa lành:</strong> Sự hiện diện của bạn mang lại cảm giác bình an và được an ủi cho người khác."
          ]
        },
        {
          "type": "list",
          "title": "Điểm hạn chế cần khắc phục",
          "items": [
            "<strong>Ôm đồm & Bao bọc:</strong> Bạn thường làm thay người khác quá nhiều, khiến họ trở nên ỷ lại và yếu đuối.",
            "<strong>Hay lo lắng:</strong> Bạn luôn lo sợ những điều tồi tệ sẽ xảy ra với người thân, dẫn đến tâm lý bất an.",
            "<strong>Kiểm soát ngầm:</strong> Dưới danh nghĩa tình yêu, bạn có xu hướng áp đặt mong muốn của mình lên người khác.",
            "<strong>Quên bản thân:</strong> Bạn mải mê chăm sóc người khác mà bỏ bê nhu cầu và hạnh phúc của chính mình."
          ]
        },
        {
          "type": "text",
          "title": "Bài học cuộc đời",
          "content": "<p>Bạn thường cảm thấy thất vọng khi người khác không trân trọng sự hy sinh của mình. Bài học lớn nhất của Số 6 là <strong>Yêu Thương Có Trí Tuệ và Buông Bỏ</strong>.</p><p>Bạn cần học cách yêu thương bản thân trước khi yêu thương người khác. Hãy hiểu rằng mỗi người đều có bài học riêng, bạn không thể gánh nghiệp thay họ. Hãy dừng việc làm \"bảo mẫu\" cho cả thế giới. Sự quan tâm vừa đủ và đúng lúc mới là tình yêu thương thực sự giúp người khác trưởng thành.</p>"
        },
        {
          "type": "text",
          "title": "Góc nhìn tình cảm",
          "content": "<p>Bạn là mẫu người của gia đình, chung thủy và tận tụy. Bạn khao khát một tổ ấm hạnh phúc, êm ấm. Bạn chăm sóc đối phương từng miếng ăn giấc ngủ.</p><p>Tuy nhiên, hãy cẩn thận đừng biến mình thành người phục vụ hay người mẹ thứ hai của chồng/vợ. Hãy giữ lại sự quyến rũ và độc lập của mình. Một mối quan hệ lành mạnh cần sự san sẻ trách nhiệm từ cả hai phía.</p>"
        }
      ]
    },
    "7": {
      "title": "Số chủ đạo của bạn là 7 - Nhà Tri Thức & Kẻ Đi Tìm Chân Lý",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Số 7 được mệnh danh là con số của tri thức và sự chiêm nghiệm. Bạn mang trong mình khao khát cháy bỏng là tìm hiểu bản chất gốc rễ của mọi vấn đề. Bạn là giao điểm thú vị giữa tư duy logic sắc bén của một nhà khoa học và trực giác sâu sắc của một nhà tâm linh.</p><p>Bạn thường thích làm việc độc lập, tận hưởng sự tĩnh lặng để suy ngẫm về cuộc đời và vũ trụ. Với bạn, chân lý quan trọng hơn vật chất.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm nổi bật",
          "items": [
            "<strong>Khả năng phân tích sâu sắc:</strong> Bạn có đôi mắt nhìn thấu bản chất sự việc mà người khác thường bỏ qua. Bạn không chấp nhận những câu trả lời hời hợt.",
            "<strong>Trực giác nhạy bén:</strong> Bạn thường có những linh cảm rất chính xác về con người và sự việc, đôi khi giống như giác quan thứ sáu.",
            "<strong>Ham học hỏi:</strong> Bạn là một kho tàng kiến thức sống, luôn tò mò và có khả năng tự học tuyệt vời suốt đời.",
            "<strong>Độc lập & Tĩnh lặng:</strong> Bạn không sợ sự cô đơn. Ngược lại, bạn coi không gian riêng tư là nơi nạp năng lượng cần thiết."
          ]
        },
        {
          "type": "list",
          "title": "Điểm hạn chế cần khắc phục",
          "items": [
            "<strong>Đa nghi & Khó tính:</strong> Tiêu chuẩn của bạn rất cao, khiến bạn dễ hoài nghi, xét nét và khó tin tưởng người khác.",
            "<strong>Sống khép kín:</strong> Vẻ ngoài trầm mặc, ít nói đôi khi khiến bạn trở nên lạnh lùng, xa cách và khó gần trong mắt mọi người.",
            "<strong>Suy nghĩ quá nhiều:</strong> Bộ não không ngừng hoạt động dễ khiến bạn rơi vào trạng thái căng thẳng, lo âu và mất ngủ.",
            "<strong>Bảo thủ:</strong> Bạn thường chỉ tin vào trải nghiệm và lý lẽ của chính mình, rất khó để người khác thuyết phục."
          ]
        },
        {
          "type": "text",
          "title": "Bài học cuộc đời",
          "content": "<p>Cuộc đời người số 7 thường phải trải qua những bài học thực tế thông qua sự trải nghiệm, đôi khi là những mất mát để đúc kết ra chân lý. Bài học lớn nhất dành cho bạn là <strong>Đức Tin và Sự Mở Lòng</strong>.</p><p>Bạn cần học cách cân bằng giữa thực tế và tâm linh, giữa lý trí và cảm xúc. Nhiệm vụ cao cả của bạn là dùng trí tuệ và kinh nghiệm đã chắt lọc để soi đường, chia sẻ cho người khác thay vì giữ riêng cho mình.</p>"
        },
        {
          "type": "text",
          "title": "Góc nhìn tình cảm",
          "content": "<p>Trong tình yêu, bạn không thích sự phô trương hay sến súa. Bạn cần một mối quan hệ có chiều sâu tâm hồn, nơi hai người có thể thấu hiểu nhau mà không cần nói quá nhiều.</p><p>Bạn đời lý tưởng là người biết tôn trọng không gian riêng tư của bạn và đủ tri thức để cùng bạn đàm đạo. Bạn rất chậm để bắt đầu, nhưng một khi đã chọn, bạn vô cùng chung thủy.</p>"
        }
      ]
    },
    "8": {
      "title": "Số chủ đạo của bạn là 8 - Người Kiến Tạo Thịnh Vượng & Điều Hành",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Số 8 là con số của quyền lực, tiền bạc và thành công vật chất. Bạn mang trong mình năng lượng của một người điều hành bẩm sinh, với tư duy kinh doanh sắc bén và khả năng hiện thực hóa các mục tiêu lớn.</p><p>Bạn độc lập, mạnh mẽ và rất thực tế. Cuộc đời bạn gắn liền với những tham vọng lớn và khao khát khẳng định vị thế của mình trong xã hội.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm nổi bật",
          "items": [
            "<strong>Tư duy kinh doanh:</strong> Bạn nhạy bén với các cơ hội tài chính và biết cách quản lý tiền bạc, nguồn lực hiệu quả.",
            "<strong>Quyết đoán & Bản lĩnh:</strong> Bạn không ngại khó khăn. Càng áp lực, bạn càng tỏa sáng và thể hiện được năng lực lãnh đạo.",
            "<strong>Chăm chỉ & Kiên trì:</strong> Bạn tin vào kết quả của lao động. Bạn làm việc với cường độ cao và sự tập trung tuyệt đối.",
            "<strong>Công bằng & Rõ ràng:</strong> Bạn sống sòng phẳng, rạch ròi. Bạn coi trọng sự uy tín và chất lượng thực tế."
          ]
        },
        {
          "type": "list",
          "title": "Điểm hạn chế cần khắc phục",
          "items": [
            "<strong>Thực dụng:</strong> Đôi khi bạn quá tập trung vào vật chất và danh vọng mà bỏ quên các giá trị tinh thần hoặc cảm xúc.",
            "<strong>Lạnh lùng & Độc đoán:</strong> Trong công việc, bạn có thể trở nên quá nghiêm khắc, áp đặt và thiếu sự thấu cảm với nhân viên.",
            "<strong>Cố chấp:</strong> Bạn tin tưởng tuyệt đối vào cách làm của mình và ít khi chịu lắng nghe lời khuyên trái chiều.",
            "<strong>Ít biểu lộ cảm xúc:</strong> Bạn thường giấu kín cảm xúc thật, khiến người thân cảm thấy bạn xa cách hoặc khó hiểu."
          ]
        },
        {
          "type": "text",
          "title": "Bài học cuộc đời",
          "content": "<p>Mặc dù tài chính là thế mạnh, nhưng bài học lớn nhất của Số 8 lại là <strong>Cân Bằng Giữa Vật Chất và Tinh Thần</strong>.</p><p>Bạn cần hiểu rằng tiền bạc là phương tiện, không phải là mục đích cuối cùng. Hạnh phúc thực sự đến từ sự cân bằng. Hãy học cách sử dụng quyền lực và tài chính của mình để tạo ra giá trị nhân văn cho cộng đồng, thay vì chỉ làm giàu cho bản thân.</p>"
        },
        {
          "type": "text",
          "title": "Góc nhìn tình cảm",
          "content": "<p>Bạn yêu bằng lý trí nhiều hơn cảm xúc. Bạn thể hiện tình yêu bằng cách chu cấp đầy đủ vật chất và tạo dựng nền tảng vững chắc cho gia đình.</p><p>Tuy nhiên, sự kiểm soát và tính sở hữu cao có thể làm hỏng mối quan hệ. Bạn cần học cách mềm mỏng hơn, chia sẻ cảm xúc nhiều hơn và hiểu rằng người bạn đời cần sự quan tâm ân cần chứ không chỉ là tiền bạc.</p>"
        }
      ]
    },
    "9": {
      "title": "Số chủ đạo của bạn là 9 - Nhà Nhân Đạo & Người Cho Đi",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Số 9 là con số cuối cùng của chu kỳ, đại diện cho sự hoàn thiện, lòng trắc ẩn và tình yêu thương đại đồng. Bạn mang trong mình sứ mệnh cao cả của một người phụng sự xã hội.</p><p>Bạn sở hữu tâm hồn bao dung, rộng lượng và luôn hướng tới những lý tưởng nhân văn. Bạn không chỉ sống cho mình mà còn muốn làm cho thế giới trở nên tốt đẹp hơn.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm nổi bật",
          "items": [
            "<strong>Lòng trắc ẩn bao la:</strong> Bạn dễ rung động trước nỗi đau của người khác và luôn sẵn sàng giúp đỡ không toan tính.",
            "<strong>Trách nhiệm & Uy tín:</strong> Bạn là người đáng tin cậy, luôn giữ lời hứa và sống có trách nhiệm với cộng đồng.",
            "<strong>Dũng cảm & Hy sinh:</strong> Bạn dám đứng lên bảo vệ lẽ phải và sẵn sàng hy sinh lợi ích cá nhân vì mục tiêu chung.",
            "<strong>Sức hút tự nhiên:</strong> Bạn toát ra khí chất của một người anh cả/chị cả, khiến người khác nể trọng và muốn đi theo."
          ]
        },
        {
          "type": "list",
          "title": "Điểm hạn chế cần khắc phục",
          "items": [
            "<strong>Lo chuyện bao đồng:</strong> Bạn thường vác tù và hàng tổng, lo chuyện thiên hạ mà bỏ bê chính bản thân và gia đình mình.",
            "<strong>Dễ bị lợi dụng:</strong> Lòng tốt của bạn nếu đặt không đúng chỗ sẽ dễ bị người xấu lợi dụng.",
            "<strong>Tiêu cực & Thất vọng:</strong> Khi thực tế cuộc sống không đẹp như lý tưởng, bạn dễ rơi vào trạng thái bi quan, oán trách.",
            "<strong>Quản lý tài chính kém:</strong> Bạn hào phóng và ít quan tâm đến tiểu tiết nên thường gặp khó khăn trong việc giữ tiền."
          ]
        },
        {
          "type": "text",
          "title": "Bài học cuộc đời",
          "content": "<p>Bài học lớn nhất của Số 9 là <strong>Học Cách Buông Bỏ và Tha Thứ</strong>.</p><p>Bạn cần chấp nhận rằng bạn không thể cứu cả thế giới và không phải ai cũng sống theo lý tưởng của bạn. Hãy học cách buông bỏ những nỗi đau quá khứ, tha thứ cho những người đã làm tổn thương mình. Hãy giúp đỡ người khác bằng trí tuệ, tức là trao cần câu chứ không chỉ trao con cá.</p>"
        },
        {
          "type": "text",
          "title": "Góc nhìn tình cảm",
          "content": "<p>Bạn là người yêu rất lãng mạn, sâu sắc và nghiêm túc. Bạn luôn mong muốn một mối quan hệ bền vững, lâu dài.</p><p>Tuy nhiên, đôi khi bạn áp đặt tiêu chuẩn đạo đức quá cao lên đối phương khiến họ áp lực. Hãy nhớ dành thời gian chất lượng cho người bạn đời, đừng để họ cảm thấy mình xếp sau những công việc xã hội của bạn.</p>"
        }
      ]
    },
    "11": {
      "title": "Số chủ đạo của bạn là 11 - Người Truyền Cảm Hứng & Trực Giác Tâm Linh",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Số 11 là con số Master (Số Bậc Thầy) đầu tiên, sở hữu tiềm năng tâm linh và trực giác siêu phàm. Bạn là chiếc cầu nối giữa thế giới thực tại và thế giới tinh thần. Sứ mệnh của bạn là đánh thức và khai sáng cho người khác.</p><p>Bạn sở hữu sự nhạy cảm tinh tế, tình yêu cái đẹp và khả năng thấu cảm sâu sắc. Bạn thường không màng danh lợi mà hướng tới những giá trị tinh thần cao đẹp.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm nổi bật",
          "items": [
            "<strong>Trực giác phi thường:</strong> Giác quan thứ sáu của bạn cực kỳ nhạy bén, giúp bạn cảm nhận sự việc chính xác đến kinh ngạc.",
            "<strong>Truyền cảm hứng:</strong> Sự hiện diện và lời nói của bạn có khả năng xoa dịu, chữa lành và khơi dậy niềm tin nơi người khác.",
            "<strong>Sâu sắc & Tinh tế:</strong> Bạn có đời sống nội tâm phong phú, yêu nghệ thuật và những điều đẹp đẽ.",
            "<strong>Khoan dung & Hòa nhã:</strong> Bạn yêu hòa bình, ghét xung đột và luôn đối xử nhẹ nhàng với mọi người."
          ]
        },
        {
          "type": "list",
          "title": "Điểm hạn chế cần khắc phục",
          "items": [
            "<strong>Mơ mộng thiếu thực tế:</strong> Bạn dễ bay bổng trên mây, thiếu kết nối với thực tại (đất), dẫn đến khó khăn trong đời sống vật chất.",
            "<strong>Nhạy cảm thái quá:</strong> Bạn dễ bị ảnh hưởng bởi năng lượng tiêu cực của môi trường xung quanh, dễ lo âu và trầm cảm.",
            "<strong>Thiếu quyết đoán:</strong> Sự lưỡng lự và cầu toàn khiến bạn bỏ lỡ nhiều cơ hội tốt.",
            "<strong>Cái tôi ẩn giấu:</strong> Dù vẻ ngoài khiêm tốn, nhưng bên trong bạn có thể tồn tại sự kiêu ngạo về nhận thức tâm linh của mình."
          ]
        },
        {
          "type": "text",
          "title": "Bài học cuộc đời",
          "content": "<p>Là con số Master, thử thách của bạn thường khó khăn hơn người thường. Bài học lớn nhất là <strong>Giữ Vững Đức Tin và Thực Tế Hóa Giấc Mơ</strong>.</p><p>Bạn cần học cách đứng vững trên mặt đất trước khi muốn bay lên trời. Hãy biến những trực giác và ý tưởng cao đẹp của mình thành hành động thiết thực giúp ích cho đời. Đừng để sự nhạy cảm nhấn chìm bạn, hãy dùng nó như một món quà để thấu hiểu nhân sinh.</p>"
        },
        {
          "type": "text",
          "title": "Góc nhìn tình cảm",
          "content": "<p>Trong tình yêu, bạn là người bạn đời lý tưởng với sự thấu hiểu, chung thủy và hy sinh. Bạn coi trọng sự hòa hợp về tâm hồn hơn là vật chất.</p><p>Tuy nhiên, bạn rất dễ bị tổn thương. Bạn cần một người bạn đời vững chãi, thực tế để làm điểm tựa và kéo bạn về với thực tại mỗi khi bạn quá bay bổng.</p>"
        }
      ]
    },
    "22": {
      "title": "Số chủ đạo của bạn là 22 - Kiến Trúc Sư Đại Tài & Người Xây Dựng Giấc Mơ",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Số 22 được coi là \"Số Vua\" (Master Builder) - con số quyền năng nhất trong Thần số học. Bạn là sự kết hợp hoàn hảo giữa trực giác nhạy bén của số 11 và tính kỷ luật thực tế của số 4.</p><p>Bạn sinh ra để làm những việc lớn lao. Bạn có khả năng biến những giấc mơ viển vông nhất trở thành hiện thực vĩ đại. Tầm nhìn của bạn vượt xa người bình thường.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm nổi bật",
          "items": [
            "<strong>Tầm nhìn vĩ mô:</strong> Bạn không nghĩ nhỏ. Bạn nghĩ về những dự án thay đổi cộng đồng, xã hội hoặc thế giới.",
            "<strong>Năng lực thực thi xuất sắc:</strong> Khác với những kẻ mộng mơ, bạn có đôi tay tài hoa và bộ óc tổ chức để hiện thực hóa mọi ý tưởng.",
            "<strong>Lãnh đạo & Kỷ luật:</strong> Bạn có uy quyền tự nhiên, làm việc có kế hoạch và yêu cầu sự hoàn hảo cao.",
            "<strong>Kiên định:</strong> Một khi đã đặt mục tiêu, bạn sẽ kiên trì đến cùng bất chấp mọi khó khăn."
          ]
        },
        {
          "type": "list",
          "title": "Điểm hạn chế cần khắc phục",
          "items": [
            "<strong>Áp lực cực lớn:</strong> Tiềm năng lớn đi kèm với áp lực lớn. Nếu không đạt được kỳ vọng, bạn dễ rơi vào trầm cảm hoặc tự hủy hoại.",
            "<strong>Độc đoán & Cứng nhắc:</strong> Bạn có thể trở nên quá tham vọng, lạnh lùng và gạt bỏ cảm xúc của người khác để đạt mục đích.",
            "<strong>Mê muội quyền lực:</strong> Nếu đi sai hướng, bạn có thể trở thành người đam mê vật chất và quyền lực thái quá.",
            "<strong>Sống hai mặt:</strong> Nếu không phát huy được năng lượng số 22, bạn sẽ sống lay lắt như một số 4 đầy tiêu cực (lười biếng, bảo thủ)."
          ]
        },
        {
          "type": "text",
          "title": "Bài học cuộc đời",
          "content": "<p>Bài học của Số 22 là <strong>Phụng Sự Vì Lợi Ích Chung</strong>.</p><p>Quyền năng của bạn rất lớn, nhưng nó chỉ bền vững khi bạn dùng nó để xây dựng những điều tốt đẹp cho cộng đồng. Thử thách của bạn là vượt qua cái tôi ích kỷ và nỗi sợ hãi thất bại. Hãy nhớ rằng: <em>\"Quyền lực càng cao, trách nhiệm càng lớn\"</em>.</p>"
        },
        {
          "type": "text",
          "title": "Góc nhìn tình cảm",
          "content": "<p>Bạn là người đáng tin cậy và là chỗ dựa vững chắc nhất cho gia đình. Tuy nhiên, bạn thường quá bận rộn với những hoài bão lớn mà bỏ bê việc chăm sóc tình cảm.</p><p>Bạn cần học cách cân bằng giữa sự nghiệp vĩ đại và hạnh phúc giản đơn. Đừng để người bạn đời cảm thấy họ chỉ là một phần nhỏ trong bản kế hoạch cuộc đời của bạn.</p>"
        }
      ]
    },
    "33": {
      "title": "Số chủ đạo của bạn là 33 - Người Chữa Lành & Tình Yêu Vô Điều Kiện",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Số 33 là con số Master hiếm gặp nhất, được gọi là \"Bậc Thầy Chữa Lành\". Bạn mang năng lượng của tình yêu thương vô điều kiện ở mức độ cao nhất. Sứ mệnh của bạn là nâng cao tần số rung động của nhân loại qua lòng trắc ẩn và sự hướng dẫn.</p><p>Bạn không chỉ là người mẹ của gia đình (như số 6) mà là người mẹ của cộng đồng. Bạn khao khát che chở và xoa dịu nỗi đau của mọi người.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm nổi bật",
          "items": [
            "<strong>Tình yêu thương vô bờ bến:</strong> Trái tim bạn luôn mở rộng để đón nhận và yêu thương tất cả mọi người, không phân biệt.",
            "<strong>Khả năng chữa lành:</strong> Bạn có năng khiếu thiên bẩm trong việc lắng nghe, tư vấn và giúp người khác vượt qua tổn thương tâm lý.",
            "<strong>Sáng tạo & Nghệ thuật:</strong> Bạn có tâm hồn nghệ sĩ nhạy cảm, thường truyền tải thông điệp yêu thương qua lời nói hoặc nghệ thuật.",
            "<strong>Hy sinh & Tận tụy:</strong> Bạn đặt lợi ích của người khác lên trên bản thân mình một cách tự nguyện."
          ]
        },
        {
          "type": "list",
          "title": "Điểm hạn chế cần khắc phục",
          "items": [
            "<strong>Gánh vác quá sức:</strong> Bạn thường ôm đồm nỗi đau của thiên hạ vào mình, dẫn đến kiệt quệ năng lượng.",
            "<strong>Dễ bị lợi dụng cảm xúc:</strong> Vì quá tin người và thương người, bạn dễ trở thành nạn nhân của những kẻ lừa đảo hoặc toan tính.",
            "<strong>Quên bản thân:</strong> Bạn mải mê chữa lành cho người khác mà quên rằng chính mình cũng đầy rẫy vết thương cần chăm sóc.",
            "<strong>Cảm xúc cực đoan:</strong> Nếu mất cân bằng, sự quan tâm của bạn có thể biến thành sự kiểm soát nghẹt thở."
          ]
        },
        {
          "type": "text",
          "title": "Bài học cuộc đời",
          "content": "<p>Bài học lớn nhất của Số 33 là <strong>Cân Bằng Cảm Xúc & Tình Yêu Tỉnh Thức</strong>.</p><p>Bạn cần hiểu rằng giúp đỡ người khác là tốt, nhưng không được để bản thân bị chìm nghỉm. Hãy học cách thiết lập ranh giới bảo vệ năng lượng của mình. Hãy trở thành ngọn hải đăng soi sáng chứ đừng làm con thuyền chìm cùng người bị nạn.</p>"
        },
        {
          "type": "text",
          "title": "Góc nhìn tình cảm",
          "content": "<p>Tình yêu của bạn là sự dâng hiến trọn vẹn. Bạn chăm sóc người yêu như một báu vật. Gia đình là thánh đường đối với bạn.</p><p>Tuy nhiên, hãy cẩn thận đừng biến tình yêu thành sự bi lụy hay hy sinh mù quáng. Bạn xứng đáng được nhận lại tình yêu thương tương xứng với những gì bạn đã trao đi.</p>"
        }
      ]
    }
  },
  "destiny": {
    "1": {
      "title": "Số Sứ Mệnh của bạn là 1",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Sứ mệnh: Người Tiên Phong & Lãnh Đạo.</strong><br>Bạn sinh ra với sứ mệnh trở thành người đứng đầu, người dẫn dắt và khai phá những lĩnh vực mới. Vũ trụ trao cho bạn năng lực tự chủ mạnh mẽ để bạn dám làm những việc chưa ai làm. Thành công của bạn đến từ việc tin tưởng vào bản thân và dám đứng trên đôi chân của mình. Bạn không phù hợp để làm người thừa hành hay núp bóng người khác mãi mãi.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Thiên hướng sự nghiệp:</strong><br>Bạn phát huy tốt nhất năng lực khi được làm việc độc lập hoặc nắm quyền quyết định. Môi trường cạnh tranh, áp lực cao chính là nơi tôi luyện bạn thành tài.<br><strong>Nghề nghiệp phù hợp:</strong> CEO, Chủ doanh nghiệp, Khởi nghiệp (Start-up), Quản lý cấp cao, Chỉ huy quân sự, hoặc bất kỳ công việc nào cho phép bạn tự do sáng tạo và điều hành.</p>"
        }
      ]
    },
    "2": {
      "title": "Số Sứ Mệnh của bạn là 2",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Sứ mệnh: Nhà Ngoại Giao & Người Kiến Tạo Hòa Bình.</strong><br>Sứ mệnh của bạn là mang lại sự hài hòa và kết nối giữa người với người. Bạn sở hữu \"quyền lực mềm\" – khả năng thấu hiểu tâm lý và xoa dịu mâu thuẫn mà không cần dùng đến vũ lực. Thành công của bạn không đến từ việc đơn độc chiến đấu, mà đến từ khả năng hợp tác, hỗ trợ và làm cho tập thể cùng tỏa sáng.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Thiên hướng sự nghiệp:</strong><br>Bạn có năng khiếu thiên bẩm trong việc làm việc nhóm, lắng nghe và phân tích chi tiết. Bạn là \"cánh tay phải\" đắc lực mà mọi nhà lãnh đạo đều khao khát.<br><strong>Nghề nghiệp phù hợp:</strong> Ngoại giao, Tâm lý học, Thư ký/Trợ lý cấp cao, Cố vấn, Chăm sóc khách hàng, Y tá, hoặc các công việc liên quan đến nghệ thuật cần sự tinh tế.</p>"
        }
      ]
    },
    "3": {
      "title": "Số Sứ Mệnh của bạn là 3",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Sứ mệnh: Người Truyền Cảm Hứng & Sáng Tạo Nghệ Thuật.</strong><br>Bạn sinh ra để mang lại niềm vui, tiếng cười và vẻ đẹp cho cuộc đời. Sứ mệnh của bạn là sử dụng khả năng ngôn ngữ hoặc năng khiếu nghệ thuật để nâng đỡ tinh thần của người khác. Bạn tỏa sáng rực rỡ nhất khi được đứng trước đám đông và thể hiện cái tôi độc đáo của mình. Sự tẻ nhạt và im lặng là kẻ thù của bạn.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Thiên hướng sự nghiệp:</strong><br>Bạn cần một sân khấu để biểu diễn tài năng. Công việc của bạn phải có yếu tố sáng tạo, giao tiếp và không bị gò bó bởi các quy tắc cứng nhắc.<br><strong>Nghề nghiệp phù hợp:</strong> Diễn giả, MC, Ca sĩ/Diễn viên, Nhà văn/Biên kịch, Marketing, Truyền thông, Thiết kế, hoặc Bán hàng (nhờ khả năng thuyết phục tuyệt vời).</p>"
        }
      ]
    },
    "4": {
      "title": "Số Sứ Mệnh của bạn là 4",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Sứ mệnh: Người Xây Dựng & Quản Trị Hệ Thống.</strong><br>Sứ mệnh của bạn là tạo ra trật tự từ sự hỗn loạn. Bạn sinh ra để xây dựng những nền móng vững chắc, hữu hình và lâu dài cho cộng đồng. Vũ trụ trao cho bạn sự kiên nhẫn, tỉ mỉ và đầu óc thực tế để giải quyết những vấn đề hóc búa nhất. Bạn là minh chứng cho câu nói: \"Thành công đến từ sự nỗ lực bền bỉ\".</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Thiên hướng sự nghiệp:</strong><br>Bạn làm việc hiệu quả nhất trong môi trường có quy trình rõ ràng, đòi hỏi sự chính xác cao và tính kỷ luật. Bạn là bậc thầy của việc tổ chức và quản lý rủi ro.<br><strong>Nghề nghiệp phù hợp:</strong> Kỹ sư, Kiến trúc sư, Kế toán/Kiểm toán, Quản lý dự án, Luật sư, Ngân hàng, hoặc Xây dựng.</p>"
        }
      ]
    },
    "5": {
      "title": "Số Sứ Mệnh của bạn là 5",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Sứ mệnh: Nhà Cải Cách & Người Truyền Tin Tự Do.</strong><br>Sứ mệnh của bạn là phá vỡ những lề thói cũ kỹ và mang đến làn gió mới cho thế giới. Bạn sinh ra để trải nghiệm, khám phá và thúc đẩy sự thay đổi. Bạn dạy cho người khác biết cách thích nghi và sống phóng khoáng. Cuộc đời bạn là một hành trình xê dịch không ngừng nghỉ để mở rộng tầm nhìn nhân sinh.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Thiên hướng sự nghiệp:</strong><br>Bạn sẽ chết mòn trong môi trường văn phòng 8 tiếng lặp lại. Bạn cần công việc cho phép đi lại, giao tiếp rộng rãi và liên tục có thử thách mới.<br><strong>Nghề nghiệp phù hợp:</strong> Sales/Kinh doanh, Hướng dẫn viên du lịch, Tiếp viên hàng không, Phóng viên, PR/Quan hệ công chúng, hoặc Nhà đầu tư mạo hiểm.</p>"
        }
      ]
    },
    "6": {
      "title": "Số Sứ Mệnh của bạn là 6",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Sứ mệnh: Người Chăm Sóc & Kiến Tạo Mái Ấm.</strong><br>Bạn mang trong mình sứ mệnh của sự phụng sự và yêu thương. Bạn sinh ra để chăm sóc, chữa lành và mang lại sự cân bằng cho gia đình hoặc cộng đồng. Dù làm bất cứ việc gì, đích đến cuối cùng của bạn luôn là giúp cho cuộc sống của người khác trở nên tốt đẹp hơn, tiện nghi hơn và hạnh phúc hơn.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Thiên hướng sự nghiệp:</strong><br>Bạn thành công rực rỡ trong các lĩnh vực liên quan đến con người, giáo dục và cái đẹp. Bạn làm việc bằng trái tim và tinh thần trách nhiệm cao độ.<br><strong>Nghề nghiệp phù hợp:</strong> Giáo viên, Bác sĩ/Y tá, Chuyên gia tâm lý, Trang trí nội thất, Đầu bếp, Quản lý nhân sự, hoặc các hoạt động công tác xã hội.</p>"
        }
      ]
    },
    "7": {
      "title": "Số Sứ Mệnh của bạn là 7",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Sứ mệnh: Người Tìm Kiếm Chân Lý & Bậc Thầy Tri Thức.</strong><br>Bạn sinh ra với khát khao tìm hiểu bản chất sâu xa của vạn vật. Sứ mệnh của bạn là trở thành một ngọn hải đăng của trí tuệ, dùng sự hiểu biết sâu sắc và khả năng phân tích để soi sáng những góc khuất mà người thường không thấy. Vũ trụ muốn bạn phát triển đức tin và trở thành cầu nối giữa khoa học thực chứng và thế giới tâm linh.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Thiên hướng sự nghiệp:</strong><br>Bạn không hợp với những công việc hời hợt hay chỉ chạy theo doanh số. Bạn cần môi trường cho phép nghiên cứu sâu, làm việc độc lập và đòi hỏi chất xám cao.<br><strong>Nghề nghiệp phù hợp:</strong> Nhà khoa học/Nghiên cứu, Lập trình viên/IT, Chuyên gia phân tích dữ liệu, Bác sĩ tâm lý, Nhà triết học, hoặc các lĩnh vực liên quan đến Tôn giáo/Tâm linh.</p>"
        }
      ]
    },
    "8": {
      "title": "Số Sứ Mệnh của bạn là 8",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Sứ mệnh: Người Kiến Tạo Thịnh Vượng & Cân Bằng Vật Chất.</strong><br>Sứ mệnh của bạn là chinh phục thế giới vật chất và đạt được thành công lớn về tài chính, quyền lực. Tuy nhiên, đích đến cuối cùng không chỉ là làm giàu cho bản thân, mà là học cách sử dụng đồng tiền và quyền lực đó để tạo ra giá trị bền vững cho xã hội. Bạn là người nắm giữ cán cân kinh tế.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Thiên hướng sự nghiệp:</strong><br>Bạn sinh ra để làm chủ và điều hành. Bạn chịu áp lực giỏi và có tư duy chiến lược xuất sắc. Làm nhân viên bình thường sẽ khiến bạn cảm thấy tù túng.<br><strong>Nghề nghiệp phù hợp:</strong> CEO/Giám đốc điều hành, Nhà đầu tư tài chính, Bất động sản, Ngân hàng, Chủ doanh nghiệp lớn, hoặc Chính trị gia.</p>"
        }
      ]
    },
    "9": {
      "title": "Số Sứ Mệnh của bạn là 9",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Sứ mệnh: Nhà Nhân Đạo & Người Phụng Sự Cộng Đồng.</strong><br>Bạn mang trong mình trái tim rộng lớn và tình yêu thương đại đồng. Sứ mệnh của bạn là cống hiến, cho đi và nâng tầm cuộc sống của nhân loại. Bạn được vũ trụ giao phó trách nhiệm trở thành tấm gương sáng về lòng trắc ẩn, sự bao dung và hướng thiện. Thành công của bạn đo bằng số người bạn giúp đỡ được.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Thiên hướng sự nghiệp:</strong><br>Bạn cần những công việc mang ý nghĩa xã hội sâu sắc, nơi bạn có thể truyền cảm hứng và chữa lành.<br><strong>Nghề nghiệp phù hợp:</strong> Lãnh đạo tổ chức phi chính phủ (NGO), Bác sĩ/Dược sĩ, Giáo viên, Nghệ sĩ (dùng nghệ thuật để truyền tải thông điệp), Luật sư nhân quyền, hoặc Nhà hoạt động xã hội.</p>"
        }
      ]
    },
    "11": {
      "title": "Số Sứ Mệnh của bạn là 11",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Sứ mệnh: Người Truyền Tin & Khai Sáng Tâm Linh.</strong><br>Là con số Master đầu tiên, sứ mệnh của bạn là đánh thức nhận thức của người khác và mang lại ánh sáng của trực giác. Bạn giống như một chiếc ăng-ten thu nhận thông điệp từ vũ trụ và truyền tải lại cho thế giới. Bạn sinh ra để truyền cảm hứng và giúp mọi người tìm thấy đức tin vào những điều tốt đẹp.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Thiên hướng sự nghiệp:</strong><br>Bạn sở hữu trực giác siêu phàm và khả năng thấu cảm. Bạn thành công trong các lĩnh vực đòi hỏi sự tinh tế và tầm nhìn xa.<br><strong>Nghề nghiệp phù hợp:</strong> Diễn giả truyền cảm hứng, Nhà lãnh đạo tôn giáo/tâm linh, Nhà thiết kế thời trang/nghệ thuật (tầm cỡ visionary), Nhà tâm lý trị liệu, hoặc Nhà ngoại giao văn hóa.</p>"
        }
      ]
    },
    "22": {
      "title": "Số Sứ Mệnh của bạn là 22",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Sứ mệnh: Kiến Trúc Sư Đại Tài (Master Builder).</strong><br>Sứ mệnh của bạn là biến những giấc mơ vĩ đại nhất thành hiện thực. Bạn kết hợp được tầm nhìn xa trông rộng của số 11 và khả năng thực thi kỷ luật của số 4. Bạn sinh ra để xây dựng những đế chế, những công trình hoặc hệ thống có tầm ảnh hưởng quốc tế và tồn tại mãi với thời gian.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Thiên hướng sự nghiệp:</strong><br>Bạn không làm việc nhỏ. Bạn phù hợp với các dự án quy mô lớn, mang tính toàn cầu.<br><strong>Nghề nghiệp phù hợp:</strong> Lãnh đạo tập đoàn đa quốc gia, Kiến trúc sư quy hoạch đô thị, Chính trị gia tầm cỡ quốc tế, Nhà cải cách giáo dục/y tế, hoặc Chuyên gia xây dựng hệ thống toàn cầu.</p>"
        }
      ]
    },
    "33": {
      "title": "Số Sứ Mệnh của bạn là 33",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Sứ mệnh: Bậc Thầy Chữa Lành (Master Teacher).</strong><br>Đây là con số sứ mệnh cao cả nhất, hướng về tình yêu thương vô điều kiện. Sứ mệnh của bạn là chữa lành những vết thương của nhân loại bằng lòng từ bi và sự hy sinh. Bạn là người mang lại niềm an ủi và nâng đỡ tinh thần cho những người cùng khổ nhất.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Thiên hướng sự nghiệp:</strong><br>Sự nghiệp của bạn thường không đặt nặng vấn đề tiền bạc mà tập trung vào giá trị cống hiến. Bạn là \"người mẹ\" của cộng đồng.<br><strong>Nghề nghiệp phù hợp:</strong> Bác sĩ/Y tá (đặc biệt trong các tổ chức thiện nguyện), Chuyên gia trị liệu tâm lý, Cố vấn tinh thần, Nghệ sĩ chữa lành, hoặc Người đứng đầu các tổ chức từ thiện lớn.</p>"
        }
      ]
    }
  },
  "soul": {
    "1": {
      "title": "Số Linh Hồn của bạn là 1",
      "blocks": [
        {
          "type": "text",
          "title": "Khao khát sâu thẳm",
          "content": "<p>Trong sâu thẳm, bạn khao khát sự <strong>tự do và độc lập tuyệt đối</strong>. Linh hồn bạn chỉ thực sự bình yên khi bạn được tự mình ra quyết định và làm chủ cuộc đời mình. Bạn ghét bị người khác sai bảo, kiểm soát hay phụ thuộc vào bất kỳ ai.</p><p>Động lực ngầm thôi thúc bạn mỗi sáng thức dậy là mong muốn được dẫn đầu, được chiến thắng và khẳng định cái tôi riêng biệt của mình. Bạn muốn được người khác công nhận năng lực và tôn trọng vị thế của bạn.</p>"
        },
        {
          "type": "list",
          "title": "Điều làm linh hồn bạn thỏa mãn:",
          "items": [
            "Được tự do làm việc theo cách riêng, không bị ai can thiệp.",
            "Chiến thắng trong các cuộc thi hoặc đạt được mục tiêu khó.",
            "Được người khác khen ngợi về tài năng và sự bản lĩnh.",
            "Có không gian riêng để suy nghĩ và hành động độc lập."
          ]
        },
        {
          "type": "text",
          "title": "Trong tình yêu",
          "content": "<p>Bạn cần một người yêu biết tôn trọng không gian riêng và ủng hộ những tham vọng của bạn. Bạn muốn được là \"người hùng\" trong mắt đối phương. Điều tối kỵ với bạn là sự kiểm soát hoặc sự thiếu tin tưởng từ người bạn đời.</p>"
        }
      ]
    },
    "2": {
      "title": "Số Linh Hồn của bạn là 2",
      "blocks": [
        {
          "type": "text",
          "title": "Khao khát sâu thẳm",
          "content": "<p>Linh hồn bạn khao khát <strong>tình yêu thương và sự kết nối</strong>. Bạn sợ nhất là sự cô đơn và xung đột. Hạnh phúc của bạn nằm ở sự hòa hợp trong các mối quan hệ. Bạn muốn yêu và được yêu, muốn là một phần quan trọng của một tập thể hoặc một cặp đôi.</p><p>Bạn nhạy cảm và luôn mong muốn sự công bằng, nhẹ nhàng. Bạn cảm thấy bất an trong môi trường cạnh tranh khốc liệt hoặc ồn ào.</p>"
        },
        {
          "type": "list",
          "title": "Điều làm linh hồn bạn thỏa mãn:",
          "items": [
            "Được chia sẻ, tâm sự và lắng nghe người khác.",
            "Không khí gia đình hoặc công sở hòa bình, không tranh cãi.",
            "Những cử chỉ quan tâm tinh tế, lãng mạn.",
            "Cảm giác an toàn khi có người đồng hành bên cạnh."
          ]
        },
        {
          "type": "text",
          "title": "Trong tình yêu",
          "content": "<p>Bạn là người lãng mạn bẩm sinh. Bạn cần sự vỗ về, âu yếm và những lời khẳng định tình cảm thường xuyên. Sự thờ ơ hoặc lạnh lùng của đối phương là \"nhát dao\" chí mạng đối với tâm hồn nhạy cảm của bạn.</p>"
        }
      ]
    },
    "3": {
      "title": "Số Linh Hồn của bạn là 3",
      "blocks": [
        {
          "type": "text",
          "title": "Khao khát sâu thẳm",
          "content": "<p>Bạn khao khát được <strong>thể hiện bản thân và được lắng nghe</strong>. Linh hồn bạn giống như một nghệ sĩ luôn muốn tỏa sáng dưới ánh đèn sân khấu. Bạn hạnh phúc khi mang lại tiếng cười và niềm vui cho mọi người.</p><p>Nỗi sợ lớn nhất của bạn là bị phớt lờ, bị chỉ trích hoặc sự nhàm chán. Bạn muốn cuộc sống của mình phải đầy màu sắc, thú vị và ngập tràn cảm hứng.</p>"
        },
        {
          "type": "list",
          "title": "Điều làm linh hồn bạn thỏa mãn:",
          "items": [
            "Được nói, được viết hoặc biểu diễn trước đám đông.",
            "Nhận được những tràng pháo tay hoặc lời khen ngợi.",
            "Tham gia các cuộc vui, tiệc tùng và giao lưu bạn bè.",
            "Được tự do sáng tạo mà không bị gò bó khuôn khổ."
          ]
        },
        {
          "type": "text",
          "title": "Trong tình yêu",
          "content": "<p>Bạn cần một người yêu biết lắng nghe và tán thưởng những câu chuyện của bạn. Bạn thích sự lãng mạn, bất ngờ và vui vẻ. Mối quan hệ tẻ nhạt, im lặng sẽ khiến tâm hồn bạn héo mòn.</p>"
        }
      ]
    },
    "4": {
      "title": "Số Linh Hồn của bạn là 4",
      "blocks": [
        {
          "type": "text",
          "title": "Khao khát sâu thẳm",
          "content": "<p>Linh hồn bạn khao khát <strong>sự an toàn, trật tự và ổn định</strong>. Bạn không thích những thay đổi bất ngờ hay những rủi ro không lường trước. Bạn cảm thấy bình yên nhất khi mọi thứ trong cuộc sống đều có kế hoạch rõ ràng và nằm trong tầm kiểm soát.</p><p>Bạn mong muốn xây dựng được những giá trị vững bền, hữu hình (nhà cửa, tài sản, sự nghiệp) để làm nền tảng cho tương lai.</p>"
        },
        {
          "type": "list",
          "title": "Điều làm linh hồn bạn thỏa mãn:",
          "items": [
            "Sự rõ ràng, minh bạch trong mọi việc.",
            "Cảm giác an toàn về tài chính và vật chất.",
            "Mọi thứ được sắp xếp ngăn nắp, đúng vị trí.",
            "Được người khác tin tưởng giao phó trách nhiệm."
          ]
        },
        {
          "type": "text",
          "title": "Trong tình yêu",
          "content": "<p>Bạn không cần sự lãng mạn phô trương, bạn cần sự trung thành và cam kết lâu dài. Bạn muốn một mối quan hệ rõ ràng, thực tế, nơi hai người cùng nhau xây dựng tổ ấm vững chắc.</p>"
        }
      ]
    },
    "5": {
      "title": "Số Linh Hồn của bạn là 5",
      "blocks": [
        {
          "type": "text",
          "title": "Khao khát sâu thẳm",
          "content": "<p>Tiếng gọi của linh hồn bạn là <strong>Tự Do (Freedom)</strong>. Bạn khao khát được trải nghiệm tất cả những hương vị của cuộc sống, đi đến những vùng đất mới và gặp gỡ những con người mới. Bạn sợ nhất là sự ràng buộc, lặp lại và nhàm chán.</p><p>Động lực sống của bạn là sự tò mò và khám phá. Bạn muốn sống một cuộc đời không hối tiếc, đầy ắp những kỷ niệm thú vị.</p>"
        },
        {
          "type": "list",
          "title": "Điều làm linh hồn bạn thỏa mãn:",
          "items": [
            "Những chuyến đi du lịch, phượt hoặc thám hiểm.",
            "Sự thay đổi không gian sống hoặc làm việc.",
            "Được giao tiếp và kết nối với nhiều tầng lớp xã hội.",
            "Không bị ai kiểm soát thời gian và lịch trình."
          ]
        },
        {
          "type": "text",
          "title": "Trong tình yêu",
          "content": "<p>Bạn cần một người bạn đời thú vị, phóng khoáng và cũng yêu tự do như bạn. Bạn sợ những mối quan hệ quá bi lụy hoặc kiểm soát. Tình yêu với bạn phải là một cuộc phiêu lưu đầy cảm hứng.</p>"
        }
      ]
    },
    "6": {
      "title": "Số Linh Hồn của bạn là 6",
      "blocks": [
        {
          "type": "text",
          "title": "Khao khát sâu thẳm",
          "content": "<p>Linh hồn bạn được nuôi dưỡng bằng <strong>sự chăm sóc và phụng sự</strong>. Bạn hạnh phúc nhất khi thấy những người mình yêu thương được an toàn, no ấm và vui vẻ. Bạn khao khát một mái ấm gia đình hạnh phúc, nơi ngập tràn tiếng cười và tình yêu.</p><p>Bạn muốn được người khác cần đến mình, muốn được ghi nhận sự hy sinh thầm lặng của mình. Bạn là hiện thân của tình mẫu tử bao la.</p>"
        },
        {
          "type": "list",
          "title": "Điều làm linh hồn bạn thỏa mãn:",
          "items": [
            "Chăm sóc, nấu ăn hoặc trang trí nhà cửa cho người thân.",
            "Sự hòa thuận, yêu thương trong gia đình.",
            "Được người khác trân trọng và biết ơn.",
            "Được giúp đỡ và bảo vệ những người yếu thế."
          ]
        },
        {
          "type": "text",
          "title": "Trong tình yêu",
          "content": "<p>Bạn yêu hết mình và hy sinh tất cả cho đối phương. Bạn khao khát một sự cam kết trọn đời. Tuy nhiên, bạn cũng rất dễ tổn thương nếu cảm thấy đối phương không trân trọng những gì bạn làm.</p>"
        }
      ]
    },
    "7": {
      "title": "Số Linh Hồn của bạn là 7",
      "blocks": [
        {
          "type": "text",
          "title": "Khao khát sâu thẳm",
          "content": "<p>Linh hồn bạn khao khát <strong>chân lý và sự tĩnh lặng</strong>. Bạn luôn có hàng vạn câu hỏi \"Tại sao?\" về cuộc đời và vũ trụ. Bạn hạnh phúc khi tìm ra lời giải cho những bí ẩn đó. Bạn cần không gian riêng tư để chiêm nghiệm, đọc sách và kết nối với nội tâm.</p><p>Bạn không thích những chốn ồn ào, xô bồ hay những câu chuyện phiếm vô nghĩa. Bạn tìm kiếm sự sâu sắc trong mọi thứ.</p>"
        },
        {
          "type": "list",
          "title": "Điều làm linh hồn bạn thỏa mãn:",
          "items": [
            "Không gian yên tĩnh, hòa mình với thiên nhiên.",
            "Đọc sách, nghiên cứu và khám phá kiến thức mới.",
            "Những cuộc trò chuyện sâu sắc về triết lý, nhân sinh.",
            "Thời gian ở một mình để \"sạc\" lại năng lượng."
          ]
        },
        {
          "type": "text",
          "title": "Trong tình yêu",
          "content": "<p>Bạn khó mở lòng, nhưng khi đã yêu thì rất sâu sắc. Bạn cần một người hiểu và tôn trọng sự tĩnh lặng của bạn, một người có thể cùng bạn đàm đạo về những vấn đề trí tuệ mà không đòi hỏi bạn phải thể hiện cảm xúc thái quá.</p>"
        }
      ]
    },
    "8": {
      "title": "Số Linh Hồn của bạn là 8",
      "blocks": [
        {
          "type": "text",
          "title": "Khao khát sâu thẳm",
          "content": "<p>Bạn khao khát <strong>thành công, quyền lực và sự tự do tài chính</strong>. Linh hồn bạn muốn bạn trở thành người có tầm ảnh hưởng, người nắm giữ cuộc chơi. Bạn cảm thấy an toàn và thỏa mãn khi có nguồn lực tài chính vững mạnh.</p><p>Bạn muốn được xã hội công nhận đẳng cấp và vị thế của mình. Bạn ghét sự nghèo khó, yếu đuối hay phụ thuộc.</p>"
        },
        {
          "type": "list",
          "title": "Điều làm linh hồn bạn thỏa mãn:",
          "items": [
            "Đạt được các mục tiêu tài chính lớn.",
            "Điều hành, quản lý và gây ảnh hưởng lên người khác.",
            "Sở hữu những món đồ chất lượng, sang trọng.",
            "Cảm giác chiến thắng và chinh phục thử thách."
          ]
        },
        {
          "type": "text",
          "title": "Trong tình yêu",
          "content": "<p>Bạn muốn một mối quan hệ \"xứng đôi vừa lứa\". Bạn thường thể hiện tình yêu bằng vật chất và sự che chở. Bạn cần một người bạn đời thông minh, biết cách hỗ trợ bạn trong sự nghiệp và ngoại giao.</p>"
        }
      ]
    },
    "9": {
      "title": "Số Linh Hồn của bạn là 9",
      "blocks": [
        {
          "type": "text",
          "title": "Khao khát sâu thẳm",
          "content": "<p>Linh hồn bạn khao khát được <strong>cống hiến và phụng sự nhân loại</strong>. Bạn có một tình yêu thương rộng lớn, vượt ra khỏi biên giới gia đình. Bạn hạnh phúc khi thấy mình sống có ích, khi giúp đỡ được người khác vượt qua khổ đau.</p><p>Bạn là người theo đuổi chủ nghĩa lý tưởng. Bạn muốn thế giới này trở nên tốt đẹp hơn, công bằng hơn và nhân ái hơn.</p>"
        },
        {
          "type": "list",
          "title": "Điều làm linh hồn bạn thỏa mãn:",
          "items": [
            "Tham gia các hoạt động thiện nguyện, cộng đồng.",
            "Giúp đỡ người khác thay đổi cuộc sống.",
            "Được tha thứ và buông bỏ những oán giận.",
            "Sống đúng với lý tưởng cao đẹp của mình."
          ]
        },
        {
          "type": "text",
          "title": "Trong tình yêu",
          "content": "<p>Bạn lãng mạn, bao dung và hay mủi lòng. Bạn khao khát một tình yêu hòa hợp cả về thể xác lẫn tâm hồn. Bạn cần một người biết trân trọng tấm lòng nhân ái của bạn và không lợi dụng sự tốt bụng đó.</p>"
        }
      ]
    },
    "11": {
      "title": "Số Linh Hồn của bạn là 11",
      "blocks": [
        {
          "type": "text",
          "title": "Khao khát sâu thẳm",
          "content": "<p>Bạn khao khát <strong>sự giác ngộ và hòa hợp tâm linh</strong>. Linh hồn bạn cực kỳ nhạy cảm và tinh tế. Bạn mong muốn trở thành nguồn cảm hứng, mang lại ánh sáng và niềm tin cho người khác.</p><p>Bạn tìm kiếm sự hoàn hảo và vẻ đẹp chân thiện mỹ. Bạn cảm thấy đau đớn trước sự bất công, giả dối hay thô bạo của cuộc đời.</p>"
        },
        {
          "type": "list",
          "title": "Điều làm linh hồn bạn thỏa mãn:",
          "items": [
            "Kết nối sâu sắc về mặt tâm linh, tôn giáo.",
            "Sự hòa hợp, bình yên trong tâm hồn.",
            "Được chia sẻ trực giác và tầm nhìn với người tri kỷ.",
            "Sống trong môi trường nghệ thuật, thanh tao."
          ]
        },
        {
          "type": "text",
          "title": "Trong tình yêu",
          "content": "<p>Bạn tìm kiếm một người bạn đời tâm giao (soulmate). Tình yêu với bạn là sự hòa quyện của hai tâm hồn. Bạn cần sự tinh tế, thấu hiểu và nhẹ nhàng tuyệt đối từ đối phương.</p>"
        }
      ]
    },
    "22": {
      "title": "Số Linh Hồn của bạn là 22",
      "blocks": [
        {
          "type": "text",
          "title": "Khao khát sâu thẳm",
          "content": "<p>Bạn khao khát <strong>kiến tạo những điều vĩ đại</strong>. Linh hồn bạn không thỏa mãn với những thành tựu nhỏ bé cá nhân, bạn muốn để lại di sản lớn lao cho cộng đồng. Bạn có tầm nhìn của một kiến trúc sư đại tài muốn xây dựng thế giới.</p><p>Bạn mong muốn kết hợp được lý tưởng cao đẹp với hành động thực tế để tạo ra kết quả hữu hình, bền vững.</p>"
        },
        {
          "type": "list",
          "title": "Điều làm linh hồn bạn thỏa mãn:",
          "items": [
            "Thực hiện được các dự án quy mô lớn.",
            "Nhìn thấy ý tưởng của mình thành hiện thực.",
            "Được dẫn dắt tổ chức đi đến thành công bền vững.",
            "Tạo ra tác động tích cực trên diện rộng."
          ]
        },
        {
          "type": "text",
          "title": "Trong tình yêu",
          "content": "<p>Bạn cần một người bạn đời vững chãi, cùng chung chí hướng lớn và có khả năng chia sẻ gánh nặng với bạn. Bạn muốn cùng người ấy xây dựng một \"đế chế\" gia đình thịnh vượng.</p>"
        }
      ]
    },
    "33": {
      "title": "Số Linh Hồn của bạn là 33",
      "blocks": [
        {
          "type": "text",
          "title": "Khao khát sâu thẳm",
          "content": "<p>Bạn khao khát trở thành <strong>người chữa lành cho thế giới</strong>. Linh hồn bạn rung động với tình yêu thương vô điều kiện ở tầng bậc cao nhất. Bạn muốn xoa dịu nỗi đau của nhân loại và nâng đỡ những tâm hồn lạc lối.</p><p>Hạnh phúc của bạn là sự cho đi không toan tính. Bạn cảm thấy mình có sứ mệnh phải chăm sóc cho \"đại gia đình\" nhân loại.</p>"
        },
        {
          "type": "list",
          "title": "Điều làm linh hồn bạn thỏa mãn:",
          "items": [
            "Mang lại sự chữa lành và bình an cho người khác.",
            "Được sống trong tình yêu thương chan hòa.",
            "Thực hiện các sứ mệnh nhân đạo cao cả.",
            "Bảo vệ và nuôi dưỡng những điều tốt đẹp."
          ]
        },
        {
          "type": "text",
          "title": "Trong tình yêu",
          "content": "<p>Tình yêu của bạn bao la như biển cả. Bạn sẵn sàng hy sinh tất cả cho người mình yêu. Bạn cần một người biết trân trọng sự thánh thiện đó và cùng bạn lan tỏa yêu thương, chứ không phải lợi dụng nó.</p>"
        }
      ]
    }
  },
  "personality": {
    "1": {
      "title": "Số Nhân Cách của bạn là 1",
      "blocks": [
        {
          "type": "text",
          "title": "Ấn tượng đầu tiên",
          "content": "<p>Người khác nhìn thấy ở bạn một khí chất <strong>mạnh mẽ, độc lập và đầy tự tin</strong>. Ngay cả khi bạn không cố ý, sự hiện diện của bạn vẫn toát lên vẻ uy quyền khiến người khác phải nể trọng (hoặc đôi khi là hơi e dè).</p><p>Bạn thường có dáng đi thẳng, ánh mắt kiên định và phong thái của một người không thích vòng vo. Bạn trông giống như một người biết rõ mình đang đi đâu và làm gì.</p>"
        },
        {
          "type": "list",
          "title": "Cách người khác nhìn nhận bạn:",
          "items": [
            "Người lãnh đạo, tiên phong, dám nghĩ dám làm.",
            "Hơi lạnh lùng, khó gần hoặc kiêu kỳ trong lần đầu gặp.",
            "Ăn mặc chỉnh tề, cá tính và có gu riêng biệt.",
            "Người thẳng thắn, không thích sự rườm rà."
          ]
        },
        {
          "type": "text",
          "title": "Phong thái giao tiếp",
          "content": "<p>Trong các cuộc xã giao, bạn thường là người chủ động bắt chuyện hoặc dẫn dắt câu chuyện. Bạn nói chuyện dứt khoát, đi thẳng vào vấn đề. Tuy nhiên, hãy cẩn thận để không bị đánh giá là áp đặt hay hiếu thắng.</p>"
        }
      ]
    },
    "2": {
      "title": "Số Nhân Cách của bạn là 2",
      "blocks": [
        {
          "type": "text",
          "title": "Ấn tượng đầu tiên",
          "content": "<p>Bạn mang đến cho người đối diện cảm giác <strong>ấm áp, dễ gần và an toàn</strong>. Bạn trông có vẻ hiền lành, khiêm tốn và không bao giờ gây gổ. Mọi người thường cảm thấy thoải mái và muốn tâm sự với bạn ngay từ lần đầu gặp gỡ.</p><p>Vẻ ngoài của bạn thường gọn gàng, nhẹ nhàng, không quá phô trương hay lòe loẹt. Bạn toát lên sự tinh tế và nhạy cảm.</p>"
        },
        {
          "type": "list",
          "title": "Cách người khác nhìn nhận bạn:",
          "items": [
            "Người biết lắng nghe và thấu hiểu.",
            "Hòa nhã, lịch sự và rất khéo léo trong ứng xử.",
            "Hơi nhút nhát, e dè hoặc thiếu quyết đoán.",
            "Người đáng tin cậy để giữ bí mật."
          ]
        },
        {
          "type": "text",
          "title": "Phong thái giao tiếp",
          "content": "<p>Bạn nói chuyện nhỏ nhẹ, từ tốn và rất để ý đến cảm xúc của người nghe. Bạn hiếm khi ngắt lời người khác. Bạn là mẫu người hòa giải tuyệt vời trong các đám đông.</p>"
        }
      ]
    },
    "3": {
      "title": "Số Nhân Cách của bạn là 3",
      "blocks": [
        {
          "type": "text",
          "title": "Ấn tượng đầu tiên",
          "content": "<p>Bạn xuất hiện ở đâu là ở đó sáng bừng lên. Bạn toát lên vẻ <strong>vui vẻ, hoạt bát và đầy sức sống</strong>. Người khác thấy bạn là một người thú vị, hài hước và rất lôi cuốn. Bạn thường có nụ cười rạng rỡ và đôi mắt biết cười.</p><p>Phong cách ăn mặc của bạn thường có điểm nhấn, màu sắc hoặc phụ kiện bắt mắt. Bạn không ngại nổi bật giữa đám đông.</p>"
        },
        {
          "type": "list",
          "title": "Cách người khác nhìn nhận bạn:",
          "items": [
            "Người hướng ngoại, thân thiện và dễ kết bạn.",
            "Hài hước, thông minh và có duyên ăn nói.",
            "Đôi khi hơi phù phiếm hoặc thích gây sự chú ý.",
            "Nguồn năng lượng tích cực của tập thể."
          ]
        },
        {
          "type": "text",
          "title": "Phong thái giao tiếp",
          "content": "<p>Bạn nói nhiều, nói nhanh và rất biết cách kể chuyện cuốn hút. Bạn dễ dàng làm quen với người lạ. Tuy nhiên, đôi khi bạn có thể bị đánh giá là nói quá nhiều hoặc thiếu chiều sâu nếu không tiết chế.</p>"
        }
      ]
    },
    "4": {
      "title": "Số Nhân Cách của bạn là 4",
      "blocks": [
        {
          "type": "text",
          "title": "Ấn tượng đầu tiên",
          "content": "<p>Bạn trông rất <strong>nghiêm túc, chỉn chu và đáng tin cậy</strong>. Người khác nhìn vào bạn sẽ thấy ngay sự vững chãi, giống như \"cột đình\". Bạn không toát lên vẻ lả lướt hay tùy hứng, mà là sự trật tự và kỷ luật.</p><p>Trang phục của bạn thường theo phong cách cổ điển, bền đẹp, gọn gàng và phù hợp hoàn cảnh. Bạn ghét sự luộm thuộm.</p>"
        },
        {
          "type": "list",
          "title": "Cách người khác nhìn nhận bạn:",
          "items": [
            "Người thực tế, làm việc đâu ra đó.",
            "Hơi khô khan, cứng nhắc hoặc khó tính.",
            "Rất đúng giờ và giữ lời hứa.",
            "Người có trách nhiệm cao, có thể dựa dẫm được."
          ]
        },
        {
          "type": "text",
          "title": "Phong thái giao tiếp",
          "content": "<p>Bạn kiệm lời, nói chuyện ngắn gọn, súc tích và tập trung vào trọng tâm. Bạn không thích đùa cợt vô bổ. Người lạ có thể thấy bạn hơi lạnh lùng, nhưng khi quen sẽ thấy bạn rất chân thành.</p>"
        }
      ]
    },
    "5": {
      "title": "Số Nhân Cách của bạn là 5",
      "blocks": [
        {
          "type": "text",
          "title": "Ấn tượng đầu tiên",
          "content": "<p>Bạn toát lên sự <strong>năng động, quyến rũ và phóng khoáng</strong>. Có một sự \"bất cần\" đầy thu hút ở bạn. Người khác thấy bạn là người sành điệu, cập nhật xu hướng và rất linh hoạt. Bạn dường như không bao giờ ngồi yên một chỗ.</p><p>Phong cách của bạn đa dạng, phá cách và đôi khi hơi táo bạo. Bạn biết cách dùng ngoại hình để tạo ấn tượng.</p>"
        },
        {
          "type": "list",
          "title": "Cách người khác nhìn nhận bạn:",
          "items": [
            "Người thú vị, nhiều trải nghiệm và hiểu biết rộng.",
            "Hơi thất thường, khó nắm bắt.",
            "Có sức hấp dẫn giới tính tự nhiên (magnetic).",
            "Thích phiêu lưu và không ngại thay đổi."
          ]
        },
        {
          "type": "text",
          "title": "Phong thái giao tiếp",
          "content": "<p>Bạn giao tiếp cởi mở, dí dỏm và dễ dàng thích nghi với mọi đối tượng, từ sang trọng đến bình dân. Bạn biết cách khuấy động bầu không khí, nhưng cũng dễ bị đánh giá là người cả thèm chóng chán.</p>"
        }
      ]
    },
    "6": {
      "title": "Số Nhân Cách của bạn là 6",
      "blocks": [
        {
          "type": "text",
          "title": "Ấn tượng đầu tiên",
          "content": "<p>Bạn mang dáng vẻ của một <strong>người chăm sóc, từ tốn và bao dung</strong>. Ở bạn toát lên \"năng lượng của cha mẹ\" - sự bảo bọc và quan tâm. Mọi người thường tìm đến bạn khi họ cần lời khuyên hoặc sự an ủi.</p><p>Bạn thường ăn mặc trang nhã, thoải mái nhưng vẫn có gu thẩm mỹ tốt. Bạn thích tạo cảm giác ấm cúng cho người xung quanh.</p>"
        },
        {
          "type": "list",
          "title": "Cách người khác nhìn nhận bạn:",
          "items": [
            "Người tốt bụng, hay giúp đỡ người khác.",
            "Người của gia đình, đáng tin cậy và chu đáo.",
            "Đôi khi hơi lo xa hoặc hay can thiệp vào chuyện người khác.",
            "Có khiếu nghệ thuật và yêu cái đẹp."
          ]
        },
        {
          "type": "text",
          "title": "Phong thái giao tiếp",
          "content": "<p>Bạn nói chuyện nhẹ nhàng, ân cần và hay hỏi han về đời sống cá nhân, sức khỏe của người đối diện. Bạn tạo cảm giác thân thiện như người nhà ngay lần đầu gặp.</p>"
        }
      ]
    },
    "7": {
      "title": "Số Nhân Cách của bạn là 7",
      "blocks": [
        {
          "type": "text",
          "title": "Ấn tượng đầu tiên",
          "content": "<p>Bạn có vẻ ngoài <strong>bí ẩn, trầm mặc và trí thức</strong>. Có một bức tường vô hình ngăn cách bạn với thế giới bên ngoài, khiến người khác tò mò nhưng không dám tùy tiện lại gần. Bạn thường hay quan sát hơn là tham gia vào đám đông.</p><p>Bạn ăn mặc chỉnh tề, lịch sự nhưng không chạy theo mốt. Đôi mắt của bạn thường rất sáng và có chiều sâu.</p>"
        },
        {
          "type": "list",
          "title": "Cách người khác nhìn nhận bạn:",
          "items": [
            "Người thông thái, hiểu biết sâu rộng.",
            "Lạnh lùng, khó hiểu và sống nội tâm.",
            "Người lập dị hoặc có những sở thích khác thường.",
            "Rất tinh tế và hay để ý chi tiết."
          ]
        },
        {
          "type": "text",
          "title": "Phong thái giao tiếp",
          "content": "<p>Bạn ít nói, nhưng khi nói thì lời nào \"chất\" lời đó. Bạn không thích những câu chuyện xã giao hời hợt. Người khác thường nể phục kiến thức của bạn nhưng cũng cảm thấy bạn hơi xa cách.</p>"
        }
      ]
    },
    "8": {
      "title": "Số Nhân Cách của bạn là 8",
      "blocks": [
        {
          "type": "text",
          "title": "Ấn tượng đầu tiên",
          "content": "<p>Bạn toát lên khí chất <strong>quyền lực, giàu có và thành đạt</strong>. Dù bạn có đang giàu thật hay không, phong thái của bạn vẫn rất sang trọng và đĩnh đạc. Người khác nhìn vào là thấy sự uy tín và khả năng kiểm soát tình hình.</p><p>Bạn thường chọn trang phục chất lượng cao, đắt tiền hoặc có thương hiệu để khẳng định vị thế. Bạn rất chú trọng vẻ bề ngoài.</p>"
        },
        {
          "type": "list",
          "title": "Cách người khác nhìn nhận bạn:",
          "items": [
            "Người có năng lực, mạnh mẽ và quyết đoán.",
            "Hơi thực dụng hoặc coi trọng vật chất.",
            "Có tố chất lãnh đạo hoặc làm sếp.",
            "Khá bận rộn và coi trọng hiệu quả."
          ]
        },
        {
          "type": "text",
          "title": "Phong thái giao tiếp",
          "content": "<p>Bạn giao tiếp tự tin, mắt nhìn thẳng, giọng nói vang và có sức thuyết phục. Bạn thích nói về công việc, đầu tư hoặc các dự án lớn. Đôi khi bạn có thể áp đảo người đối diện.</p>"
        }
      ]
    },
    "9": {
      "title": "Số Nhân Cách của bạn là 9",
      "blocks": [
        {
          "type": "text",
          "title": "Ấn tượng đầu tiên",
          "content": "<p>Bạn có vẻ ngoài <strong>quý phái, hào phóng và thiện lương</strong>. Bạn thu hút người khác bởi sự thân thiện nhưng vẫn giữ được nét thanh cao, không suồng sã. Mọi người cảm thấy bạn là một người \"anh cả/chị cả\" đáng kính trọng.</p><p>Phong cách của bạn thường thoải mái, rộng rãi nhưng vẫn rất có gu. Bạn có đôi mắt nhìn người bao dung.</p>"
        },
        {
          "type": "list",
          "title": "Cách người khác nhìn nhận bạn:",
          "items": [
            "Người tốt bụng, hào hiệp và hay làm từ thiện.",
            "Có tầm ảnh hưởng và uy tín trong cộng đồng.",
            "Hơi ngây thơ hoặc dễ tin người.",
            "Người lý tưởng hóa mọi chuyện."
          ]
        },
        {
          "type": "text",
          "title": "Phong thái giao tiếp",
          "content": "<p>Bạn nói chuyện cuốn hút, đầy cảm xúc và hay truyền cảm hứng. Bạn dễ dàng kết nối với mọi tầng lớp người mà không phân biệt đối xử. Mọi người thích ở bên cạnh bạn vì cảm giác được chấp nhận.</p>"
        }
      ]
    },
    "11": {
      "title": "Số Nhân Cách của bạn là 11",
      "blocks": [
        {
          "type": "text",
          "title": "Ấn tượng đầu tiên",
          "content": "<p>Bạn toát lên vẻ <strong>nhẹ nhàng, mơ mộng và đầy chất nghệ sĩ</strong>. Có một luồng điện hoặc sự thu hút tâm linh tỏa ra từ bạn. Người khác cảm thấy bạn khác biệt, sâu sắc và có chút gì đó khó nắm bắt như đang \"ở trên mây\".</p><p>Trang phục của bạn thường độc đáo, mang hơi hướng tâm linh hoặc nghệ thuật. Bạn không thích những gì quá thô cứng.</p>"
        },
        {
          "type": "list",
          "title": "Cách người khác nhìn nhận bạn:",
          "items": [
            "Người có trực giác mạnh, hay nói những điều triết lý.",
            "Nhạy cảm, dễ xúc động và giàu lòng trắc ẩn.",
            "Hơi lập dị hoặc sống tách biệt với thực tế.",
            "Người truyền cảm hứng bẩm sinh."
          ]
        },
        {
          "type": "text",
          "title": "Phong thái giao tiếp",
          "content": "<p>Bạn là người lắng nghe tuyệt vời và hay đưa ra những lời khuyên sâu sắc chạm đến trái tim người khác. Tuy nhiên, đôi khi bạn có vẻ lơ đễnh hoặc căng thẳng vì quá nhạy cảm với môi trường xung quanh.</p>"
        }
      ]
    },
    "22": {
      "title": "Số Nhân Cách của bạn là 22",
      "blocks": [
        {
          "type": "text",
          "title": "Ấn tượng đầu tiên",
          "content": "<p>Bạn là sự kết hợp giữa <strong>sự vững chắc của số 4 và tầm nhìn của số 11</strong>. Bạn trông cực kỳ có năng lực, giống như một chuyên gia hàng đầu. Người khác nhìn vào bạn là thấy sự tin tưởng tuyệt đối: \"Việc này giao cho người này là xong\".</p><p>Bạn ăn mặc thực tế nhưng rất chất lượng. Mọi thứ trên người bạn đều toát lên sự chuyên nghiệp và hiệu quả.</p>"
        },
        {
          "type": "list",
          "title": "Cách người khác nhìn nhận bạn:",
          "items": [
            "Người tài giỏi, có khả năng làm những việc lớn.",
            "Rất kiên định, logic và có tổ chức.",
            "Hơi tham vọng hoặc quá tập trung vào công việc.",
            "Điểm tựa vững chắc cho tập thể."
          ]
        },
        {
          "type": "text",
          "title": "Phong thái giao tiếp",
          "content": "<p>Bạn nói chuyện logic, chặt chẽ và đầy sức thuyết phục. Bạn không nói những chuyện viển vông. Lời nói của bạn thường đi kèm với giải pháp và hành động cụ thể.</p>"
        }
      ]
    },
    "33": {
      "title": "Số Nhân Cách của bạn là 33",
      "blocks": [
        {
          "type": "text",
          "title": "Ấn tượng đầu tiên",
          "content": "<p>Bạn toát lên khí chất của một <strong>người chữa lành vĩ đại</strong>. Sự hiện diện của bạn mang lại cảm giác bình an lạ kỳ cho người đối diện. Bạn trông hiền hậu, bao dung nhưng cũng rất uy nghiêm.</p><p>Phong cách của bạn giản dị, gần gũi nhưng toát lên sự thanh cao. Bạn thường thu hút trẻ em và động vật một cách tự nhiên.</p>"
        },
        {
          "type": "list",
          "title": "Cách người khác nhìn nhận bạn:",
          "items": [
            "Người có tấm lòng bồ tát, luôn hy sinh vì người khác.",
            "Nơi nương tựa tinh thần vững chắc.",
            "Hơi ôm đồm hoặc hay lo chuyện bao đồng.",
            "Rất ấm áp, thân thiện và không vụ lợi."
          ]
        },
        {
          "type": "text",
          "title": "Phong thái giao tiếp",
          "content": "<p>Lời nói của bạn nhẹ nhàng nhưng có trọng lượng lớn. Bạn luôn nói những lời khích lệ, động viên và xoa dịu nỗi đau của người khác. Bạn là người mà ai cũng muốn tâm sự khi gặp khó khăn.</p>"
        }
      ]
    }
  },
  "attitude": {
    "1": {
      "title": "Chỉ số Thái độ của bạn là 1",
      "blocks": [
        {
          "type": "text",
          "title": "Phản ứng tự nhiên",
          "content": "<p>Khi đối mặt với một vấn đề mới hoặc khó khăn, phản ứng đầu tiên của bạn là <strong>tự mình giải quyết</strong>. Bạn không thích nhờ vả hay chờ đợi người khác. Bạn thể hiện sự tự tin, quyết đoán và muốn nắm quyền kiểm soát tình hình ngay lập tức.</p><p>Thái độ sống của bạn là: \"Tôi có thể làm được\". Bạn không sợ thử thách và thường là người đầu tiên giơ tay nhận trách nhiệm hoặc đưa ra ý kiến.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm thái độ:",
          "items": [
            "Độc lập, không thích bị chỉ đạo.",
            "Thẳng thắn, đi vào trọng tâm vấn đề.",
            "Có lòng tự trọng cao, ghét bị chê trách công khai.",
            "Luôn muốn là người dẫn đầu hoặc làm theo cách riêng."
          ]
        },
        {
          "type": "text",
          "title": "Cách xử lý khủng hoảng",
          "content": "<p>Bạn thường đối đầu trực diện với khủng hoảng thay vì né tránh. Tuy nhiên, khi áp lực quá lớn, bạn dễ trở nên nóng nảy, áp đặt và thiếu kiên nhẫn với những người chậm chạp hơn mình.</p>"
        }
      ]
    },
    "2": {
      "title": "Chỉ số Thái độ của bạn là 2",
      "blocks": [
        {
          "type": "text",
          "title": "Phản ứng tự nhiên",
          "content": "<p>Trước một tình huống mới, bạn thường <strong>quan sát và lắng nghe</strong> trước khi hành động. Bạn tiếp cận vấn đề một cách nhẹ nhàng, thận trọng và luôn để ý đến cảm xúc của những người xung quanh.</p><p>Thái độ sống của bạn thiên về sự hòa bình. Bạn không thích tranh cãi hay gây hấn. Bạn thường tìm kiếm sự đồng thuận và hợp tác thay vì đối đầu.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm thái độ:",
          "items": [
            "Dịu dàng, nhã nhặn và lịch thiệp.",
            "Hay để ý chi tiết và trực giác tốt.",
            "Thích làm việc cùng người khác hơn là làm một mình.",
            "Dễ bị tác động bởi môi trường xung quanh."
          ]
        },
        {
          "type": "text",
          "title": "Cách xử lý khủng hoảng",
          "content": "<p>Khi gặp rắc rối, bạn có xu hướng lo lắng và tìm kiếm lời khuyên hoặc sự trấn an từ người thân. Bạn giải quyết mâu thuẫn bằng sự mềm mỏng, ngoại giao nhưng đôi khi thiếu quyết đoán.</p>"
        }
      ]
    },
    "3": {
      "title": "Chỉ số Thái độ của bạn là 3",
      "blocks": [
        {
          "type": "text",
          "title": "Phản ứng tự nhiên",
          "content": "<p>Bạn đối diện với cuộc sống bằng nụ cười và sự <strong>lạc quan tếu táo</strong>. Khi gặp vấn đề, bạn thường cố gắng tìm ra khía cạnh hài hước hoặc tích cực của nó. Bạn không thích sự nghiêm trọng hóa vấn đề.</p><p>Thái độ của bạn rất cởi mở, thân thiện và giàu năng lượng. Bạn thích chia sẻ suy nghĩ của mình và lan tỏa niềm vui đến mọi người.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm thái độ:",
          "items": [
            "Vui vẻ, hoạt bát và hay cười.",
            "Thích giao tiếp và kết nối xã hội.",
            "Sáng tạo và linh hoạt trong cách xử lý.",
            "Đôi khi hơi trẻ con hoặc thiếu nghiêm túc."
          ]
        },
        {
          "type": "text",
          "title": "Cách xử lý khủng hoảng",
          "content": "<p>Bạn dùng sự hài hước để giảm bớt căng thẳng. Tuy nhiên, khi buồn bã, bạn có xu hướng che giấu cảm xúc thật sau vẻ ngoài vui vẻ, hoặc nói rất nhiều để giải tỏa tâm lý.</p>"
        }
      ]
    },
    "4": {
      "title": "Chỉ số Thái độ của bạn là 4",
      "blocks": [
        {
          "type": "text",
          "title": "Phản ứng tự nhiên",
          "content": "<p>Bạn tiếp cận mọi việc với thái độ <strong>nghiêm túc, thực tế và cẩn trọng</strong>. Khi có vấn đề xảy ra, câu hỏi đầu tiên của bạn là: \"Kế hoạch là gì?\" và \"Quy trình ra sao?\". Bạn không tin vào may rủi.</p><p>Bạn bè và đồng nghiệp tin tưởng bạn vì sự bình tĩnh và chắc chắn. Bạn luôn chuẩn bị kỹ càng và ghét những sự thay đổi đột ngột không báo trước.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm thái độ:",
          "items": [
            "Kỷ luật, đúng giờ và ngăn nắp.",
            "Trung thực, thẳng thắn nhưng hơi khô khan.",
            "Làm việc có quy trình, ghét sự lộn xộn.",
            "Kiên trì và chịu áp lực tốt."
          ]
        },
        {
          "type": "text",
          "title": "Cách xử lý khủng hoảng",
          "content": "<p>Bạn là người giữ bình tĩnh tốt nhất trong đám đông. Bạn sẽ phân tích tình hình, lập danh sách việc cần làm và giải quyết từng bước một. Tuy nhiên, bạn có thể trở nên cứng nhắc và bảo thủ khi bị thúc ép.</p>"
        }
      ]
    },
    "5": {
      "title": "Chỉ số Thái độ của bạn là 5",
      "blocks": [
        {
          "type": "text",
          "title": "Phản ứng tự nhiên",
          "content": "<p>Thái độ sống của bạn là sự <strong>hào hứng, tò mò và thích ứng nhanh</strong>. Bạn coi những thay đổi bất ngờ là cơ hội để trải nghiệm chứ không phải là rủi ro. Bạn ghét sự nhàm chán và lặp lại.</p><p>Bạn luôn toát lên năng lượng của sự tự do. Bạn tiếp cận người lạ rất nhanh, dễ làm quen và luôn là tâm điểm của sự chú ý nhờ sự duyên dáng, hóm hỉnh.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm thái độ:",
          "items": [
            "Phóng khoáng, vui vẻ và nhiệt tình.",
            "Thích nghi cực nhanh với môi trường mới.",
            "Ghét bị ràng buộc hay kiểm soát.",
            "Đôi khi bốc đồng và thiếu kiên nhẫn."
          ]
        },
        {
          "type": "text",
          "title": "Cách xử lý khủng hoảng",
          "content": "<p>Bạn phản ứng nhanh nhạy và linh hoạt tìm ra giải pháp tức thời \"chữa cháy\". Tuy nhiên, bạn thường thiếu kiên nhẫn để giải quyết tận gốc các vấn đề đòi hỏi sự tỉ mỉ lâu dài.</p>"
        }
      ]
    },
    "6": {
      "title": "Chỉ số Thái độ của bạn là 6",
      "blocks": [
        {
          "type": "text",
          "title": "Phản ứng tự nhiên",
          "content": "<p>Bạn đối diện với thế giới bằng thái độ của một <strong>người chăm sóc và bảo vệ</strong>. Khi thấy ai đó gặp khó khăn, phản xạ tự nhiên của bạn là hỏi han và giúp đỡ. Bạn luôn quan tâm đến sự an toàn và tiện nghi của mọi người.</p><p>Bạn thường gánh vác trách nhiệm về mình, ngay cả khi không ai yêu cầu. Bạn muốn mọi thứ xung quanh phải hài hòa và đẹp đẽ.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm thái độ:",
          "items": [
            "Ân cần, chu đáo và hay lo lắng.",
            "Có trách nhiệm cao với tập thể.",
            "Thích sắp xếp, trang trí và chăm chút.",
            "Dễ bị ôm đồm việc của người khác."
          ]
        },
        {
          "type": "text",
          "title": "Cách xử lý khủng hoảng",
          "content": "<p>Bạn sẽ đứng ra lo liệu mọi thứ để đảm bảo mọi người được ổn thỏa. Tuy nhiên, bạn dễ bị stress vì lo lắng thái quá hoặc cảm thấy tủi thân nếu sự hy sinh của mình không được ghi nhận.</p>"
        }
      ]
    },
    "7": {
      "title": "Chỉ số Thái độ của bạn là 7",
      "blocks": [
        {
          "type": "text",
          "title": "Phản ứng tự nhiên",
          "content": "<p>Trước mọi vấn đề, bạn luôn giữ thái độ <strong>điềm tĩnh, quan sát và suy ngẫm</strong>. Bạn không vội vàng kết luận hay hành động theo đám đông. Bạn cần thời gian để phân tích và tìm hiểu nguyên nhân gốc rễ.</p><p>Người khác thường thấy bạn hơi bí ẩn, khó đoán và có phần tách biệt. Bạn không dễ dàng bộc lộ cảm xúc thật ra bên ngoài.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm thái độ:",
          "items": [
            "Sâu sắc, ít nói và hay quan sát.",
            "Đa nghi, luôn đặt câu hỏi \"Tại sao?\".",
            "Thích làm việc độc lập, ghét ồn ào.",
            "Cầu toàn và có tiêu chuẩn cao."
          ]
        },
        {
          "type": "text",
          "title": "Cách xử lý khủng hoảng",
          "content": "<p>Bạn sẽ thu mình lại vào một không gian riêng để suy nghĩ. Bạn dùng trí tuệ và logic để giải quyết vấn đề. Bạn ghét bị ai đó thúc giục hoặc làm phiền khi đang tập trung suy nghĩ.</p>"
        }
      ]
    },
    "8": {
      "title": "Chỉ số Thái độ của bạn là 8",
      "blocks": [
        {
          "type": "text",
          "title": "Phản ứng tự nhiên",
          "content": "<p>Bạn toát lên phong thái của sự <strong>tự tin, mạnh mẽ và kiểm soát</strong>. Bạn tiếp cận cuộc sống với tư duy của một người làm chủ. Bạn không ngại va chạm và luôn hướng tới kết quả thực tế.</p><p>Bạn thích sự thẳng thắn, rõ ràng và hiệu quả. Bạn không có kiên nhẫn cho những lời phàn nàn hay những lý do biện hộ yếu đuối.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm thái độ:",
          "items": [
            "Quyết liệt, năng nổ và tham vọng.",
            "Thẳng tính, đôi khi hơi áp đặt.",
            "Coi trọng hình ảnh và uy tín cá nhân.",
            "Thực tế, sòng phẳng về tiền bạc."
          ]
        },
        {
          "type": "text",
          "title": "Cách xử lý khủng hoảng",
          "content": "<p>Bạn coi khủng hoảng là cơ hội để thể hiện bản lĩnh. Bạn sẽ nhanh chóng nắm quyền điều hành và đưa ra các quyết định cứng rắn để xoay chuyển tình thế. Bạn không cho phép mình thất bại.</p>"
        }
      ]
    },
    "9": {
      "title": "Chỉ số Thái độ của bạn là 9",
      "blocks": [
        {
          "type": "text",
          "title": "Phản ứng tự nhiên",
          "content": "<p>Bạn có thái độ sống <strong>bao dung, nhân hậu và đầy cảm xúc</strong>. Bạn nhìn cuộc đời qua lăng kính của tình yêu thương và sự lý tưởng hóa. Phản ứng đầu tiên của bạn thường là sự thấu cảm và muốn hỗ trợ.</p><p>Bạn có sức hút tự nhiên khiến người khác muốn đi theo. Tuy nhiên, bạn cũng hay phản ứng thái quá hoặc kịch tính hóa vấn đề (drama) do cảm xúc mạnh mẽ.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm thái độ:",
          "items": [
            "Hào phóng, hay giúp người.",
            "Nhiệt tình và giàu cảm xúc.",
            "Có tầm nhìn xa và tư tưởng lớn.",
            "Đôi khi xa rời thực tế hoặc quá tin người."
          ]
        },
        {
          "type": "text",
          "title": "Cách xử lý khủng hoảng",
          "content": "<p>Bạn thường đứng ra nhận trách nhiệm giải quyết vì lợi ích chung. Tuy nhiên, nếu kết quả không như ý, bạn dễ rơi vào cảm giác thất vọng ê chề hoặc oán trách cuộc đời.</p>"
        }
      ]
    }
  },
  "maturity": {
    "1": {
      "title": "Chỉ số Trưởng thành của bạn là 1",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan giai đoạn trưởng thành",
          "content": "<p>Càng về sau cuộc đời, bạn càng trở nên <strong>độc lập, mạnh mẽ và tự chủ</strong> hơn. Nếu thời trẻ bạn còn phụ thuộc hay e ngại, thì ở giai đoạn trưởng thành, bạn sẽ hoàn toàn đứng trên đôi chân của mình. Bạn sẽ tìm thấy niềm vui trong việc dẫn dắt người khác hoặc làm chủ một công việc kinh doanh riêng.</p><p>Vũ trụ đẩy bạn về phía vị trí của một người tiên phong. Bạn sẽ không còn chấp nhận sự gò bó hay làm việc dưới trướng người khác.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm khi về già:",
          "items": [
            "Có cái tôi vững chắc và uy quyền.",
            "Thích sự đổi mới, không chấp nhận lối mòn.",
            "Là chỗ dựa tinh thần vững chãi cho người khác.",
            "Độc lập về tài chính và tư tưởng."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Hãy cẩn thận để không trở nên độc đoán hay cô độc khi về già. Sự thành công của bạn sẽ trọn vẹn hơn nếu bạn biết cách lắng nghe và chia sẻ quyền lực với thế hệ sau.</p>"
        }
      ]
    },
    "2": {
      "title": "Chỉ số Trưởng thành của bạn là 2",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan giai đoạn trưởng thành",
          "content": "<p>Khi trưởng thành, cuộc sống của bạn sẽ hướng về sự <strong>bình yên, hòa hợp và kết nối</strong>. Bạn sẽ bớt tranh đấu hơn và tìm thấy hạnh phúc trong những mối quan hệ chất lượng. Trực giác của bạn sẽ phát triển cực mạnh, giúp bạn nhìn thấu tâm can người khác.</p><p>Bạn sẽ trở thành một nhà ngoại giao, một người hòa giải hoặc một cố vấn tinh thần đáng tin cậy cho mọi người xung quanh.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm khi về già:",
          "items": [
            "Nhạy cảm, tinh tế và giàu tình cảm.",
            "Thích các hoạt động tập thể nhẹ nhàng, nghệ thuật.",
            "Là người hàn gắn những rạn nứt trong gia đình/cộng đồng.",
            "Sống chậm rãi và tận hưởng từng khoảnh khắc."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Đừng để sự nhạy cảm biến thành sự lo âu thái quá. Hãy học cách thiết lập ranh giới cảm xúc để không bị ảnh hưởng bởi năng lượng tiêu cực của người khác.</p>"
        }
      ]
    },
    "3": {
      "title": "Chỉ số Trưởng thành của bạn là 3",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan giai đoạn trưởng thành",
          "content": "<p>Nửa sau cuộc đời của bạn sẽ tràn ngập <strong>niềm vui, sự sáng tạo và giao tiếp</strong>. Bạn sẽ trẻ trung hơn so với tuổi thật của mình rất nhiều. Bạn tìm thấy sự thỏa mãn khi được thể hiện bản thân qua lời nói, câu chữ hoặc nghệ thuật.</p><p>Bạn sẽ là người truyền cảm hứng, mang lại tiếng cười và sự lạc quan cho con cháu hoặc cộng đồng. Cuộc sống của bạn sẽ không bao giờ tẻ nhạt.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm khi về già:",
          "items": [
            "Hoạt bát, vui vẻ và thích tiệc tùng, hội họp.",
            "Có nhiều bạn bè và các mối quan hệ xã hội.",
            "Sáng tạo không ngừng nghỉ.",
            "Thích đi du lịch và khám phá những điều mới lạ."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Hãy chú ý quản lý năng lượng và cảm xúc. Đừng để sự vui vẻ bề ngoài che giấu đi những vấn đề nội tâm cần giải quyết. Hãy sống sâu sắc hơn.</p>"
        }
      ]
    },
    "4": {
      "title": "Chỉ số Trưởng thành của bạn là 4",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan giai đoạn trưởng thành",
          "content": "<p>Càng lớn tuổi, bạn càng trở nên <strong>vững chắc, thực tế và đáng tin cậy</strong>. Bạn sẽ gặt hái được quả ngọt từ sự chăm chỉ và kỷ luật của mình thời trẻ. Cuộc sống của bạn sẽ đi vào trật tự, ổn định về tài chính và gia đạo.</p><p>Bạn sẽ là trụ cột vững chắc, là \"cây cao bóng cả\" để con cháu và người thân dựa vào. Bạn quan tâm đến việc xây dựng di sản bền vững.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm khi về già:",
          "items": [
            "Kỷ luật, ngăn nắp và có nguyên tắc.",
            "Sức khỏe dẻo dai nhờ lối sống điều độ.",
            "Tài chính vững vàng, không lo thiếu thốn.",
            "Thích những giá trị truyền thống và sự an toàn."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Hãy học cách thả lỏng và linh hoạt hơn. Đừng quá cứng nhắc hay bảo thủ, hãy mở lòng đón nhận những cái mới của thế hệ trẻ để cuộc sống thêm màu sắc.</p>"
        }
      ]
    },
    "5": {
      "title": "Chỉ số Trưởng thành của bạn là 5",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan giai đoạn trưởng thành",
          "content": "<p>Giai đoạn trưởng thành của bạn là một hành trình của <strong>sự tự do và trải nghiệm</strong>. Bạn sẽ không chịu ngồi yên một chỗ để \"dưỡng già\". Thay vào đó, bạn sẽ đi du lịch, học những kỹ năng mới và thay đổi phong cách sống liên tục.</p><p>Bạn giữ được sự tò mò và nhiệt huyết của tuổi trẻ. Bạn trở nên linh hoạt, phóng khoáng và dễ dàng thích nghi với mọi biến động của thời đại.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm khi về già:",
          "items": [
            "Trẻ trung, hiện đại và cập nhật xu hướng nhanh.",
            "Thích phiêu lưu, ghét sự ràng buộc.",
            "Giao tiếp rộng rãi, nhiều bạn bè ở khắp nơi.",
            "Sống cho hiện tại, không lo nghĩ quá xa."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Sự tự do rất tuyệt vời, nhưng hãy đảm bảo bạn cũng có một nền tảng tài chính và sức khỏe vững chắc để hỗ trợ cho những chuyến đi của mình. Tránh sự bốc đồng thiếu suy nghĩ.</p>"
        }
      ]
    },
    "6": {
      "title": "Chỉ số Trưởng thành của bạn là 6",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan giai đoạn trưởng thành",
          "content": "<p>Cuộc sống của bạn khi trưởng thành sẽ xoay quanh <strong>gia đình, trách nhiệm và tình yêu thương</strong>. Bạn sẽ tìm thấy hạnh phúc viên mãn trong việc chăm sóc người thân, vui vầy bên con cháu và xây dựng tổ ấm.</p><p>Bạn cũng có xu hướng tham gia các hoạt động cộng đồng, trở thành người bảo trợ hoặc người chăm sóc cho những người yếu thế hơn. Bạn tỏa ra năng lượng của sự bao dung.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm khi về già:",
          "items": [
            "Là trung tâm kết nối của đại gia đình.",
            "Thích nấu ăn, làm vườn và trang trí nhà cửa.",
            "Giàu lòng trắc ẩn và hay làm từ thiện.",
            "Được mọi người kính trọng vì đức hy sinh."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Đừng để mình trở thành người hay lo lắng hay can thiệp quá sâu vào đời sống của con cái. Hãy yêu thương bản thân nhiều hơn và cho phép mình được nghỉ ngơi.</p>"
        }
      ]
    },
    "7": {
      "title": "Chỉ số Trưởng thành của bạn là 7",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan giai đoạn trưởng thành",
          "content": "<p>Đây là giai đoạn bạn đạt đến độ chín của <strong>trí tuệ và tâm linh</strong>. Bạn sẽ dành nhiều thời gian hơn cho việc chiêm nghiệm, nghiên cứu và tìm hiểu về ý nghĩa cuộc đời. Bạn thích sự tĩnh lặng hơn là ồn ào.</p><p>Bạn sẽ trở thành một chuyên gia, một người thầy hoặc một triết gia trong lĩnh vực của mình. Mọi người tìm đến bạn để xin những lời khuyên sâu sắc.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm khi về già:",
          "items": [
            "Sâu sắc, uyên bác và điềm tĩnh.",
            "Có đời sống nội tâm phong phú.",
            "Thích đọc sách, thiền định hoặc hòa mình với thiên nhiên.",
            "Hơi khép kín và kén chọn các mối quan hệ."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Đừng tự cô lập mình với thế giới. Hãy chia sẻ trí tuệ và những gì bạn đã giác ngộ được cho thế hệ sau. Sự kết nối sẽ giúp bạn bớt cảm thấy cô đơn.</p>"
        }
      ]
    },
    "8": {
      "title": "Chỉ số Trưởng thành của bạn là 8",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan giai đoạn trưởng thành",
          "content": "<p>Nửa sau cuộc đời là lúc bạn gặt hái thành tựu lớn về <strong>tài chính, quyền lực và danh vọng</strong>. Bạn sẽ ở đỉnh cao của sự nghiệp hoặc nắm giữ những vị trí quan trọng. Bạn có khả năng điều hành và quản lý xuất sắc.</p><p>Bạn cảm thấy thỏa mãn khi đạt được sự độc lập về vật chất và có tầm ảnh hưởng xã hội. Bạn muốn để lại một di sản hữu hình cho đời.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm khi về già:",
          "items": [
            "Mạnh mẽ, quyết đoán và đầy bản lĩnh.",
            "Sung túc về vật chất.",
            "Vẫn đam mê làm việc và cống hiến.",
            "Có uy tín lớn trong cộng đồng."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Hãy nhớ cân bằng giữa công việc và gia đình. Tiền bạc và quyền lực sẽ vô nghĩa nếu bạn không có người thân bên cạnh để chia sẻ niềm vui. Hãy học cách buông bỏ bớt quyền lực để an hưởng tuổi già.</p>"
        }
      ]
    },
    "9": {
      "title": "Chỉ số Trưởng thành của bạn là 9",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan giai đoạn trưởng thành",
          "content": "<p>Giai đoạn này đánh dấu sự thăng hoa của <strong>lòng nhân ái và sự cống hiến</strong>. Bạn sẽ bớt quan tâm đến lợi ích cá nhân mà hướng nhiều hơn về cộng đồng và xã hội. Bạn muốn làm thế giới tốt đẹp hơn trước khi rời đi.</p><p>Bạn sẽ trở nên bao dung, độ lượng và có cái nhìn đầy triết lý về nhân sinh. Bạn sẵn sàng cho đi và tha thứ cho những lỗi lầm trong quá khứ.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm khi về già:",
          "items": [
            "Nhân hậu, vị tha và giàu lòng trắc ẩn.",
            "Tích cực tham gia các hoạt động thiện nguyện.",
            "Có sức hút tự nhiên và được nhiều người yêu mến.",
            "Sống vì lý tưởng cao đẹp."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Đừng để nỗi buồn của nhân thế làm bạn bi quan. Hãy tập trung vào những điều tích cực bạn có thể làm. Học cách buông bỏ những kỳ vọng để tâm hồn được thanh thản.</p>"
        }
      ]
    },
    "11": {
      "title": "Chỉ số Trưởng thành của bạn là 11",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan giai đoạn trưởng thành",
          "content": "<p>Bạn sẽ bước vào giai đoạn <strong>khai sáng tâm linh và trực giác</strong> mạnh mẽ. Bạn trở thành nguồn cảm hứng cho người khác thông qua lối sống và trí tuệ của mình. Sứ mệnh của bạn lúc này là người dẫn đường về mặt tinh thần.</p><p>Cuộc sống vật chất có thể không còn là ưu tiên hàng đầu, thay vào đó là sự tìm kiếm sự bình an và chân lý nội tại.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm khi về già:",
          "items": [
            "Trực giác nhạy bén, có khả năng tiên tri.",
            "Sống tinh tế, nhẹ nhàng và thanh cao.",
            "Có sức ảnh hưởng về mặt tư tưởng.",
            "Thường tìm đến tôn giáo hoặc nghệ thuật."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Hãy giữ đôi chân mình trên mặt đất. Đừng để những ý tưởng bay bổng làm bạn xa rời thực tế. Hãy dùng năng lực của mình để giúp đỡ mọi người một cách thiết thực.</p>"
        }
      ]
    },
    "22": {
      "title": "Chỉ số Trưởng thành của bạn là 22",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan giai đoạn trưởng thành",
          "content": "<p>Bạn sẽ trở thành một <strong>\"Kiến trúc sư đại tài\"</strong> của cuộc đời. Đây là lúc bạn hiện thực hóa những giấc mơ lớn lao nhất. Bạn có khả năng tạo ra những thành tựu vĩ đại, mang lại lợi ích cho cộng đồng rộng lớn.</p><p>Bạn kết hợp được tầm nhìn xa của số 11 và sự thực tế của số 4 để xây dựng những đế chế hoặc hệ thống bền vững.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm khi về già:",
          "items": [
            "Quyền lực, tài năng và thành công vượt trội.",
            "Suy nghĩ vĩ mô, làm những việc lớn.",
            "Kỷ luật thép và khả năng tổ chức phi thường.",
            "Để lại di sản to lớn cho hậu thế."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Áp lực của con số này rất lớn. Hãy nhớ chăm sóc sức khỏe và tìm kiếm sự cân bằng. Đừng để tham vọng nuốt chửng niềm vui sống giản đơn của bạn.</p>"
        }
      ]
    },
    "33": {
      "title": "Chỉ số Trưởng thành của bạn là 33",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan giai đoạn trưởng thành",
          "content": "<p>Bạn sẽ trở thành biểu tượng của <strong>tình yêu thương vô điều kiện và sự chữa lành</strong>. Bạn sống để phụng sự và nâng đỡ tinh thần cho nhân loại. Sự hiện diện của bạn mang lại sự an ủi và hy vọng cho những người đau khổ.</p><p>Bạn là người thầy, người cha/mẹ tinh thần của cộng đồng, luôn dang rộng vòng tay đón nhận tất cả.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm khi về già:",
          "items": [
            "Tấm lòng bao la như bồ tát.",
            "Hy sinh lợi ích cá nhân vì người khác.",
            "Vui vẻ, ấm áp và đầy lòng trắc ẩn.",
            "Được mọi người tôn kính và yêu mến."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Hãy nhớ rằng bạn cũng cần được yêu thương và chăm sóc. Đừng vắt kiệt sức mình cho người khác. Hãy giữ cho ngọn lửa nội tâm của bạn luôn sáng để soi đường cho mọi người.</p>"
        }
      ]
    }
  },
  "rational": {
    "1": {
      "title": "Chỉ số Tư duy của bạn là 1",
      "blocks": [
        {
          "type": "text",
          "title": "Cách tư duy tự nhiên",
          "content": "<p>Bạn sở hữu lối tư duy <strong>độc lập, nguyên bản và trực diện</strong>. Khi tiếp nhận thông tin, bạn hiếm khi chấp nhận ngay ý kiến của đám đông mà luôn muốn tự mình kiểm chứng và đưa ra kết luận riêng. Bộ não bạn hoạt động theo cơ chế \"tự thân vận động\".</p><p>Bạn suy nghĩ rất nhanh và thường có xu hướng tìm ra giải pháp ngay lập tức thay vì phân tích quá lâu. Bạn tin vào trực giác và năng lực phán đoán của chính mình hơn là sách vở.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm tư duy:",
          "items": [
            "Sáng tạo, luôn tìm góc nhìn mới lạ.",
            "Quyết đoán, ghét sự vòng vo tam quốc.",
            "Tư duy tập trung vào mục tiêu (Goal-oriented).",
            "Thường bỏ qua chi tiết để nhìn vào kết quả."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Hãy cẩn thận với sự chủ quan. Đôi khi sự tự tin thái quá vào suy nghĩ của mình khiến bạn trở nên bảo thủ. Hãy tập lắng nghe những góc nhìn trái chiều để hoàn thiện giải pháp của bạn.</p>"
        }
      ]
    },
    "2": {
      "title": "Chỉ số Tư duy của bạn là 2",
      "blocks": [
        {
          "type": "text",
          "title": "Cách tư duy tự nhiên",
          "content": "<p>Tư duy của bạn thiên về <strong>chi tiết, cảm xúc và sự cân nhắc</strong>. Trước khi ra quyết định, bạn luôn xem xét vấn đề từ hai phía và lo sợ quyết định của mình sẽ ảnh hưởng tiêu cực đến người khác. Bạn là người suy nghĩ thấu đáo.</p><p>Bạn có khả năng \"đọc\" được những ẩn ý nằm sau lời nói của người khác. Trực giác mách bảo bạn rất nhiều điều mà logic không giải thích được.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm tư duy:",
          "items": [
            "Tỉ mỉ, hay để ý tiểu tiết.",
            "Giỏi lắng nghe và tổng hợp ý kiến.",
            "Hay do dự, thiếu quyết đoán vì sợ sai.",
            "Tư duy dựa trên sự hòa hợp và an toàn."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Đừng để nỗi sợ làm mất lòng người khác khiến bạn tê liệt không dám ra quyết định. Hãy tin vào trực giác nhạy bén của mình và học cách quyết đoán hơn.</p>"
        }
      ]
    },
    "3": {
      "title": "Chỉ số Tư duy của bạn là 3",
      "blocks": [
        {
          "type": "text",
          "title": "Cách tư duy tự nhiên",
          "content": "<p>Bộ não bạn vận hành bằng <strong>hình ảnh, trí tưởng tượng và cảm hứng</strong>. Bạn không thích những con số khô khan hay những lý thuyết rườm rà. Bạn hiểu vấn đề nhanh nhất thông qua ví dụ, câu chuyện hoặc hình ảnh trực quan.</p><p>Bạn suy nghĩ rất linh hoạt, hay \"nhảy số\" lung tung từ ý tưởng này sang ý tưởng khác. Tư duy của bạn đầy màu sắc và không bị gò bó bởi các quy tắc logic thông thường.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm tư duy:",
          "items": [
            "Sáng tạo, giàu trí tưởng tượng.",
            "Lạc quan, nhìn thấy cơ hội trong khó khăn.",
            "Thiếu tập trung, hay lan man.",
            "Tư duy nghệ sĩ, ngẫu hứng."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Ý tưởng của bạn rất tuyệt, nhưng chúng cần sự kỷ luật để biến thành hiện thực. Hãy học cách ghi chép lại những suy nghĩ thoáng qua và sắp xếp chúng một cách hệ thống hơn.</p>"
        }
      ]
    },
    "4": {
      "title": "Chỉ số Tư duy của bạn là 4",
      "blocks": [
        {
          "type": "text",
          "title": "Cách tư duy tự nhiên",
          "content": "<p>Bạn là người có tư duy <strong>logic, trình tự và thực tế</strong> bậc nhất. Bạn không tin vào những gì mơ hồ. Mọi thứ trong đầu bạn phải được sắp xếp ngăn nắp như các thư mục trong máy tính. Bạn tiếp nhận thông tin chậm nhưng cực kỳ chắc chắn.</p><p>Bạn luôn đặt câu hỏi về tính khả thi: \"Làm thế nào để thực hiện?\", \"Quy trình là gì?\". Bạn giải quyết vấn đề bằng phương pháp loại suy và chứng minh.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm tư duy:",
          "items": [
            "Chặt chẽ, có cơ sở và bằng chứng.",
            "Thực tế, không mơ mộng viển vông.",
            "Hơi cứng nhắc, khó chấp nhận cái mới đột ngột.",
            "Tư duy hướng đến sự an toàn và ổn định."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Đôi khi bạn quá tập trung vào \"cây\" mà quên mất \"rừng\". Hãy thả lỏng tư duy để nhìn thấy bức tranh toàn cảnh và những cơ hội tiềm ẩn bên ngoài khuôn khổ an toàn.</p>"
        }
      ]
    },
    "5": {
      "title": "Chỉ số Tư duy của bạn là 5",
      "blocks": [
        {
          "type": "text",
          "title": "Cách tư duy tự nhiên",
          "content": "<p>Tư duy của bạn cực kỳ <strong>linh hoạt, đa chiều và phóng khoáng</strong>. Bạn có khả năng thích nghi với các luồng thông tin mới rất nhanh. Bạn ghét sự gò bó và những quy tắc cứng nhắc cản trở dòng suy nghĩ của mình.</p><p>Bạn thường có những ý tưởng đột phá, táo bạo mà người khác không dám nghĩ tới. Bạn sẵn sàng thử nghiệm những cách làm mới thay vì đi theo lối mòn.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm tư duy:",
          "items": [
            "Nhanh nhạy, nắm bắt vấn đề tức thì.",
            "Tò mò, thích khám phá cái mới.",
            "Cả thèm chóng chán, thiếu chiều sâu.",
            "Tư duy \"ngoài chiếc hộp\" (Think out of the box)."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Sự thông minh của bạn là con dao hai lưỡi nếu thiếu sự kiên định. Hãy rèn luyện khả năng tập trung vào một vấn đề cho đến khi giải quyết xong nó.</p>"
        }
      ]
    },
    "6": {
      "title": "Chỉ số Tư duy của bạn là 6",
      "blocks": [
        {
          "type": "text",
          "title": "Cách tư duy tự nhiên",
          "content": "<p>Bạn suy nghĩ bằng <strong>trái tim và trách nhiệm</strong>. Khi đánh giá một vấn đề, bạn luôn đặt yếu tố con người và tình cảm lên hàng đầu. Bạn xem xét tác động của quyết định đến sự hạnh phúc và công bằng cho mọi người.</p><p>Tư duy của bạn có tính nghệ thuật và cầu toàn. Bạn muốn mọi giải pháp đưa ra không chỉ đúng mà còn phải đẹp và nhân văn.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm tư duy:",
          "items": [
            "Chu đáo, lo xa cho người khác.",
            "Cầu toàn, để ý đến thẩm mỹ.",
            "Hay lo lắng thái quá hoặc tự làm khổ mình.",
            "Tư duy hướng thiện và hòa giải."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Đừng để cảm xúc chi phối quá nhiều vào các quyết định cần sự lý trí. Hãy học cách tách biệt tình cảm và công việc để có cái nhìn khách quan hơn.</p>"
        }
      ]
    },
    "7": {
      "title": "Chỉ số Tư duy của bạn là 7",
      "blocks": [
        {
          "type": "text",
          "title": "Cách tư duy tự nhiên",
          "content": "<p>Bạn sở hữu bộ óc của một <strong>nhà nghiên cứu và phê bình</strong>. Bạn không bao giờ chấp nhận những gì hời hợt trên bề mặt. Tư duy của bạn luôn đào sâu xuống gốc rễ vấn đề: \"Tại sao lại như vậy?\".</p><p>Bạn có xu hướng hoài nghi và cần bằng chứng xác thực. Bạn thích làm việc một mình để có không gian yên tĩnh cho dòng suy tưởng của mình tuôn chảy.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm tư duy:",
          "items": [
            "Phân tích sâu sắc, logic chặt chẽ.",
            "Đa nghi, khó bị lừa gạt.",
            "Thích triết lý và những điều bí ẩn.",
            "Hơi xa rời thực tế đời sống."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Đừng để sự hoài nghi biến bạn thành người khó tính và xét nét. Hãy mở lòng đón nhận những điều giản đơn mà logic không thể giải thích được.</p>"
        }
      ]
    },
    "8": {
      "title": "Chỉ số Tư duy của bạn là 8",
      "blocks": [
        {
          "type": "text",
          "title": "Cách tư duy tự nhiên",
          "content": "<p>Tư duy của bạn hướng tới <strong>hiệu quả, lợi ích và bức tranh lớn</strong>. Bạn loại bỏ rất nhanh những chi tiết rườm rà không mang lại giá trị. Bạn suy nghĩ như một nhà điều hành: \"Việc này tốn bao nhiêu và thu lại được gì?\".</p><p>Bạn có khả năng tổ chức sắp xếp thông tin trong đầu rất tốt. Bạn đánh giá mọi việc dựa trên tính thực tiễn và kết quả cuối cùng.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm tư duy:",
          "items": [
            "Thực dụng, sắc bén.",
            "Tư duy quản trị và hệ thống.",
            "Thiếu kiên nhẫn với cảm xúc ủy mị.",
            "Quyết đoán và định hướng mục tiêu rõ ràng."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Bạn rất giỏi việc lớn nhưng dễ hỏng việc vì bỏ qua tiểu tiết hoặc yếu tố con người. Hãy chậm lại một chút để lắng nghe cảm xúc của những người xung quanh.</p>"
        }
      ]
    },
    "9": {
      "title": "Chỉ số Tư duy của bạn là 9",
      "blocks": [
        {
          "type": "text",
          "title": "Cách tư duy tự nhiên",
          "content": "<p>Tư duy của bạn mang tính <strong>tổng quát và lý tưởng hóa</strong>. Bạn không nhìn sự việc ở khía cạnh cá nhân chật hẹp mà nhìn ở góc độ nhân văn rộng lớn. Bạn suy nghĩ về những điều tốt đẹp cho cộng đồng.</p><p>Bạn có trực giác tốt và trí tưởng tượng phong phú. Tuy nhiên, đôi khi suy nghĩ của bạn thiếu tính thực tế và khó áp dụng vào đời sống cơm áo gạo tiền.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm tư duy:",
          "items": [
            "Bao dung, rộng lượng.",
            "Có tầm nhìn xa nhưng thiếu chi tiết.",
            "Dễ bị cảm xúc chi phối.",
            "Tư duy nghệ sĩ và triết gia."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Hãy học cách \"tiếp đất\". Những ý tưởng nhân văn của bạn chỉ có giá trị khi nó được hiện thực hóa bằng một kế hoạch cụ thể và thực tế.</p>"
        }
      ]
    },
    "11": {
      "title": "Chỉ số Tư duy của bạn là 11",
      "blocks": [
        {
          "type": "text",
          "title": "Cách tư duy tự nhiên",
          "content": "<p>Bạn sở hữu <strong>trực giác tâm linh nhạy bén</strong> (Master Intuition). Những ý tưởng thường đến với bạn như những tia chớp – đột ngột và sáng tỏ mà không cần qua quá trình suy luận logic. Bạn hiểu những điều mà người khác chưa kịp nói.</p><p>Tư duy của bạn rất sâu sắc, mang tính khai sáng. Bạn thường nhìn thấy tiềm năng ẩn giấu của sự việc.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm tư duy:",
          "items": [
            "Nhạy cảm, tinh tế.",
            "Giàu trí tưởng tượng và cảm hứng.",
            "Dễ bị căng thẳng thần kinh.",
            "Tư duy vượt không gian và thời gian."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Bạn cần giữ cho tâm trí tĩnh lặng để trực giác hoạt động chính xác. Tránh xa những môi trường ồn ào, tiêu cực làm nhiễu loạn luồng suy nghĩ của bạn.</p>"
        }
      ]
    },
    "22": {
      "title": "Chỉ số Tư duy của bạn là 22",
      "blocks": [
        {
          "type": "text",
          "title": "Cách tư duy tự nhiên",
          "content": "<p>Bạn có lối tư duy của một <strong>\"Kiến trúc sư thực tế\"</strong>. Bạn kết hợp được sự bay bổng của trực giác với sự logic chặt chẽ của thực tế. Bạn không chỉ dám mơ lớn mà còn biết cách vạch ra lộ trình từng bước để biến giấc mơ đó thành sự thật.</p><p>Bạn suy nghĩ về các cấu trúc, hệ thống và quy mô lớn. Tư duy của bạn rất bài bản và có tính chiến lược cao.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm tư duy:",
          "items": [
            "Logic, thực tế nhưng đầy tham vọng.",
            "Có khả năng tổ chức thông tin xuất sắc.",
            "Tư duy giải quyết vấn đề phức tạp.",
            "Kiên định và tập trung cao độ."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Đừng để áp lực của sự hoàn hảo đè nặng lên tâm trí bạn. Hãy chia nhỏ những dự án lớn trong đầu thành những bước đi nhỏ để tránh bị quá tải.</p>"
        }
      ]
    },
    "33": {
      "title": "Chỉ số Tư duy của bạn là 33",
      "blocks": [
        {
          "type": "text",
          "title": "Cách tư duy tự nhiên",
          "content": "<p>Tư duy của bạn thấm đẫm <strong>tình yêu thương và sự hy sinh</strong>. Bạn luôn nghĩ cho người khác trước khi nghĩ cho mình. Bạn có khả năng thấu cảm đặc biệt, hiểu được nỗi đau của người khác chỉ qua ánh mắt.</p><p>Bạn suy nghĩ sáng tạo nhưng luôn hướng về mục đích nhân đạo. Bạn muốn dùng trí tuệ của mình để chữa lành và bảo vệ mọi người.</p>"
        },
        {
          "type": "list",
          "title": "Đặc điểm tư duy:",
          "items": [
            "Nhân hậu, vị tha.",
            "Nhạy cảm với nỗi đau nhân thế.",
            "Tư duy sáng tạo nghệ thuật.",
            "Dễ bị lợi dụng vì quá tin người."
          ]
        },
        {
          "type": "text",
          "title": "Lời khuyên",
          "content": "<p>Bạn cần bảo vệ tâm trí mình khỏi những năng lượng tiêu cực. Hãy học cách tư duy lý trí hơn để lòng tốt của bạn được đặt đúng chỗ và mang lại hiệu quả thực sự.</p>"
        }
      ]
    }
  }, 
  "strengthGrid": {
    "1": {
      "title": "Số 1 - Cái Tôi & Khả Năng Giao Tiếp",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Số 1 là con số đầu tiên và là nền tảng của Biểu đồ ngày sinh. Nó đại diện cho <strong>Cái Tôi (Ego)</strong> và cách bạn thể hiện bản thân ra thế giới bên ngoài. Sự hiện diện của số 1 cho thấy bạn tồn tại như một cá thể độc lập.</p>"
        },
        {
          "type": "list",
          "title": "Ý nghĩa khi có số 1 trong biểu đồ:",
          "items": [
            "<strong>Giao tiếp:</strong> Đây là chìa khóa để bạn kết nối với người khác. Số lượng số 1 sẽ quyết định bạn là người ít nói (nội tâm) hay hoạt ngôn (hướng ngoại).",
            "<strong>Cái tôi:</strong> Nó phản ánh lòng tự trọng, sự tự tin và đôi khi là sự kiêu hãnh của bạn.",
            "<strong>Sự tự chủ:</strong> Cho thấy khả năng đứng vững trên đôi chân mình mà không cần dựa dẫm."
          ]
        },
        {
          "type": "text",
          "content": "<p><em>Lưu ý: Nếu có quá nhiều số 1 (từ 3 số trở lên), bạn có thể gặp vấn đề về việc kiểm soát cái tôi (dễ trở nên độc đoán hoặc lập dị). Nếu quá ít (1 số), bạn có thể gặp khó khăn trong việc diễn đạt cảm xúc.</em></p>"
        }
      ]
    },
    "2": {
      "title": "Số 2 - Trực Giác & Cảm Xúc",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Số 2 là cửa ngõ dẫn vào Tâm hồn (Soul Plane). Nó đại diện cho <strong>Trực giác (Intuition)</strong> và sự nhạy cảm. Sự hiện diện của số 2 mang lại cho bạn khả năng thấu cảm sâu sắc mà logic không thể giải thích được.</p>"
        },
        {
          "type": "list",
          "title": "Ý nghĩa khi có số 2 trong biểu đồ:",
          "items": [
            "<strong>Giác quan thứ 6:</strong> Bạn có những linh cảm rất chính xác về con người và sự việc.",
            "<strong>Sự kết nối:</strong> Bạn dễ dàng hòa nhập, thấu hiểu và chia sẻ nỗi đau với người khác.",
            "<strong>Cân bằng:</strong> Số 2 giúp làm mềm đi sự cứng nhắc của các con số khác, mang lại sự hài hòa cho tính cách."
          ]
        },
        {
          "type": "text",
          "content": "<p><em>Lưu ý: Người có số 2 thường rất tinh tế và không thích sự tranh cãi. Tuy nhiên, nếu không có số 2 nào, bạn có thể thiếu đi sự nhạy cảm cần thiết và sống quá lý trí.</em></p>"
        }
      ]
    },
    "3": {
      "title": "Số 3 - Trí Tuệ & Tư Duy",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Số 3 nằm ở đầu Trục Trí não (Mind Plane). Nó đại diện cho <strong>Trí nhớ, Tư duy phân tích và Sự sáng tạo</strong>. Đây là con số của sự thông minh học thuật và khả năng tư duy logic.</p>"
        },
        {
          "type": "list",
          "title": "Ý nghĩa khi có số 3 trong biểu đồ:",
          "items": [
            "<strong>Khả năng ghi nhớ:</strong> Bạn thường có trí nhớ tốt, học nhanh và tiếp thu kiến thức dễ dàng.",
            "<strong>Tư duy logic:</strong> Bạn giải quyết vấn đề dựa trên phân tích và lý lẽ chặt chẽ.",
            "<strong>Sự vui vẻ:</strong> Số 3 cũng mang năng lượng của niềm vui và sự lạc quan, giúp tâm trí bạn luôn tươi mới."
          ]
        },
        {
          "type": "text",
          "content": "<p><em>Lưu ý: Số 3 là \"cổng vào\" của ý thức. Người có số 3 thường rất lanh lợi. Nếu thiếu số 3, bạn có thể cần nỗ lực nhiều hơn để duy trì sự tập trung hoặc trí nhớ.</em></p>"
        }
      ]
    },
    "4": {
      "title": "Số 4 - Thực Tế & Kỷ Luật",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Số 4 nằm ở trung tâm Trục Thể chất (Physical Plane). Nó đại diện cho <strong>Sự thực tế, Kỷ luật và Sắp xếp</strong>. Đây là con số của hành động, của việc \"xắn tay áo lên và làm\".</p>"
        },
        {
          "type": "list",
          "title": "Ý nghĩa khi có số 4 trong biểu đồ:",
          "items": [
            "<strong>Tính thực tiễn:</strong> Bạn không mơ mộng hão huyền. Bạn tin vào những gì mắt thấy tai nghe và cầm nắm được.",
            "<strong>Sự khéo léo:</strong> Số 4 thường liên quan đến sự khéo tay, giỏi làm việc thủ công hoặc kỹ thuật.",
            "<strong>Ngăn nắp:</strong> Bạn thích mọi thứ phải có trật tự, quy trình rõ ràng."
          ]
        },
        {
          "type": "text",
          "content": "<p><em>Lưu ý: Sự hiện diện của số 4 giúp bạn \"tiếp đất\" (grounding). Thiếu số 4 có thể khiến bạn bay bổng nhưng thiếu tính thực thi, khó biến ý tưởng thành hiện thực.</em></p>"
        }
      ]
    },
    "5": {
      "title": "Số 5 - Tự Do & Kết Nối Tâm Linh",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Số 5 nằm ở vị trí trung tâm của toàn bộ biểu đồ (trái tim của biểu đồ). Nó đại diện cho <strong>Tình yêu thương, Sự tự do và Kết nối</strong>. Nó là chiếc cầu nối giữa các trục Thể chất, Tinh thần và Trí não.</p>"
        },
        {
          "type": "list",
          "title": "Ý nghĩa khi có số 5 trong biểu đồ:",
          "items": [
            "<strong>Cảm xúc mãnh liệt:</strong> Bạn là người giàu cảm xúc, sống đam mê và ghét sự gò bó.",
            "<strong>Sự linh hoạt:</strong> Bạn có khả năng thích nghi tốt và luôn tìm kiếm những trải nghiệm mới lạ.",
            "<strong>Khả năng kết nối:</strong> Bạn dễ dàng làm quen với mọi người và là trung tâm của các mối quan hệ."
          ]
        },
        {
          "type": "text",
          "content": "<p><em>Lưu ý: Có số 5 là một lợi thế lớn vì nó giúp cân bằng năng lượng của biểu đồ. Thiếu số 5 (biểu đồ bị trống ở giữa) thường tạo ra cảm giác trống trải hoặc khó kết nối các khía cạnh của bản thân.</em></p>"
        }
      ]
    },
    "6": {
      "title": "Số 6 - Sáng Tạo & Yêu Thương Gia Đình",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Số 6 nằm ở trung tâm Trục Trí não (Mind Plane). Nó đại diện cho <strong>Sự sáng tạo (Của não bộ) và Tình yêu thương gia đình</strong>. Khác với số 3 (sáng tạo học thuật), số 6 là sự sáng tạo mang tính thẩm mỹ và xây dựng.</p>"
        },
        {
          "type": "list",
          "title": "Ý nghĩa khi có số 6 trong biểu đồ:",
          "items": [
            "<strong>Hướng về gia đình:</strong> Bạn coi trọng mái ấm, trách nhiệm với người thân là ưu tiên hàng đầu.",
            "<strong>Sáng tạo nghệ thuật:</strong> Bạn có gu thẩm mỹ tốt, yêu cái đẹp và thích làm cho cuộc sống trở nên đẹp đẽ hơn.",
            "<strong>Sự lo lắng:</strong> Đôi khi số 6 mang theo năng lượng của sự lo toan thái quá cho người khác."
          ]
        },
        {
          "type": "text",
          "content": "<p><em>Lưu ý: Số 6 là con số của sự cam kết. Người có số 6 thường rất đáng tin cậy trong các mối quan hệ tình cảm và gia đình.</em></p>"
        }
      ]
    },
    "7": {
      "title": "Số 7 - Trải Nghiệm & Bài Học",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Số 7 mang một ý nghĩa đặc biệt và sâu sắc. Nó đại diện cho <strong>Bài học qua trải nghiệm thực tế</strong>. Trong biểu đồ ngày sinh, số 7 thường báo hiệu sự trưởng thành thông qua những mất mát hoặc thử thách (về tiền bạc, tình cảm hoặc sức khỏe).</p>"
        },
        {
          "type": "list",
          "title": "Ý nghĩa khi có số 7 trong biểu đồ:",
          "items": [
            "<strong>Học qua trải nghiệm:</strong> Bạn không tin vào lý thuyết suông. Bạn phải tự mình trải qua, vấp ngã rồi mới rút ra bài học.",
            "<strong>Sự hy sinh:</strong> Đôi khi bạn phải hy sinh lợi ích cá nhân để đạt được sự giác ngộ hoặc giúp đỡ người khác.",
            "<strong>Triết lý sâu sắc:</strong> Những trải nghiệm gian nan tôi luyện bạn thành người có chiều sâu và trí tuệ."
          ]
        },
        {
          "type": "text",
          "content": "<p><em>Lưu ý: Đừng sợ số 7. Dù nó mang đến thử thách, nhưng \"vàng thật thử lửa\". Những người có số 7 thường trở thành những bậc thầy hoặc người dẫn đường nhờ kinh nghiệm phong phú của mình.</em></p>"
        }
      ]
    },
    "8": {
      "title": "Số 8 - Độc Lập & Trí Tuệ",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Số 8 nằm trên Trục Tinh thần (Soul Plane). Nó đại diện cho <strong>Sự độc lập, Trí tuệ và Sự vận động</strong>. Đây là con số của sự nhạy bén về mặt tinh thần nhưng được thể hiện qua hành động thực tế.</p>"
        },
        {
          "type": "list",
          "title": "Ý nghĩa khi có số 8 trong biểu đồ:",
          "items": [
            "<strong>Tư duy độc lập:</strong> Bạn có chính kiến mạnh mẽ, không dễ bị người khác lung lay.",
            "<strong>Sự ngăn nắp về trí tuệ:</strong> Bạn suy nghĩ hệ thống, logic và rất tỉ mỉ.",
            "<strong>Năng lượng dồi dào:</strong> Bạn là người khó ngồi yên, luôn muốn di chuyển hoặc làm việc gì đó có ích."
          ]
        },
        {
          "type": "text",
          "content": "<p><em>Lưu ý: Số 8 mang lại cho bạn bản lĩnh để làm chủ cuộc đời. Tuy nhiên, cần tránh sự lạnh lùng hoặc quá lý trí trong các mối quan hệ tình cảm.</em></p>"
        }
      ]
    },
    "9": {
      "title": "Số 9 - Hoài Bão & Trách Nhiệm",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Số 9 là con số lớn nhất, nằm ở vị trí cao nhất của biểu đồ (Trục Trí não). Nó đại diện cho <strong>Hoài bão, Lý tưởng và Trách nhiệm cộng đồng</strong>. Nó cho thấy độ lớn của giấc mơ bạn theo đuổi.</p>"
        },
        {
          "type": "list",
          "title": "Ý nghĩa khi có số 9 trong biểu đồ:",
          "items": [
            "<strong>Mục tiêu lớn:</strong> Bạn luôn đặt ra những đích đến xa hơn, cao hơn để phấn đấu. Bạn không chấp nhận sự tầm thường.",
            "<strong>Lòng nhân ái:</strong> Bạn suy nghĩ cho lợi ích chung, có tinh thần phụng sự xã hội.",
            "<strong>Trách nhiệm:</strong> Bạn là người uy tín, nói được làm được và sống có lý tưởng."
          ]
        },
        {
          "type": "text",
          "content": "<p><em>Lưu ý: Trong thế kỷ 20 (19xx), ai cũng có số 9 nên tính hoài bão là phổ biến. Nhưng ở thế kỷ 21 (20xx), những người có số 9 sẽ trở nên đặc biệt hơn với tư chất lãnh đạo bẩm sinh.</em></p>"
        }
      ]
    }
  },

  "synthesisGrid": {
      "1": {
        "title": "Số 1 - Cái Tôi & Bản Lĩnh Toàn Diện",
        "blocks": [
          {
            "type": "text",
            "content": "<p>Trong biểu đồ tổng hợp, số 1 đại diện cho mức độ tự tin và khả năng thể hiện bản thân của bạn ra thế giới. Nó là tổng hòa giữa bản năng gốc và cá tính xã hội của bạn.</p>"
          },
          {
            "type": "list",
            "title": "Ý nghĩa sự xuất hiện:",
            "items": [
              "<strong>Sự tự chủ:</strong> Bạn có khả năng đứng vững trên đôi chân mình, dám đưa ra quan điểm và bảo vệ nó.",
              "<strong>Khả năng lãnh đạo:</strong> Sức mạnh tổng hợp này thúc đẩy bạn tiên phong trong mọi việc.",
              "<strong>Cảnh báo:</strong> Nếu có quá nhiều số 1, bạn dễ trở nên độc đoán, cái tôi quá lớn và khó hòa nhập. Nếu quá ít, bạn có thể thiếu tự tin và dễ bị người khác dẫn dắt."
            ]
          }
        ]
      },
      "2": {
        "title": "Số 2 - Trực Giác & Sự Kết Nối",
        "blocks": [
          {
            "type": "text",
            "content": "<p>Số 2 trong biểu đồ tổng hợp phản ánh chỉ số cảm xúc (EQ) và khả năng thấu cảm của bạn. Đây là sự kết hợp giữa sự nhạy cảm bẩm sinh và sự tinh tế trong giao tiếp xã hội.</p>"
          },
          {
            "type": "list",
            "title": "Ý nghĩa sự xuất hiện:",
            "items": [
              "<strong>Trực giác:</strong> Bạn có khả năng \"đọc vị\" người khác rất tốt.",
              "<strong>Sự hòa hợp:</strong> Bạn là chất keo gắn kết trong tập thể, biết lắng nghe và chia sẻ.",
              "<strong>Cảnh báo:</strong> Quá nhiều số 2 khiến bạn trở nên quá nhạy cảm, dễ tủi thân và hay suy diễn. Quá ít số 2 có thể khiến bạn trở nên khô khan, thiếu sự tinh tế."
            ]
          }
        ]
      },
      "3": {
        "title": "Số 3 - Trí Tuệ & Khả Năng Diễn Đạt",
        "blocks": [
          {
            "type": "text",
            "content": "<p>Đây là con số của tư duy và sự lan tỏa. Số 3 trong biểu đồ tổng hợp cho thấy năng lực học hỏi và khả năng truyền đạt ý tưởng của bạn mạnh mẽ đến mức nào.</p>"
          },
          {
            "type": "list",
            "title": "Ý nghĩa sự xuất hiện:",
            "items": [
              "<strong>Thông minh & Sáng tạo:</strong> Bạn có đầu óc linh hoạt, nhiều ý tưởng và giải quyết vấn đề nhanh.",
              "<strong>Hoạt ngôn:</strong> Bạn có khiếu ăn nói, biết cách làm cho câu chuyện trở nên thú vị.",
              "<strong>Cảnh báo:</strong> Quá nhiều số 3 có thể khiến bạn trở nên mơ mộng, thiếu thực tế hoặc nói nhiều hơn làm. Thiếu số 3 có thể khiến bạn gặp khó khăn trong việc diễn đạt suy nghĩ."
            ]
          }
        ]
      },
      "4": {
        "title": "Số 4 - Kỷ Luật & Thực Tế",
        "blocks": [
          {
            "type": "text",
            "content": "<p>Số 4 đại diện cho nền tảng vật chất và sự quy củ. Trong biểu đồ tổng hợp, nó cho thấy khả năng hiện thực hóa các ý tưởng và mức độ đáng tin cậy của bạn trong công việc.</p>"
          },
          {
            "type": "list",
            "title": "Ý nghĩa sự xuất hiện:",
            "items": [
              "<strong>Tháo vát:</strong> Bạn giỏi sắp xếp, tổ chức và không ngại làm những việc chi tiết, tỉ mỉ.",
              "<strong>Kiên định:</strong> Bạn là người nói được làm được, có trách nhiệm cao.",
              "<strong>Cảnh báo:</strong> Quá nhiều số 4 khiến bạn trở nên cứng nhắc, bảo thủ và quá coi trọng vật chất. Thiếu số 4 khiến bạn dễ bay bổng nhưng thiếu tính kỷ luật để thành công."
            ]
          }
        ]
      },
      "5": {
        "title": "Số 5 - Tự Do & Sự Cân Bằng",
        "blocks": [
          {
            "type": "text",
            "content": "<p>Nằm ở trung tâm biểu đồ, số 5 là linh hồn của sự tự do và kết nối. Nó cho thấy mức độ linh hoạt, khả năng thích nghi và nhu cầu trải nghiệm của bạn trong cuộc sống.</p>"
          },
          {
            "type": "list",
            "title": "Ý nghĩa sự xuất hiện:",
            "items": [
              "<strong>Kết nối:</strong> Bạn dễ dàng làm quen với môi trường mới và con người mới.",
              "<strong>Cảm xúc:</strong> Bạn sống đam mê, nhiệt huyết và ghét sự gò bó.",
              "<strong>Cảnh báo:</strong> Quá nhiều số 5 dẫn đến sự bốc đồng, cả thèm chóng chán và thiếu kiên nhẫn. Thiếu số 5 có thể khiến bạn cảm thấy khó khăn trong việc bộc lộ cảm xúc hoặc sống quá khép kín."
            ]
          }
        ]
      },
      "6": {
        "title": "Số 6 - Sáng Tạo & Trách Nhiệm Gia Đình",
        "blocks": [
          {
            "type": "text",
            "content": "<p>Số 6 trong biểu đồ tổng hợp nói lên tình yêu thương và trách nhiệm. Nó cho thấy bạn coi trọng gia đình đến mức nào và khả năng sáng tạo (thiên về nghệ thuật/thẩm mỹ) của bạn.</p>"
          },
          {
            "type": "list",
            "title": "Ý nghĩa sự xuất hiện:",
            "items": [
              "<strong>Chăm sóc:</strong> Bạn là trụ cột tinh thần, luôn muốn che chở cho người thân.",
              "<strong>Sáng tạo:</strong> Bạn có gu thẩm mỹ tốt và thích làm đẹp cho đời.",
              "<strong>Cảnh báo:</strong> Quá nhiều số 6 khiến bạn dễ bị ôm đồm, lo lắng thái quá hoặc kiểm soát người khác nhân danh tình yêu. Thiếu số 6 có thể khiến bạn hơi vô tâm với gia đình."
            ]
          }
        ]
      },
      "7": {
        "title": "Số 7 - Trải Nghiệm & Triết Lý Sống",
        "blocks": [
          {
            "type": "text",
            "content": "<p>Số 7 là con số của bài học. Trong biểu đồ tổng hợp, nó cho thấy chiều sâu trí tuệ và những trải nghiệm thực tế (đôi khi là thử thách) đã tôi luyện nên con người bạn.</p>"
          },
          {
            "type": "list",
            "title": "Ý nghĩa sự xuất hiện:",
            "items": [
              "<strong>Sâu sắc:</strong> Bạn có cái nhìn đa chiều, thích tìm hiểu bản chất vấn đề và quy luật vũ trụ.",
              "<strong>Trưởng thành:</strong> Bạn học được nhiều bài học quý giá thông qua sự va vấp.",
              "<strong>Cảnh báo:</strong> Quá nhiều số 7 có thể khiến cuộc đời bạn gặp nhiều trắc trở hoặc bạn trở nên quá đa nghi, cô độc. Thiếu số 7 có thể khiến bạn hơi hời hợt, thiếu chiều sâu."
            ]
          }
        ]
      },
      "8": {
        "title": "Số 8 - Độc Lập & Tư Duy Hệ Thống",
        "blocks": [
          {
            "type": "text",
            "content": "<p>Số 8 thể hiện sự năng động của trí tuệ và sự độc lập. Nó cho thấy khả năng làm chủ cuộc sống, tư duy kinh doanh và sự ngăn nắp trong suy nghĩ của bạn.</p>"
          },
          {
            "type": "list",
            "title": "Ý nghĩa sự xuất hiện:",
            "items": [
              "<strong>Bản lĩnh:</strong> Bạn độc lập, quyết đoán và có tố chất điều hành.",
              "<strong>Hệ thống:</strong> Bạn làm việc có kế hoạch, logic và hướng tới hiệu quả thực tế.",
              "<strong>Cảnh báo:</strong> Quá nhiều số 8 khiến bạn trở nên quá lý trí, lạnh lùng hoặc thực dụng. Thiếu số 8 có thể khiến bạn thiếu quyết đoán hoặc phụ thuộc vào người khác."
            ]
          }
        ]
      },
      "9": {
        "title": "Số 9 - Hoài Bão & Lý Tưởng",
        "blocks": [
          {
            "type": "text",
            "content": "<p>Số 9 đại diện cho ước mơ lớn và trách nhiệm xã hội. Trong biểu đồ tổng hợp, nó cho thấy tầm vóc của những mục tiêu bạn theo đuổi và lòng trắc ẩn của bạn đối với cộng đồng.</p>"
          },
          {
            "type": "list",
            "title": "Ý nghĩa sự xuất hiện:",
            "items": [
              "<strong>Tầm nhìn:</strong> Bạn luôn hướng tới những điều tốt đẹp, cao cả hơn cơm áo gạo tiền.",
              "<strong>Trách nhiệm:</strong> Bạn sống có lý tưởng, uy tín và muốn cống hiến.",
              "<strong>Cảnh báo:</strong> Quá nhiều số 9 khiến bạn trở nên bay bổng, xa rời thực tế hoặc lo chuyện bao đồng. Thiếu số 9 có thể khiến bạn sống thiếu mục tiêu lớn hoặc hơi ích kỷ."
            ]
          }
        ]
      }
  },

  "arrows": {
      "strength": {
        "1-4-7": {
          "present": { 
              "title": "Trục Thể Chất (1-4-7)", 
              "blocks": [
                  { "type": "text", "content": "<p><strong>Sức mạnh:</strong> Bạn là người sống thực tế và tháo vát. Bạn tin vào những gì mắt thấy, tai nghe và cầm nắm được. Sự kết hợp này giúp bạn giỏi trong việc hiện thực hóa các ý tưởng thành kết quả vật chất cụ thể. Bạn thường khéo tay hoặc giỏi các công việc đòi hỏi kỹ năng thực tiễn.</p>" }
              ] 
          },
          "missing": { 
              "title": "Thiếu Trục Thể Chất (1-4-7)", 
              "blocks": [
                  { "type": "text", "content": "<p><strong>Vấn đề:</strong> Bạn thường thiếu sự ngăn nắp và trật tự trong cuộc sống hàng ngày. Bạn có thể có nhiều ý tưởng hay nhưng lại gặp khó khăn trong khâu thực thi hoặc duy trì sự kiên trì với những công việc thực tế, tay chân.</p>" },
                  { "type": "text", "content": "<p><strong>Lời khuyên:</strong> Hãy rèn luyện tính kỷ luật từ những việc nhỏ nhất như dọn dẹp nhà cửa, ăn uống đúng giờ. Việc \"tiếp đất\" (grounding) là rất quan trọng để bạn cân bằng lại cuộc sống.</p>" }
              ] 
          }
        },
        "2-5-8": {
          "present": { 
              "title": "Trục Tinh Thần (2-5-8)", 
              "blocks": [
                  { "type": "text", "content": "<p><strong>Sức mạnh:</strong> Bạn sở hữu khả năng cân bằng cảm xúc tuyệt vời. Dù bên ngoài có sóng gió, nội tâm bạn vẫn giữ được sự bình tĩnh và sâu sắc. Bạn có trực giác nhạy bén và trái tim giàu lòng trắc ẩn, đóng vai trò là người hòa giải tự nhiên trong các mối quan hệ.</p>" }
              ] 
          },
          "missing": { 
              "title": "Thiếu Trục Tinh Thần (2-5-8)", 
              "blocks": [
                  { "type": "text", "content": "<p><strong>Vấn đề:</strong> Bạn rất nhạy cảm và dễ bị tổn thương. Bạn thường thiếu lớp \"áo giáp\" bảo vệ cảm xúc, nên dễ bị ảnh hưởng bởi năng lượng tiêu cực của người khác hoặc môi trường xung quanh. Cảm xúc của bạn có thể lên xuống thất thường.</p>" },
                  { "type": "text", "content": "<p><strong>Lời khuyên:</strong> Bạn cần học cách thiết lập ranh giới cảm xúc. Các hoạt động như thiền định, yoga hoặc dành thời gian tĩnh lặng một mình là liều thuốc tốt nhất để bạn tái tạo năng lượng.</p>" }
              ] 
          }
        },
        "3-6-9": {
          "present": { 
              "title": "Trục Trí Não (3-6-9)", 
              "blocks": [
                  { "type": "text", "content": "<p><strong>Sức mạnh:</strong> Bạn sở hữu một bộ óc minh mẫn, sáng suốt và khả năng ghi nhớ tốt. Bạn tiếp thu kiến thức nhanh và có tư duy logic sắc bén. Trục này cho thấy tiềm năng học thuật cao và khả năng giải quyết vấn đề bằng trí tuệ.</p>" }
              ] 
          },
          "missing": { 
              "title": "Thiếu Trục Trí Não (3-6-9)", 
              "blocks": [
                  { "type": "text", "content": "<p><strong>Vấn đề:</strong> Bạn hay gặp tình trạng \"nhớ trước quên sau\" hoặc khó tập trung vào một việc trong thời gian dài. Điều này không có nghĩa là bạn kém thông minh, mà là não bộ của bạn cần được rèn luyện để duy trì sự tập trung tốt hơn.</p>" },
                  { "type": "text", "content": "<p><strong>Lời khuyên:</strong> Hãy tập thói quen ghi chép mọi thứ ra giấy thay vì chỉ nhớ trong đầu. Chơi các trò chơi trí tuệ (cờ vua, sudoku) sẽ giúp kích hoạt lại sự nhạy bén của não bộ.</p>" }
              ] 
          }
        },
        "1-2-3": {
          "present": { 
              "title": "Trục Kế Hoạch (1-2-3)", 
              "blocks": [
                  { "type": "text", "content": "<p><strong>Sức mạnh:</strong> Bạn là người sống có trật tự và quy trình. Bạn hiếm khi hành động bộc phát. Mọi việc bạn làm đều có sự chuẩn bị kỹ lưỡng và lộ trình rõ ràng. Bạn thích sự ngăn nắp và ghét sự lộn xộn.</p>" }
              ] 
          },
          "missing": { 
              "title": "Thiếu Trục Kế Hoạch (1-2-3)", 
              "blocks": [
                  { "type": "text", "content": "<p><strong>Vấn đề:</strong> Bạn sống khá tùy hứng và thiếu sự chuẩn bị. Bạn thường giải quyết vấn đề theo kiểu \"nước đến chân mới nhảy\", dẫn đến việc cuộc sống đôi khi rơi vào thế bị động.</p>" },
                  { "type": "text", "content": "<p><strong>Lời khuyên:</strong> Hãy bắt đầu ngày mới bằng một bản danh sách công việc (To-do list). Lập kế hoạch không làm mất tự do của bạn, ngược lại, nó giúp bạn làm chủ thời gian hiệu quả hơn.</p>" }
              ] 
          }
        },
        "4-5-6": {
          "present": { 
              "title": "Trục Ý Chí (4-5-6)", 
              "blocks": [
                  { "type": "text", "content": "<p><strong>Sức mạnh:</strong> Bạn sở hữu ý chí kiên cường và lòng quyết tâm cao độ. Một khi đã đặt ra mục tiêu, khó khăn không làm bạn nản lòng mà càng khiến bạn mạnh mẽ hơn. Bạn biết cách vượt qua rào cản để đạt được điều mình muốn.</p>" }
              ] 
          },
          "missing": { 
              "title": "Thiếu Trục Ý Chí (4-5-6)", 
              "blocks": [
                  { "type": "text", "content": "<p><strong>Vấn đề:</strong> Bạn dễ nản lòng khi gặp chướng ngại vật. Bạn thường mong cầu kết quả nhanh chóng nhưng lại thiếu sự kiên trì để đi hết chặng đường gian nan. Khi thất bại, bạn dễ rơi vào thất vọng và tự trách.</p>" },
                  { "type": "text", "content": "<p><strong>Lời khuyên:</strong> Hãy chia nhỏ mục tiêu lớn thành những bước đi nhỏ dễ dàng thực hiện. Tập trung vào từng bước một thay vì nhìn vào ngọn núi quá cao trước mặt.</p>" }
              ] 
          }
        },
        "7-8-9": {
          "present": { 
              "title": "Trục Hoạt Động (7-8-9)", 
              "blocks": [
                  { "type": "text", "content": "<p><strong>Sức mạnh:</strong> Bạn mang trong mình nguồn năng lượng dồi dào và hướng ngoại. Bạn không chịu ngồi yên một chỗ mà thích di chuyển, du lịch và trải nghiệm thực tế. Bạn có xu hướng hành động nhanh và muốn mở rộng tầm ảnh hưởng.</p>" }
              ] 
          },
          "missing": { 
              "title": "Thiếu Trục Hoạt Động (7-8-9)", 
              "blocks": [
                  { "type": "text", "content": "<p><strong>Vấn đề:</strong> Bạn có xu hướng thụ động, ngại thay đổi và chần chừ khi phải bắt đầu một cái gì đó mới. Bạn thích vùng an toàn hơn là sự xê dịch.</p>" },
                  { "type": "text", "content": "<p><strong>Lời khuyên:</strong> Đừng suy nghĩ quá nhiều trước khi làm. Hãy áp dụng quy tắc \"5 giây\" để kích hoạt hành động ngay lập tức trước khi sự trì hoãn kéo bạn lại.</p>" }
              ] 
          }
        },
        "1-5-9": {
          "present": { 
              "title": "Trục Quyết Tâm (1-5-9)", 
              "blocks": [
                  { "type": "text", "content": "<p><strong>Sức mạnh:</strong> Đây là trục của những người thành công bền bỉ. Bạn có tầm nhìn xa (9), khả năng kết nối (5) và cái tôi dám làm (1). Bạn kiên trì theo đuổi mục tiêu đến cùng và hiếm khi bỏ cuộc giữa chừng.</p>" }
              ] 
          },
          "missing": { 
              "title": "Thiếu Trục Quyết Tâm (1-5-9)", 
              "blocks": [
                  { "type": "text", "content": "<p><strong>Vấn đề:</strong> Bạn hay do dự và thiếu sự kiên định. Bạn có thể bắt đầu rất hứng khởi nhưng nhiệt huyết giảm dần theo thời gian, dẫn đến nhiều dự án bị bỏ dở (đầu voi đuôi chuột).</p>" },
                  { "type": "text", "content": "<p><strong>Lời khuyên:</strong> Hãy học cách cam kết và hoàn thành những gì mình đã bắt đầu, dù là việc nhỏ nhất. Sự kiên trì là kỹ năng cần phải rèn luyện mỗi ngày.</p>" }
              ] 
          }
        },
        "3-5-7": {
          "present": { 
              "title": "Trục Nhạy Bén (3-5-7)", 
              "blocks": [
                  { "type": "text", "content": "<p><strong>Sức mạnh:</strong> Bạn có sự kết nối đặc biệt với thế giới tâm linh và trực giác. Bạn thường có những chiêm nghiệm sâu sắc về cuộc đời, thích tìm hiểu triết lý và có đức tin vững chắc vào những điều tốt đẹp.</p>" }
              ] 
          },
          "missing": { 
              "title": "Thiếu Trục Nhạy Bén (3-5-7)", 
              "blocks": [
                  { "type": "text", "content": "<p><strong>Vấn đề:</strong> Bạn có xu hướng đa nghi và chỉ tin vào thực tế khoa học (những gì mắt thấy tai nghe). Điều này giúp bạn thực tế nhưng đôi khi làm hạn chế cái nhìn sâu sắc về những khía cạnh tinh thần của cuộc sống.</p>" },
                  { "type": "text", "content": "<p><strong>Lời khuyên:</strong> Hãy mở lòng hơn với những điều kỳ diệu mà logic không giải thích được. Đọc sách, tìm hiểu về tôn giáo hoặc triết học sẽ giúp bạn mở rộng thế giới quan.</p>" }
              ] 
          }
        }
      },
    "synthesis": {
      "1-4-7": {
        "present": { 
            "title": "Trục Thực Tiễn Toàn Diện (1-4-7)", 
            "blocks": [
                { "type": "text", "content": "<p><strong>Sức mạnh tổng hợp:</strong> Sự kết hợp giữa bản năng và sự rèn luyện giúp bạn trở thành người cực kỳ tháo vát. Bạn không chỉ khéo léo trong công việc tay chân mà còn có tư duy sắp xếp vật chất rất tốt. Bạn là mẫu người \"nói ít làm nhiều\", tạo ra những giá trị hữu hình vững chắc cho gia đình và xã hội.</p>" }
            ] 
        },
        "missing": { 
            "title": "Thiếu Trục Thực Tiễn (1-4-7)", 
            "blocks": [
                { "type": "text", "content": "<p><strong>Vấn đề:</strong> Dù đã trưởng thành, bạn vẫn có xu hướng sống thiếu thực tế hoặc lộn xộn. Bạn có thể có nhiều kiến thức (từ tên hoặc ngày sinh riêng lẻ) nhưng lại gặp khó khăn trong việc áp dụng chúng vào đời sống cơm áo gạo tiền hàng ngày.</p>" },
                { "type": "text", "content": "<p><strong>Lời khuyên:</strong> Hãy tập trung vào những việc cụ thể, \"sờ nắn\" được. Tham gia các hoạt động thể chất, nấu ăn, làm vườn hoặc dọn dẹp nhà cửa là cách tốt nhất để bạn cân bằng năng lượng.</p>" }
            ] 
        }
      },
      "2-5-8": {
        "present": { 
            "title": "Trục Cân Bằng Cảm Xúc (2-5-8)", 
            "blocks": [
                { "type": "text", "content": "<p><strong>Sức mạnh tổng hợp:</strong> Bạn đạt được trạng thái cân bằng cảm xúc đáng ngưỡng mộ. Bạn thấu hiểu sâu sắc tâm lý con người và có khả năng chữa lành cho người khác. Sự hiện diện của trục này trong biểu đồ tổng hợp cho thấy bạn là một điểm tựa tinh thần vững chãi, một \"nhà ngoại giao\" tài ba của cuộc đời.</p>" }
            ] 
        },
        "missing": { 
            "title": "Thiếu Trục Cảm Xúc (2-5-8)", 
            "blocks": [
                { "type": "text", "content": "<p><strong>Vấn đề:</strong> Bạn vẫn giữ sự nhạy cảm thái quá hoặc dễ bị tổn thương dù bề ngoài có vẻ cứng rắn. Cảm xúc của bạn thường bị kìm nén hoặc bùng nổ không kiểm soát được, gây ảnh hưởng đến các mối quan hệ thân thiết.</p>" },
                { "type": "text", "content": "<p><strong>Lời khuyên:</strong> Hãy học cách bộc lộ cảm xúc một cách lành mạnh. Đừng giấu kín nỗi buồn. Việc chia sẻ và kết nối chân thành sẽ giúp bạn lấp đầy khoảng trống này.</p>" }
            ] 
        }
      },
      "3-6-9": {
        "present": { 
            "title": "Trục Sáng Trí & Hoài Bão (3-6-9)", 
            "blocks": [
                { "type": "text", "content": "<p><strong>Sức mạnh tổng hợp:</strong> Trí tuệ của bạn không chỉ dừng lại ở sách vở mà đã phát triển thành sự thông thái. Bạn có khả năng ghi nhớ, phân tích và sáng tạo vượt trội. Đặc biệt, trí tuệ này được dẫn dắt bởi một lý tưởng cao đẹp (số 9), giúp bạn không chỉ thông minh mà còn sống có ích.</p>" }
            ] 
        },
        "missing": { 
            "title": "Thiếu Trục Sáng Trí (3-6-9)", 
            "blocks": [
                { "type": "text", "content": "<p><strong>Vấn đề:</strong> Bạn có thể cảm thấy tư duy của mình đôi khi bị trì trệ hoặc thiếu sự sáng suốt trong các quyết định lớn. Bạn dễ bị cuốn vào những lo toan vụn vặt mà quên đi bức tranh lớn của cuộc đời.</p>" },
                { "type": "text", "content": "<p><strong>Lời khuyên:</strong> Hãy không ngừng học hỏi. Đọc sách, tham gia các khóa học hoặc tìm kiếm một người thầy (mentor) sẽ giúp bạn kích hoạt lại nguồn năng lượng trí tuệ này.</p>" }
            ] 
        }
      },
      "1-2-3": {
        "present": { 
            "title": "Trục Kế Hoạch & Tổ Chức (1-2-3)", 
            "blocks": [
                { "type": "text", "content": "<p><strong>Sức mạnh tổng hợp:</strong> Bạn là bậc thầy của sự sắp xếp. Trong cuộc sống tổng hòa, bạn hiếm khi để mọi việc rơi vào hỗn loạn. Bạn có tầm nhìn, có kế hoạch và có kỷ luật để thực thi. Đây là trục của những nhà quản lý tài ba.</p>" }
            ] 
        },
        "missing": { 
            "title": "Thiếu Trục Kế Hoạch (1-2-3)", 
            "blocks": [
                { "type": "text", "content": "<p><strong>Vấn đề:</strong> Bạn thường sống theo cảm hứng và thiếu mục tiêu rõ ràng. Dù bạn có tài năng, nhưng sự thiếu quy hoạch khiến bạn lãng phí nhiều thời gian và công sức mà không đạt được kết quả như ý.</p>" },
                { "type": "text", "content": "<p><strong>Lời khuyên:</strong> Kỷ luật là chìa khóa. Hãy tập thói quen lập kế hoạch ngày, tuần, tháng. Một cuộc sống có trật tự sẽ mang lại cho bạn sự tự do đích thực.</p>" }
            ] 
        }
      },
      "4-5-6": {
        "present": { 
            "title": "Trục Ý Chí Kiên Cường (4-5-6)", 
            "blocks": [
                { "type": "text", "content": "<p><strong>Sức mạnh tổng hợp:</strong> Bạn sở hữu ý chí sắt đá đã được tôi luyện qua thời gian. Không khó khăn nào có thể đánh gục bạn. Bạn biết cách vượt qua chướng ngại vật bằng sự kiên trì và linh hoạt. Đây là trục của những người gặt hái thành công lớn sau tuổi trung niên.</p>" }
            ] 
        },
        "missing": { 
            "title": "Thiếu Trục Ý Chí (4-5-6)", 
            "blocks": [
                { "type": "text", "content": "<p><strong>Vấn đề:</strong> Bạn dễ nản lòng và hay bỏ cuộc khi gặp khó khăn. Bạn thường mong muốn kết quả nhanh chóng (mì ăn liền) và thiếu sự bền bỉ cần thiết để đi đường dài.</p>" },
                { "type": "text", "content": "<p><strong>Lời khuyên:</strong> Hãy đặt ra những mục tiêu nhỏ vừa sức và cam kết hoàn thành chúng. Mỗi thành công nhỏ sẽ bồi đắp thêm niềm tin và ý chí cho bạn.</p>" }
            ] 
        }
      },
      "7-8-9": {
        "present": { 
            "title": "Trục Hoạt Động & Ảnh Hưởng (7-8-9)", 
            "blocks": [
                { "type": "text", "content": "<p><strong>Sức mạnh tổng hợp:</strong> Bạn là người có sức ảnh hưởng và năng lực hành động mạnh mẽ. Bạn không chịu ngồi yên hưởng thụ mà luôn muốn cống hiến và mở rộng tầm nhìn. Bạn thích đi nhiều, trải nghiệm nhiều và để lại dấu ấn của mình trên thế giới.</p>" }
            ] 
        },
        "missing": { 
            "title": "Thiếu Trục Hoạt Động (7-8-9)", 
            "blocks": [
                { "type": "text", "content": "<p><strong>Vấn đề:</strong> Bạn có xu hướng thụ động, ngại thay đổi và thích an phận. Bạn có thể có nhiều ước mơ nhưng lại chần chừ không dám bước ra khỏi vùng an toàn để thực hiện chúng.</p>" },
                { "type": "text", "content": "<p><strong>Lời khuyên:</strong> \"Hành trình ngàn dặm bắt đầu từ một bước chân\". Hãy dũng cảm bước đi, dù là những bước nhỏ nhất. Sự trải nghiệm thực tế sẽ giúp bạn trưởng thành.</p>" }
            ] 
        }
      },
      "1-5-9": {
        "present": { 
            "title": "Trục Quyết Tâm (1-5-9)", 
            "blocks": [
                { "type": "text", "content": "<p><strong>Sức mạnh tổng hợp:</strong> Sự hiện diện của trục này trong biểu đồ tổng hợp cho thấy bạn là người có khả năng \"biến không thành có\". Bạn kiên định với mục tiêu của mình bất chấp thời gian và thử thách. Đây là dấu hiệu của sự thành công bền vững.</p>" }
            ] 
        },
        "missing": { 
            "title": "Thiếu Trục Quyết Tâm (1-5-9)", 
            "blocks": [
                { "type": "text", "content": "<p><strong>Vấn đề:</strong> Bạn hay do dự, thiếu quyết đoán và dễ bị lung lay bởi ý kiến người khác. Bạn thường khởi đầu đầy hứng khởi nhưng lại để mọi thứ nguội lạnh dần rồi bỏ dở.</p>" },
                { "type": "text", "content": "<p><strong>Lời khuyên:</strong> Hãy rèn luyện sự tập trung (Focus). Đừng ôm đồm quá nhiều việc cùng lúc. Hãy chọn một việc quan trọng nhất và theo đuổi nó đến cùng.</p>" }
            ] 
        }
      },
      "3-5-7": {
        "present": { 
            "title": "Trục Nhạy Bén Tâm Linh (3-5-7)", 
            "blocks": [
                { "type": "text", "content": "<p><strong>Sức mạnh tổng hợp:</strong> Bạn có một đời sống nội tâm phong phú và đức tin vững chắc. Bạn nhìn cuộc đời bằng con mắt của sự thấu hiểu và lòng từ bi. Trục này giúp bạn tìm thấy sự bình an ngay giữa những xáo trộn của cuộc sống.</p>" }
            ] 
        },
        "missing": { 
            "title": "Thiếu Trục Tâm Linh (3-5-7)", 
            "blocks": [
                { "type": "text", "content": "<p><strong>Vấn đề:</strong> Bạn thường quá thực tế, đa nghi và thiếu niềm tin vào những điều tốt đẹp vô hình. Điều này có thể khiến tâm hồn bạn trở nên khô cằn hoặc cảm thấy cô đơn, lạc lõng.</p>" },
                { "type": "text", "content": "<p><strong>Lời khuyên:</strong> Hãy dành thời gian để lắng nghe tiếng nói bên trong mình. Tham gia các hoạt động thiện nguyện hoặc tìm hiểu về triết học sẽ giúp tâm hồn bạn phong phú hơn.</p>" }
            ] 
        }
      }
    }
  },

  "missingNumbers": {
    "strength": {
      "1": { 
        "title": "Thiếu số 1 (Biểu đồ ngày sinh)",
        "content": "<p><strong>Ý nghĩa:</strong> Bạn thiếu đi cái tôi mạnh mẽ và sự tự chủ bẩm sinh. Bạn thường gặp khó khăn trong việc thể hiện bản thân, hay do dự và dễ bị ý kiến của người khác chi phối. Bạn có xu hướng dựa dẫm và ngại đưa ra quyết định độc lập.</p>" 
      },
      "2": { 
        "title": "Thiếu số 2 (Biểu đồ ngày sinh)",
        "content": "<p><strong>Ý nghĩa:</strong> Bạn thiếu đi sự nhạy cảm và trực giác tự nhiên. Bạn có thể hơi khô khan, thiếu tinh tế trong giao tiếp hoặc khó thấu hiểu cảm xúc của người khác. Bạn thường giải quyết vấn đề bằng lý trí cứng nhắc thay vì sự mềm mỏng, ngoại giao.</p>" 
      },
      "3": { 
        "title": "Thiếu số 3 (Biểu đồ ngày sinh)",
        "content": "<p><strong>Ý nghĩa:</strong> Bạn gặp khó khăn trong việc diễn đạt suy nghĩ và cảm xúc ra bên ngoài. Bạn có thể thiếu sự hài hước, lạc quan hoặc trí tưởng tượng phong phú. Cuộc sống của bạn đôi khi hơi tẻ nhạt vì thiếu đi sự ngẫu hứng và sáng tạo.</p>" 
      },
      "4": { 
        "title": "Thiếu số 4 (Biểu đồ ngày sinh)",
        "content": "<p><strong>Ý nghĩa:</strong> Bạn thiếu tính thực tế, kỷ luật và sự ngăn nắp. Bạn thường làm việc tùy hứng, thiếu kế hoạch hoặc hay bỏ dở giữa chừng. Bạn gặp khó khăn với các vấn đề chi tiết, tỉ mỉ hoặc quản lý tài chính chặt chẽ.</p>" 
      },
      "5": { 
        "title": "Thiếu số 5 (Biểu đồ ngày sinh)",
        "content": "<p><strong>Ý nghĩa:</strong> Bạn thiếu sự linh hoạt và khả năng thích nghi. Bạn ngại thay đổi, thích sự an toàn và ổn định thái quá. Bạn có thể gặp khó khăn trong việc kết nối xã hội hoặc thiếu động lực để trải nghiệm những điều mới mẻ.</p>" 
      },
      "6": { 
        "title": "Thiếu số 6 (Biểu đồ ngày sinh)",
        "content": "<p><strong>Ý nghĩa:</strong> Bạn thiếu đi sự gắn kết tự nhiên với gia đình. Bạn có thể trốn tránh trách nhiệm, sống hơi vô tâm hoặc gặp khó khăn trong việc cam kết lâu dài. Bạn chưa biết cách thể hiện tình yêu thương và sự chăm sóc đúng mực.</p>" 
      },
      "7": { 
        "title": "Thiếu số 7 (Biểu đồ ngày sinh)",
        "content": "<p><strong>Ý nghĩa:</strong> Bạn thiếu đi chiều sâu nội tâm và sự chiêm nghiệm. Bạn có xu hướng tin người thái quá hoặc sống hời hợt, ít khi đặt câu hỏi \"Tại sao\". Bạn quan tâm nhiều đến vẻ bề ngoài hơn là bản chất bên trong của vấn đề.</p>" 
      },
      "8": { 
        "title": "Thiếu số 8 (Biểu đồ ngày sinh)",
        "content": "<p><strong>Ý nghĩa:</strong> Bạn thiếu sự quyết đoán, độc lập và tư duy kinh doanh bẩm sinh. Bạn có thể không quan tâm đến tiền bạc, quyền lực hoặc gặp khó khăn trong việc quản lý tài chính và khẳng định vị thế của mình.</p>" 
      },
      "9": { 
        "title": "Thiếu số 9 (Biểu đồ ngày sinh)",
        "content": "<p><strong>Ý nghĩa:</strong> Bạn thiếu đi lòng trắc ẩn và tầm nhìn nhân đạo. Bạn có xu hướng sống thực dụng, chỉ quan tâm đến lợi ích cá nhân mà ít để ý đến cộng đồng. Bạn chưa có động lực lớn lao để cống hiến cho xã hội.</p>" 
      }
    },
    "synthesis": {
      "1": { 
        "title": "Thiếu số 1 (Biểu đồ tổng hợp)",
        "content": "<p><strong>Bài học: Rèn luyện sự Tự Chủ.</strong><br>Tên của bạn chưa bù đắp được sự thiếu hụt này. Bạn cần học cách đứng trên đôi chân của mình, dám đưa ra quyết định và chịu trách nhiệm. Hãy tập làm một người dẫn đầu trong chính cuộc đời bạn thay vì chờ đợi người khác.</p>" 
      },
      "2": { 
        "title": "Thiếu số 2 (Biểu đồ tổng hợp)",
        "content": "<p><strong>Bài học: Học cách Lắng Nghe & Hợp Tác.</strong><br>Vũ trụ nhắc nhở bạn cần phát triển chỉ số cảm xúc (EQ). Hãy học cách đặt mình vào vị trí người khác, rèn luyện sự kiên nhẫn và tinh tế. Sự thành công của bạn sẽ đến từ khả năng làm việc nhóm và hòa giải.</p>" 
      },
      "3": { 
        "title": "Thiếu số 3 (Biểu đồ tổng hợp)",
        "content": "<p><strong>Bài học: Tự tin Diễn đạt & Tìm kiếm Niềm vui.</strong><br>Bạn cần học cách nói ra suy nghĩ của mình một cách rõ ràng và tự tin. Hãy tham gia các hoạt động nghệ thuật, giao tiếp nhiều hơn và tìm kiếm những sở thích giúp tâm hồn bạn vui vẻ, lạc quan.</p>" 
      },
      "4": { 
        "title": "Thiếu số 4 (Biểu đồ tổng hợp)",
        "content": "<p><strong>Bài học: Xây dựng Kỷ luật & Nền tảng.</strong><br>Đây là bài học quan trọng về sự kiên trì. Bạn cần học cách lập kế hoạch, sắp xếp cuộc sống ngăn nắp và chú trọng đến những giá trị thực tế. Đừng xây lâu đài trên cát, hãy xây dựng nền móng vững chắc.</p>" 
      },
      "5": { 
        "title": "Thiếu số 5 (Biểu đồ tổng hợp)",
        "content": "<p><strong>Bài học: Mở lòng & Thích nghi.</strong><br>Bạn cần bước ra khỏi vùng an toàn. Hãy học cách đón nhận sự thay đổi như một phần tất yếu của cuộc sống. Sự trải nghiệm, đi lại và kết nối với nhiều người sẽ giúp bạn trưởng thành vượt bậc.</p>" 
      },
      "6": { 
        "title": "Thiếu số 6 (Biểu đồ tổng hợp)",
        "content": "<p><strong>Bài học: Trách nhiệm & Yêu thương.</strong><br>Bạn cần học cách quan tâm đến người khác từ tận đáy lòng. Hãy dành thời gian cho gia đình, học cách hy sinh và cam kết. Hạnh phúc sẽ đến khi bạn biết cho đi tình yêu thương và sự chăm sóc.</p>" 
      },
      "7": { 
        "title": "Thiếu số 7 (Biểu đồ tổng hợp)",
        "content": "<p><strong>Bài học: Tìm về Nội tâm & Đức tin.</strong><br>Bạn cần dành thời gian tĩnh lặng để hiểu chính mình. Hãy học hỏi, nghiên cứu sâu về một lĩnh vực nào đó và xây dựng cho mình một đức tin vững chắc. Đừng chỉ nhìn cuộc đời qua lăng kính vật chất.</p>" 
      },
      "8": { 
        "title": "Thiếu số 8 (Biểu đồ tổng hợp)",
        "content": "<p><strong>Bài học: Quản trị Tài chính & Quyền lực.</strong><br>Bạn cần thay đổi tư duy về tiền bạc và thành công. Hãy học cách quản lý tài chính, rèn luyện bản lĩnh và sự quyết đoán. Đừng ngại dấn thân để đạt được sự độc lập về vật chất.</p>" 
      },
      "9": { 
        "title": "Thiếu số 9 (Biểu đồ tổng hợp)",
        "content": "<p><strong>Bài học: Lòng Nhân ái & Sự Cho đi.</strong><br>Bài học lớn nhất của bạn là học cách yêu thương vô điều kiện. Hãy mở rộng trái tim, tham gia các hoạt động thiện nguyện và tha thứ cho những lỗi lầm. Sự cho đi sẽ mang lại cho bạn sự bình an đích thực.</p>" 
      }
    }
  },
  "periodCycleMeanings": {
    "1": {
      "title": "Chu kỳ mang năng lượng số 1 - Sự Khởi Đầu & Tự Chủ",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Đây là giai đoạn đòi hỏi bạn phải phát triển <strong>tính độc lập và cá tính riêng</strong>. Vũ trụ sẽ đẩy bạn vào những hoàn cảnh buộc bạn phải tự đứng trên đôi chân mình, tự ra quyết định mà không thể dựa dẫm vào gia đình hay người khác.</p><p>Đây là thời điểm vàng để bắt đầu những dự án mới, gieo những hạt giống mới cho cuộc đời. Bạn sẽ học được bài học về sự can đảm và khả năng lãnh đạo bản thân.</p>"
        },
        {
          "type": "list",
          "title": "Lời khuyên cho giai đoạn này:",
          "items": [
            "Hãy dũng cảm tiên phong, đừng sợ đi một mình.",
            "Rèn luyện ý chí và sự quyết đoán.",
            "Tránh sự ích kỷ hoặc cái tôi quá lớn gây ảnh hưởng đến mối quan hệ.",
            "Tập trung vào mục tiêu cá nhân và khẳng định bản sắc."
          ]
        }
      ]
    },
    "2": {
      "title": "Chu kỳ mang năng lượng số 2 - Sự Hợp Tác & Cân Bằng",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Trái ngược với sự độc lập của số 1, giai đoạn này dạy bạn bài học về <strong>sự hòa hợp và kiên nhẫn</strong>. Bạn sẽ thấy mình phát triển tốt nhất khi làm việc cùng người khác, trong các mối quan hệ đối tác hoặc hôn nhân.</p><p>Trực giác của bạn sẽ trở nên nhạy bén hơn bao giờ hết. Đây là lúc để bạn học cách lắng nghe, thấu cảm và giải quyết các mâu thuẫn bằng sự tinh tế.</p>"
        },
        {
          "type": "list",
          "title": "Lời khuyên cho giai đoạn này:",
          "items": [
            "Học cách ngoại giao và thỏa hiệp.",
            "Chú trọng nuôi dưỡng các mối quan hệ chất lượng.",
            "Đừng để sự nhạy cảm thái quá làm bạn tổn thương.",
            "Kiên nhẫn chờ đợi thời cơ, đừng vội vàng đốt cháy giai đoạn."
          ]
        }
      ]
    },
    "3": {
      "title": "Chu kỳ mang năng lượng số 3 - Sáng Tạo & Niềm Vui",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Đây là khoảng thời gian tươi sáng, mang lại nhiều <strong>cảm hứng sáng tạo và cơ hội giao tiếp</strong>. Bạn sẽ cảm thấy nhu cầu được thể hiện bản thân mãnh liệt hơn, dù là qua lời nói, viết lách hay nghệ thuật.</p><p>Cuộc sống xã hội của bạn sẽ rất sôi động. Bài học của giai đoạn này là tìm kiếm niềm vui và lan tỏa sự lạc quan đến mọi người xung quanh.</p>"
        },
        {
          "type": "list",
          "title": "Lời khuyên cho giai đoạn này:",
          "items": [
            "Hãy tự tin bày tỏ suy nghĩ và cảm xúc thật.",
            "Tham gia các hoạt động nghệ thuật hoặc cộng đồng.",
            "Tránh sự hời hợt hoặc phung phí năng lượng vào những cuộc vui vô bổ.",
            "Giữ tinh thần lạc quan để thu hút may mắn."
          ]
        }
      ]
    },
    "4": {
      "title": "Chu kỳ mang năng lượng số 4 - Xây Dựng & Kỷ Luật",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Đây là giai đoạn của <strong>công việc và sự ổn định</strong>. Bạn sẽ tập trung vào việc xây dựng nền móng vững chắc cho tương lai (tài chính, nhà cửa, sự nghiệp). Mọi thứ sẽ không đến dễ dàng hay may mắn bất ngờ, mà đòi hỏi sự nỗ lực thực sự.</p><p>Bạn sẽ học được giá trị của sự kỷ luật, trật tự và quy trình. Đây là lúc để \"biến giấc mơ thành hiện thực\" thông qua hành động cụ thể.</p>"
        },
        {
          "type": "list",
          "title": "Lời khuyên cho giai đoạn này:",
          "items": [
            "Lập kế hoạch chi tiết và tuân thủ nó.",
            "Tiết kiệm và quản lý tài chính chặt chẽ.",
            "Chăm chỉ, kiên trì nhưng đừng để công việc nuốt chửng cuộc sống.",
            "Tránh sự cứng nhắc và bảo thủ."
          ]
        }
      ]
    },
    "5": {
      "title": "Chu kỳ mang năng lượng số 5 - Tự Do & Thay Đổi",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Hãy thắt dây an toàn, vì đây là giai đoạn của những <strong>biến động và thay đổi bất ngờ</strong>. Bạn có thể thay đổi công việc, chỗ ở, hoặc tư duy sống. Sự tự do sẽ là khao khát lớn nhất của bạn.</p><p>Đây là thời kỳ để mở rộng tầm nhìn, đi du lịch, trải nghiệm những điều mới lạ và thoát khỏi những khuôn khổ cũ kỹ đã kìm hãm bạn.</p>"
        },
        {
          "type": "list",
          "title": "Lời khuyên cho giai đoạn này:",
          "items": [
            "Sẵn sàng đón nhận những cơ hội mới.",
            "Linh hoạt thích nghi với hoàn cảnh.",
            "Học cách cân bằng giữa tự do và trách nhiệm.",
            "Cẩn trọng để không sa đà vào những thú vui thiếu lành mạnh."
          ]
        }
      ]
    },
    "6": {
      "title": "Chu kỳ mang năng lượng số 6 - Gia Đình & Trách Nhiệm",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Giai đoạn này tâm điểm của bạn sẽ hướng về <strong>gia đình, tình yêu và sự phụng sự</strong>. Bạn có thể sẽ kết hôn, sinh con, hoặc phải dành nhiều thời gian chăm sóc cha mẹ/người thân. Trách nhiệm là từ khóa chính.</p><p>Bạn sẽ tìm thấy hạnh phúc sâu sắc thông qua việc chăm sóc người khác và làm đẹp cho tổ ấm của mình. Đây là thời kỳ của sự ổn định cảm xúc.</p>"
        },
        {
          "type": "list",
          "title": "Lời khuyên cho giai đoạn này:",
          "items": [
            "Ưu tiên thời gian cho gia đình và người thân.",
            "Học cách yêu thương và hy sinh nhưng đừng để bản thân bị lợi dụng.",
            "Giải quyết các mâu thuẫn bằng sự bao dung.",
            "Tạo dựng không gian sống hài hòa, ấm cúng."
          ]
        }
      ]
    },
    "7": {
      "title": "Chu kỳ mang năng lượng số 7 - Chiêm Nghiệm & Tri Thức",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Đây là khoảng thời gian để <strong>quay vào bên trong</strong>. Bạn sẽ cảm thấy muốn tách mình ra khỏi những ồn ào náo nhiệt để suy ngẫm về ý nghĩa cuộc đời. Đây là giai đoạn tuyệt vời cho việc học tập, nghiên cứu và phát triển tâm linh.</p><p>Có thể bạn sẽ đối mặt với một vài thử thách hoặc sự cô đơn, nhưng chính điều đó giúp bạn trưởng thành về mặt trí tuệ và nhận thức.</p>"
        },
        {
          "type": "list",
          "title": "Lời khuyên cho giai đoạn này:",
          "items": [
            "Dành thời gian tĩnh lặng để thấu hiểu bản thân.",
            "Trau dồi kiến thức chuyên môn hoặc tìm hiểu triết học/tâm linh.",
            "Đừng lo lắng nếu tiến độ vật chất có vẻ chậm lại.",
            "Giữ vững đức tin và sự lạc quan."
          ]
        }
      ]
    },
    "8": {
      "title": "Chu kỳ mang năng lượng số 8 - Thành Tựu & Quyền Lực",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Đây là giai đoạn gặt hái. Bạn sẽ tập trung mạnh mẽ vào <strong>sự nghiệp, tài chính và khẳng định vị thế</strong>. Cơ hội thăng tiến, mở rộng kinh doanh hoặc gia tăng tài sản sẽ đến với bạn nếu bạn nỗ lực.</p><p>Bạn sẽ học bài học về cách quản lý quyền lực và tiền bạc. Đây là lúc để bạn thể hiện bản lĩnh của một người điều hành thực thụ.</p>"
        },
        {
          "type": "list",
          "title": "Lời khuyên cho giai đoạn này:",
          "items": [
            "Tập trung vào mục tiêu lớn và hiệu quả thực tế.",
            "Quản lý tài chính minh bạch và khôn ngoan.",
            "Cân bằng giữa tham vọng vật chất và giá trị tinh thần.",
            "Sử dụng quyền lực để tạo ra giá trị cho cộng đồng."
          ]
        }
      ]
    },
    "9": {
      "title": "Chu kỳ mang năng lượng số 9 - Cống Hiến & Hoàn Tất",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Đây là giai đoạn của sự <strong>tổng kết và cho đi</strong>. Bạn sẽ cảm thấy thôi thúc muốn làm những việc có ích cho xã hội, cộng đồng. Lòng trắc ẩn và sự bao dung của bạn sẽ phát triển mạnh mẽ.</p><p>Đồng thời, đây cũng là lúc để buông bỏ những gì không còn phù hợp (mối quan hệ cũ, công việc cũ...) để dọn đường cho một chu kỳ mới tốt đẹp hơn.</p>"
        },
        {
          "type": "list",
          "title": "Lời khuyên cho giai đoạn này:",
          "items": [
            "Học cách tha thứ và buông bỏ quá khứ.",
            "Tham gia các hoạt động thiện nguyện, nhân đạo.",
            "Sống bao dung và vị tha hơn.",
            "Hoàn thành nốt những dự án còn dang dở."
          ]
        }
      ]
    },
    "11": {
      "title": "Chu kỳ mang năng lượng số 11 - Khai Sáng & Trực Giác",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Đây là giai đoạn mang năng lượng tâm linh cao (Master Number). Bạn sẽ có những bước nhảy vọt về mặt <strong>nhận thức và trực giác</strong>. Bạn có tiềm năng trở thành người truyền cảm hứng hoặc dẫn dắt tinh thần cho người khác.</p><p>Tuy nhiên, bạn cũng có thể cảm thấy áp lực thần kinh lớn do sự nhạy cảm quá mức. Cuộc sống đòi hỏi bạn phải sống gương mẫu và hướng thượng.</p>"
        },
        {
          "type": "list",
          "title": "Lời khuyên cho giai đoạn này:",
          "items": [
            "Tin tưởng vào trực giác và tiếng nói bên trong.",
            "Giữ tâm trí bình an, tránh xa môi trường tiêu cực.",
            "Chia sẻ những ý tưởng và tầm nhìn của bạn để giúp đỡ mọi người.",
            "Sống trung thực với lý tưởng của mình."
          ]
        }
      ]
    },
    "22": {
      "title": "Chu kỳ mang năng lượng số 22 - Kiến Tạo Đại Nghiệp",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Đây là chu kỳ của \"Kiến trúc sư đại tài\". Bạn có cơ hội để biến những giấc mơ vĩ đại thành hiện thực. Năng lượng của số 22 hỗ trợ bạn thực hiện các <strong>dự án quy mô lớn, mang tầm ảnh hưởng quốc tế</strong> hoặc cộng đồng rộng rãi.</p><p>Sự kết hợp giữa tầm nhìn xa (11) và tính thực tế (4) sẽ giúp bạn xây dựng nên những di sản bền vững.</p>"
        },
        {
          "type": "list",
          "title": "Lời khuyên cho giai đoạn này:",
          "items": [
            "Dám nghĩ lớn và làm lớn.",
            "Kết hợp kỷ luật thép với tầm nhìn vĩ mô.",
            "Làm việc vì lợi ích chung của cộng đồng.",
            "Giữ sức khỏe để chịu đựng được áp lực công việc lớn."
          ]
        }
      ]
    },
    "33": {
      "title": "Chu kỳ mang năng lượng số 33 - Chữa Lành & Tình Yêu Lớn",
      "blocks": [
        {
          "type": "text",
          "content": "<p>Giai đoạn này hiếm gặp và mang năng lượng rung động rất cao. Bạn được kêu gọi để trở thành một \"người thầy\" về mặt tinh thần, mang lại <strong>sự chữa lành và tình yêu thương vô điều kiện</strong> cho nhân loại.</p><p>Trách nhiệm của bạn trong giai đoạn này thường rất nặng nề nhưng cũng đầy vinh quang nếu bạn biết đặt cái tôi sang một bên để phụng sự.</p>"
        },
        {
          "type": "list",
          "title": "Lời khuyên cho giai đoạn này:",
          "items": [
            "Lan tỏa tình yêu thương và sự bao dung.",
            "Giúp đỡ những người yếu thế và tổn thương.",
            "Cân bằng cảm xúc để không bị kiệt sức.",
            "Sống như một tấm gương sáng về lòng nhân ái."
          ]
        }
      ]
    }
  },

  "karmicDebt": {
    "13": {
      "title": "Nợ Nghiệp 13/4 - Nghiệp Lười Biếng & Tiêu Cực",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Nguồn gốc:</strong> Con số này xuất hiện do trong quá khứ (hoặc tiền kiếp), bạn có thể đã sống buông thả, lười biếng, trốn tránh trách nhiệm hoặc để lại gánh nặng công việc cho người khác. Bạn có thể đã dùng sự tiêu cực để đối phó với cuộc đời.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Biểu hiện hiện tại:</strong> Trong kiếp này, bạn thường cảm thấy cuộc sống đầy rẫy chông gai. Mọi việc bạn làm hiếm khi suôn sẻ ngay từ đầu mà thường gặp vật cản. Bạn có cảm giác mình phải nỗ lực gấp 3-4 lần người khác mới đạt được kết quả tương đương.</p>"
        },
        {
          "type": "quote",
          "content": "Lời giải: Chìa khóa hóa giải là \"Kỷ luật & Không đi đường tắt\". Hãy đối mặt với khó khăn bằng thái độ vui vẻ, không than vãn. Chỉ có sự chăm chỉ và kiên trì đến cùng mới giúp bạn trả xong món nợ này."
        }
      ]
    },
    "14": {
      "title": "Nợ Nghiệp 14/5 - Nghiệp Bất Ổn & Lạm Dụng Tự Do",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Nguồn gốc:</strong> Nợ nghiệp này hình thành do việc lạm dụng sự tự do để thỏa mãn các dục vọng cá nhân (ăn uống, sắc dục, chất kích thích...) hoặc sống vô trách nhiệm, gây tổn thương cho người khác bằng sự hời hợt của mình.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Biểu hiện hiện tại:</strong> Cuộc sống của bạn giống như một chiếc tàu lượn siêu tốc: đầy biến động và thay đổi bất ngờ. Bạn dễ rơi vào các vấn đề liên quan đến nghiện ngập (game, rượu, tình cảm...) hoặc cảm thấy khó khăn trong việc giữ cam kết lâu dài.</p>"
        },
        {
          "type": "quote",
          "content": "Lời giải: Chìa khóa hóa giải là \"Sự Tiết Chế & Cam Kết\". Hãy học cách sống điều độ, giữ trật tự trong cuộc sống và duy trì những cam kết đã đặt ra. Đừng chạy trốn thực tại bằng những khoái cảm nhất thời."
        }
      ]
    },
    "16": {
      "title": "Nợ Nghiệp 16/7 - Nghiệp Đổ Vỡ & Tái Sinh",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Nguồn gốc:</strong> Đây là con số nợ nghiệp liên quan đến tình cảm và cái tôi. Trong quá khứ, có thể bạn đã dùng sự kiêu ngạo, vô tâm để chà đạp tình cảm người khác, hoặc có những mối quan hệ bất chính gây đau khổ cho gia đình người khác.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Biểu hiện hiện tại:</strong> Số 16 thường báo hiệu những sự sụp đổ bất ngờ (như hình ảnh lá bài The Tower trong Tarot). Sự nghiệp, danh tiếng hoặc những mối tình ngỡ như bền vững có thể tan vỡ trong chớp mắt. Mục đích là để phá vỡ cái tôi kiêu hãnh của bạn.</p>"
        },
        {
          "type": "quote",
          "content": "Lời giải: Chìa khóa hóa giải là \"Sự Khiêm Nhường & Thức Tỉnh\". Hãy học cách sống chân thành, chung thủy và buông bỏ những giá trị ảo (danh vọng, sĩ diện). Tìm về đời sống tâm linh sẽ giúp bạn bình an đi qua bão tố."
        }
      ]
    },
    "19": {
      "title": "Nợ Nghiệp 19/1 - Nghiệp Lạm Quyền & Bất Công",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Nguồn gốc:</strong> Trong quá khứ, bạn có thể là người nắm quyền lực nhưng đã sử dụng nó để chèn ép, bóc lột người khác nhằm thu lợi cho bản thân. Bạn đã sống ích kỷ và từ chối giúp đỡ khi người khác cần.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Biểu hiện hiện tại:</strong> Bạn thường rơi vào cảnh cô độc, \"tứ cố vô thân\" khi gặp khó khăn. Bạn cảm thấy mình phải tự lực cánh sinh mà không ai giúp đỡ, hoặc thường xuyên bị người khác đối xử bất công, lấn lướt dù bạn đã làm đúng.</p>"
        },
        {
          "type": "quote",
          "content": "Lời giải: Chìa khóa hóa giải là \"Cho đi & Biết ơn\". Hãy học cách lắng nghe ý kiến người khác thay vì áp đặt. Hãy giúp đỡ mọi người không toan tính. Khi bạn biết cúi đầu phục vụ, bạn sẽ trở thành người lãnh đạo thực thụ."
        }
      ]
    }
  },
  "karmicLessons": {
    "1": {
      "title": "Thiếu số 1: Thiếu Tự Tin & Quyết Đoán",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Biểu hiện:</strong> Khi tên bạn thiếu số 1, bạn thường hay ngần ngại, thiếu tự tin vào năng lực của mình. Bạn có thói quen chờ người khác \"chốt\" hộ hoặc rất sợ phải đứng mũi chịu sào. Bạn dễ bị người khác tác động và đôi khi đánh mất tiếng nói riêng của mình.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Lời khuyên rèn luyện:</strong> Đừng sợ sai. Hãy tập đưa ra những quyết định nhỏ mỗi ngày (như ăn gì, đi đâu) mà không cần hỏi ý kiến ai. Hãy tin rằng bạn đủ giỏi để tự đứng trên đôi chân mình. Thử thách dành cho bạn là dám nói \"Tôi muốn\" và hành động vì điều đó.</p>"
        }
      ]
    },
    "2": {
      "title": "Thiếu số 2: Thiếu Sự Tinh Tế & Lắng Nghe",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Biểu hiện:</strong> Bạn có thể hơi khô khan, thẳng tính quá mức hoặc thiếu kiên nhẫn khi phải làm việc nhóm. Đôi khi bạn vô tình làm tổn thương người khác mà không biết vì chưa đủ nhạy cảm để \"đọc\" được cảm xúc của họ.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Lời khuyên rèn luyện:</strong> Hãy sống chậm lại một chút để quan sát người xung quanh. Khi ai đó nói chuyện, hãy lắng nghe hết câu thay vì vội vàng ngắt lời. Học cách đặt mình vào vị trí của người khác sẽ giúp bạn trở nên duyên dáng và được yêu mến hơn.</p>"
        }
      ]
    },
    "3": {
      "title": "Thiếu số 3: Khó Bày Tỏ Cảm Xúc & Thiếu Vui Vẻ",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Biểu hiện:</strong> Bạn là người khá kín tiếng, khó mở lời chia sẻ những suy nghĩ trong lòng. Bạn hay nghiêm trọng hóa vấn đề, ít khi đùa giỡn và đôi khi cảm thấy cuộc sống hơi tẻ nhạt, thiếu màu sắc.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Lời khuyên rèn luyện:</strong> Hãy tập cười nhiều hơn và tìm niềm vui từ những điều nhỏ nhặt. Đừng giữ tâm sự trong lòng, hãy thử viết nhật ký hoặc chia sẻ với một người bạn thân. Tham gia một lớp học năng khiếu (hát, vẽ, nhảy) cũng là cách tuyệt vời để bạn \"mở khóa\" sự tự tin.</p>"
        }
      ]
    },
    "4": {
      "title": "Thiếu số 4: Thiếu Kiên Trì & Kỷ Luật",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Biểu hiện:</strong> Bạn rất ghét sự gò bó, làm việc hay tùy hứng và dễ bỏ cuộc khi thấy chán. Cuộc sống của bạn đôi khi hơi lộn xộn, thiếu kế hoạch. Bạn thường có nhiều ý tưởng nhưng lại lười bắt tay vào làm chi tiết.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Lời khuyên rèn luyện:</strong> Chìa khóa thành công của bạn là \"Kỷ luật\". Hãy tập thói quen ngăn nắp từ việc dọn phòng, đi làm đúng giờ. Khi bắt đầu làm gì, hãy cố gắng làm cho tới cùng. Xây dựng một nền tảng vững chắc quan trọng hơn là chạy theo những thứ phù phiếm.</p>"
        }
      ]
    },
    "5": {
      "title": "Thiếu số 5: Ngại Thay Đổi & Khép Kín",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Biểu hiện:</strong> Bạn thích sự an toàn, quen thuộc và rất sợ những biến động bất ngờ. Bạn ít khi dám mạo hiểm hay thử nghiệm những điều mới lạ. Đôi khi bạn sống hơi khép kín và ngại giao tiếp rộng rãi.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Lời khuyên rèn luyện:</strong> Hãy can đảm bước ra khỏi vùng an toàn. Thử đi một con đường khác để về nhà, ăn một món chưa từng ăn, hoặc bắt chuyện với một người lạ. Sự linh hoạt và trải nghiệm sẽ mang lại cho bạn sự tự do và nhiều cơ hội bất ngờ.</p>"
        }
      ]
    },
    "6": {
      "title": "Thiếu số 6: Thiếu Kết Nối Với Gia Đình",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Biểu hiện:</strong> Bạn có thể hơi vô tâm, ít thể hiện tình cảm với người thân hoặc cảm thấy trách nhiệm gia đình là một gánh nặng. Bạn ưu tiên tự do cá nhân hơn là sự cam kết gắn bó lâu dài.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Lời khuyên rèn luyện:</strong> Hãy dành nhiều thời gian chất lượng hơn cho gia đình. Một lời hỏi thăm, một bữa cơm chung hay một sự quan tâm chân thành là điều bạn cần thực hành. Học cách yêu thương và chăm sóc người khác sẽ giúp trái tim bạn ấm áp hơn.</p>"
        }
      ]
    },
    "7": {
      "title": "Thiếu số 7: Thiếu Chiều Sâu & Đức Tin",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Biểu hiện:</strong> Bạn hay nhìn đời hời hợt, tin vào bề nổi mà ít khi tìm hiểu bản chất. Khi gặp khó khăn, bạn dễ hoang mang vì thiếu một chỗ dựa tinh thần (đức tin) vững chắc. Bạn có thể hơi ngây thơ hoặc thiếu sự chiêm nghiệm.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Lời khuyên rèn luyện:</strong> Hãy dành những khoảng lặng trong ngày để suy ngẫm về bản thân. Đọc sách, tìm hiểu kiến thức mới hoặc tiếp cận với thiền định/tôn giáo sẽ giúp bạn có cái nhìn sâu sắc hơn. Đừng chỉ tin vào những gì mắt thấy, hãy tin vào cảm nhận bên trong.</p>"
        }
      ]
    },
    "8": {
      "title": "Thiếu số 8: Quản Lý Tài Chính Kém",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Biểu hiện:</strong> Bạn thường gặp rắc rối với tiền bạc: hoặc là không biết cách giữ tiền, hoặc là thiếu động lực kiếm tiền. Bạn có thể hơi thiếu thực tế, thiếu sự quyết đoán cần thiết để thăng tiến trong sự nghiệp.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Lời khuyên rèn luyện:</strong> Hãy học cách quản lý chi tiêu và thiết lập mục tiêu tài chính rõ ràng. Đừng ngại nói về tiền bạc hay quyền lợi. Rèn luyện sự dứt khoát và bản lĩnh trong công việc sẽ giúp bạn làm chủ cuộc sống tốt hơn.</p>"
        }
      ]
    },
    "9": {
      "title": "Thiếu số 9: Thiếu Lòng Bao Dung",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Biểu hiện:</strong> Đôi khi bạn sống hơi thực dụng, tính toán chi li và chỉ quan tâm đến lợi ích của mình. Bạn khó tha thứ cho lỗi lầm của người khác hoặc thờ ơ trước những hoàn cảnh khó khăn xung quanh.</p>"
        },
        {
          "type": "text",
          "content": "<p><strong>Lời khuyên rèn luyện:</strong> Hãy mở rộng lòng mình ra một chút. Thử tham gia một hoạt động thiện nguyện hoặc đơn giản là giúp đỡ ai đó không toan tính. Học cách tha thứ và bao dung là bài học lớn nhất để bạn tìm thấy sự bình yên.</p>"
        }
      ]
    }
  },

  "personalityChart": {
    "title": "Biểu đồ Tính Cách",
    "intro": "Dưới đây là mức độ ảnh hưởng của các nhóm tính cách lên con người bạn, tiết lộ cách bạn tương tác với thế giới:",
    "meanings": {
      "1": {
        "blocks": [
          {
            "type": "text",
            "content": "<p><strong>Tính cách nổi bật: Mạnh mẽ - Độc lập - Tự tin</strong><br>Bạn mang năng lượng của một người tiên phong. Trong mắt người khác, bạn là một cá thể riêng biệt, không hòa tan vào đám đông. Bạn toát lên khí chất của một người dám nghĩ dám làm và không ngại đương đầu với thử thách.</p>"
          },
          {
            "type": "list",
            "items": [
              "Có tư duy độc lập, không thích dựa dẫm vào người khác.",
              "Quyết đoán trong hành động, có tố chất lãnh đạo bẩm sinh.",
              "Luôn đặt tiêu chuẩn cao cho bản thân và khao khát vị trí dẫn đầu.",
              "Thẳng thắn, bộc trực và ghét sự vòng vo."
            ]
          }
        ]
      },
      "2": {
        "blocks": [
          {
            "type": "text",
            "content": "<p><strong>Tính cách nổi bật: Lắng nghe - Khéo léo - Nhạy cảm</strong><br>Bạn là hiện thân của sự hòa bình và kết nối. Tính cách của bạn mềm mại như nước, biết cách len lỏi và xoa dịu những căng thẳng xung quanh. Bạn sở hữu trực giác tuyệt vời về cảm xúc con người.</p>"
          },
          {
            "type": "list",
            "items": [
              "Khả năng thấu cảm cao, luôn biết lắng nghe và chia sẻ.",
              "Tinh tế trong giao tiếp, rất giỏi ngoại giao và giữ hòa khí.",
              "Thích sự hợp tác, làm việc nhóm hơn là tranh đấu cá nhân.",
              "Nhạy cảm với môi trường xung quanh, dễ bị ảnh hưởng bởi cảm xúc người khác."
            ]
          }
        ]
      },
      "3": {
        "blocks": [
          {
            "type": "text",
            "content": "<p><strong>Tính cách nổi bật: Sáng tạo - Hoạt bát - Lạc quan</strong><br>Bạn là \"vitamin vui vẻ\" của mọi người. Năng lượng của bạn rực rỡ và đầy màu sắc. Bạn có khả năng biến những điều tẻ nhạt trở nên thú vị thông qua lăng kính sáng tạo và khiếu hài hước của mình.</p>"
          },
          {
            "type": "list",
            "items": [
              "Giao tiếp cuốn hút, có khiếu ăn nói và diễn đạt ý tưởng.",
              "Giàu trí tưởng tượng, luôn có những giải pháp độc đáo.",
              "Lạc quan, yêu đời và thích lan tỏa năng lượng tích cực.",
              "Thích được chú ý, tỏa sáng và thể hiện bản thân."
            ]
          }
        ]
      },
      "4": {
        "blocks": [
          {
            "type": "text",
            "content": "<p><strong>Tính cách nổi bật: Cẩn thận - Cầu toàn - Thực tế</strong><br>Bạn là mẫu người của sự vững chãi và tin cậy. Tính cách của bạn được xây dựng trên nền tảng của kỷ luật và trật tự. Bạn không tin vào may mắn, bạn tin vào sự chuẩn bị kỹ lưỡng và nỗ lực bền bỉ.</p>"
          },
          {
            "type": "list",
            "items": [
              "Làm việc có kế hoạch, quy trình rõ ràng và chi tiết.",
              "Cẩn trọng, tỉ mỉ, hiếm khi để xảy ra sai sót nhỏ.",
              "Trung thực, thẳng thắn và giữ chữ tín hàng đầu.",
              "Là chỗ dựa vững chắc cho người khác khi gặp khó khăn."
            ]
          }
        ]
      },
      "5": {
        "blocks": [
          {
            "type": "text",
            "content": "<p><strong>Tính cách nổi bật: Năng động - Linh hoạt - Tò mò</strong><br>Bạn là một linh hồn tự do, khao khát khám phá thế giới. Bạn giống như một chú tắc kè hoa, có thể thích nghi với mọi hoàn cảnh. Sự tò mò thúc đẩy bạn không ngừng tìm kiếm những trải nghiệm mới mẻ.</p>"
          },
          {
            "type": "list",
            "items": [
              "Yêu tự do, ghét sự gò bó và những lề thói cũ kỹ.",
              "Đa tài, tháo vát và phản ứng nhanh nhạy với các vấn đề.",
              "Có sức hút tự nhiên, lôi cuốn và dễ kết bạn.",
              "Thích đi du lịch, mạo hiểm và đổi mới không ngừng."
            ]
          }
        ]
      },
      "6": {
        "blocks": [
          {
            "type": "text",
            "content": "<p><strong>Tính cách nổi bật: Quan tâm - Yêu thương - Trách nhiệm</strong><br>Bạn mang trái tim của một người chăm sóc vĩ đại. Tính cách của bạn ấm áp, bao dung và luôn hướng về gia đình. Bạn hạnh phúc khi được bảo vệ và nuôi dưỡng những người mình yêu thương.</p>"
          },
          {
            "type": "list",
            "items": [
              "Sống có trách nhiệm, sẵn sàng hy sinh vì lợi ích chung.",
              "Giàu lòng trắc ẩn, luôn muốn che chở cho người yếu thế.",
              "Có gu thẩm mỹ tốt, yêu cái đẹp và sự hài hòa.",
              "Là \"tổ ấm\" bình yên mà mọi người muốn tìm về."
            ]
          }
        ]
      },
      "7": {
        "blocks": [
          {
            "type": "text",
            "content": "<p><strong>Tính cách nổi bật: Thông thái - Khám phá - Tri thức</strong><br>Bạn là người có chiều sâu nội tâm và tư duy sắc bén. Bạn không chấp nhận những câu trả lời hời hợt mà luôn muốn đào sâu tìm hiểu bản chất vấn đề. Bạn toát lên vẻ tri thức và có phần bí ẩn.</p>"
          },
          {
            "type": "list",
            "items": [
              "Thích quan sát, phân tích và chiêm nghiệm một mình.",
              "Có tư duy logic, khoa học và hoài nghi lành mạnh.",
              "Sở hữu trực giác tốt và đời sống tinh thần phong phú.",
              "Cầu toàn trong tri thức, luôn muốn học hỏi để hoàn thiện."
            ]
          }
        ]
      },
      "8": {
        "blocks": [
          {
            "type": "text",
            "content": "<p><strong>Tính cách nổi bật: Công bằng - Tập trung - Kỷ luật</strong><br>Bạn toát lên phong thái của một người thành đạt và quyền lực. Bạn có tư duy thực tế, hướng đến hiệu quả và kết quả rõ ràng. Tính cách của bạn mạnh mẽ, quyết đoán và sòng phẳng.</p>"
          },
          {
            "type": "list",
            "items": [
              "Có tham vọng lớn và năng lực hiện thực hóa mục tiêu.",
              "Giỏi quản lý, tổ chức và điều hành công việc.",
              "Rạch ròi giữa tình cảm và công việc, coi trọng sự công bằng.",
              "Có sức chịu đựng áp lực cao và ý chí kiên cường."
            ]
          }
        ]
      },
      "9": {
        "blocks": [
          {
            "type": "text",
            "content": "<p><strong>Tính cách nổi bật: Bao dung - Rộng lượng - Hào phóng</strong><br>Bạn có tâm hồn rộng mở và hướng thiện. Tính cách của bạn hào sảng, không toan tính chi li. Bạn thường nhìn cuộc đời qua lăng kính của tình yêu thương và những lý tưởng nhân văn cao đẹp.</p>"
          },
          {
            "type": "list",
            "items": [
              "Sẵn sàng cho đi và giúp đỡ cộng đồng không vụ lợi.",
              "Có cái nhìn bao quát, bỏ qua tiểu tiết để hướng tới đại cục.",
              "Thân thiện, hòa đồng và dễ dàng kết nối với mọi tầng lớp.",
              "Là người truyền cảm hứng sống đẹp cho người khác."
            ]
          }
        ]
      }
    }
  },

  "careerChart": {
    "title": "Định Hướng Nghề Nghiệp",
    "intro": "Dựa trên bộ số của bạn, dưới đây là phân tích mức độ phù hợp với các nhóm ngành nghề và môi trường làm việc lý tưởng:",
    "meanings": {
      "research": { 
        "title": "Nhóm Nghiên Cứu & Tư Duy (Investigative)",
        "blocks": [
          { "type": "text", "content": "<p><strong>Tố chất nổi bật:</strong> Bạn sở hữu tư duy logic sắc bén, khả năng phân tích sâu và sự tò mò vô tận về cách thế giới vận hành. Bạn thích làm việc với ý tưởng, dữ liệu và các vấn đề trừu tượng hơn là quản lý con người.</p>" },
          { 
            "type": "list", 
            "title": "Môi trường làm việc lý tưởng:",
            "items": [
               "Độc lập, yên tĩnh, ít bị làm phiền.",
               "Đề cao tri thức, sự thật và tính chính xác.",
               "Cho phép đào sâu nghiên cứu và giải quyết vấn đề hóc búa."
            ]
          },
          { 
            "type": "list", 
            "title": "Gợi ý nghề nghiệp:",
            "items": [
               "Công nghệ: Lập trình viên (IT), Kỹ sư phần mềm, Chuyên gia AI/Data.",
               "Khoa học: Bác sĩ, Dược sĩ, Nhà nghiên cứu sinh học/hóa học.",
               "Phân tích: Chuyên gia phân tích tài chính, Nghiên cứu thị trường."
            ]
          }
        ] 
      },
      "social": { 
        "title": "Nhóm Xã Hội & Kết Nối (Social)",
        "blocks": [
          { "type": "text", "content": "<p><strong>Tố chất nổi bật:</strong> Bạn là người hướng về con người. Bạn có khả năng thấu cảm, lắng nghe và khao khát được giúp đỡ, chữa lành hoặc giáo dục người khác. Bạn làm việc bằng trái tim và sự nhiệt huyết.</p>" },
          { 
            "type": "list", 
            "title": "Môi trường làm việc lý tưởng:",
            "items": [
               "Tương tác trực tiếp, giao tiếp thường xuyên.",
               "Mang tính nhân văn, hỗ trợ cộng đồng.",
               "Cởi mở, thân thiện và đề cao sự hợp tác."
            ]
          },
          { 
            "type": "list", 
            "title": "Gợi ý nghề nghiệp:",
            "items": [
               "Giáo dục: Giáo viên, Giảng viên, Huấn luyện viên (Coach).",
               "Chăm sóc sức khỏe: Bác sĩ tâm lý, Y tá, Điều dưỡng, Bác sĩ thú y.",
               "Dịch vụ: Công tác xã hội, Chăm sóc khách hàng, Tư vấn viên, Hướng dẫn viên du lịch."
            ]
          }
        ] 
      },
      "technical": { 
        "title": "Nhóm Kỹ Thuật & Thực Tiễn (Realistic)",
        "blocks": [
          { "type": "text", "content": "<p><strong>Tố chất nổi bật:</strong> Bạn là người thực tế, thích hành động và muốn nhìn thấy kết quả hữu hình. Bạn khéo léo trong việc vận hành máy móc, công cụ hoặc làm việc ngoài trời. Bạn thích \"làm\" hơn là \"nói\".</p>" },
          { 
            "type": "list", 
            "title": "Môi trường làm việc lý tưởng:",
            "items": [
               "Cụ thể, rõ ràng, ít mơ hồ.",
               "Liên quan đến vận động, máy móc hoặc thiên nhiên.",
               "Đánh giá dựa trên sản phẩm hoặc kết quả thực tế."
            ]
          },
          { 
            "type": "list", 
            "title": "Gợi ý nghề nghiệp:",
            "items": [
               "Kỹ thuật: Kỹ sư cơ khí, điện tử, xây dựng, kiến trúc sư.",
               "Vận hành: Phi công, Thuyền trưởng, Lái xe chuyên nghiệp.",
               "Thủ công/Nông nghiệp: Đầu bếp, Thợ lành nghề, Nông nghiệp công nghệ cao."
            ]
          }
        ] 
      },
      "artistic": { 
        "title": "Nhóm Nghệ Thuật & Sáng Tạo (Artistic)",
        "blocks": [
          { "type": "text", "content": "<p><strong>Tố chất nổi bật:</strong> Bạn có tâm hồn tự do, giàu trí tưởng tượng và nhạy cảm với cái đẹp. Bạn không chịu được sự gò bó hay những công việc lặp đi lặp lại nhàm chán. Sứ mệnh của bạn là tạo ra cái mới và truyền cảm hứng.</p>" },
          { 
            "type": "list", 
            "title": "Môi trường làm việc lý tưởng:",
            "items": [
               "Tự do, linh hoạt về thời gian và không gian.",
               "Khuyến khích sự phá cách và thể hiện cá tôi.",
               "Đề cao tính thẩm mỹ và cảm xúc."
            ]
          },
          { 
            "type": "list", 
            "title": "Gợi ý nghề nghiệp:",
            "items": [
               "Sáng tạo: Thiết kế đồ họa/thời trang, Kiến trúc sư nội thất.",
               "Truyền thông: Nhà văn, Biên kịch, Content Creator, Đạo diễn.",
               "Nghệ thuật biểu diễn: Diễn viên, Ca sĩ, Nhạc sĩ, Nhiếp ảnh gia."
            ]
          }
        ] 
      },
      "management": { 
        "title": "Nhóm Quản Lý & Dẫn Dắt (Enterprising)",
        "blocks": [
          { "type": "text", "content": "<p><strong>Tố chất nổi bật:</strong> Bạn sinh ra để dẫn đầu. Bạn có tham vọng, sự tự tin và khả năng thuyết phục người khác đi theo tầm nhìn của mình. Bạn thích cạnh tranh, chinh phục mục tiêu và quản lý rủi ro.</p>" },
          { 
            "type": "list", 
            "title": "Môi trường làm việc lý tưởng:",
            "items": [
               "Năng động, cạnh tranh và nhiều thách thức.",
               "Có cơ hội thăng tiến và quyền lực rõ ràng.",
               "Đánh giá dựa trên hiệu suất và lợi nhuận."
            ]
          },
          { 
            "type": "list", 
            "title": "Gợi ý nghề nghiệp:",
            "items": [
               "Lãnh đạo: CEO, Giám đốc điều hành, Quản lý dự án.",
               "Kinh doanh: Sales manager, Bất động sản, Khởi nghiệp (Startup).",
               "Pháp lý/Chính trị: Luật sư, Chính trị gia, Quan hệ công chúng (PR)."
            ]
          }
        ] 
      },
      "business": { 
        "title": "Nhóm Nghiệp Vụ & Tổ Chức (Conventional)",
        "blocks": [
          { "type": "text", "content": "<p><strong>Tố chất nổi bật:</strong> Bạn là người ngăn nắp, tỉ mỉ và tôn trọng quy tắc. Bạn làm việc hiệu quả nhất khi có quy trình rõ ràng. Bạn là \"hậu phương vững chắc\" giúp mọi tổ chức vận hành trơn tru và chính xác.</p>" },
          { 
            "type": "list", 
            "title": "Môi trường làm việc lý tưởng:",
            "items": [
               "Ổn định, có trật tự và cấu trúc rõ ràng.",
               "Làm việc với số liệu, hồ sơ và văn bản.",
               "Đề cao sự chính xác, trung thực và cẩn trọng."
            ]
          },
          { 
            "type": "list", 
            "title": "Gợi ý nghề nghiệp:",
            "items": [
               "Tài chính: Kế toán, Kiểm toán, Ngân hàng, Thuế.",
               "Hành chính: Quản trị văn phòng, Thư ký, Nhân sự (C&B).",
               "Quản lý hệ thống: Thủ thư, Quản lý kho, Kiểm soát chất lượng (QC)."
            ]
          }
        ] 
      }
    }
  },

  "personalYear": {
    "1": {
      "title": "Năm Cá Nhân Số 1 - Gieo Hạt & Khởi Đầu Mới",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Đây là cột mốc mở đầu cho một chu kỳ 9 năm hoàn toàn mới. Mọi thứ cũ kỹ của chu kỳ trước đã khép lại, và đây là thời điểm giống như một hạt mầm vừa tách vỏ. Giai đoạn này tràn đầy năng lượng của sự độc lập, tự chủ và tiên phong. Những gì được gieo trồng trong năm số 1 sẽ quyết định hoa trái gặt hái trong 8 năm tiếp theo.</p>"
        },
        {
          "type": "text",
          "title": "Về Công việc",
          "content": "<p>Thời điểm vàng để bắt đầu những dự án mới, khởi nghiệp hoặc thay đổi công việc nếu đã ấp ủ từ lâu. Nguồn năng lượng lãnh đạo sẽ trỗi dậy mạnh mẽ. Đừng chờ đợi cơ hội, hãy tự tạo ra nó. Cần sự quyết đoán và dám chấp nhận rủi ro để bứt phá trong giai đoạn này.</p>"
        },
        {
          "type": "text",
          "title": "Về Tài chính",
          "content": "<p>Tài chính có thể chưa bùng nổ ngay lập tức vì đây là giai đoạn \"đầu tư\" và \"gieo hạt\". Tuy nhiên, các dòng tiền mới sẽ bắt đầu xuất hiện. Hãy mạnh dạn đầu tư vào bản thân hoặc các công cụ hỗ trợ công việc.</p>"
        },
        {
          "type": "text",
          "title": "Về Các mối quan hệ",
          "content": "<p>Xu hướng tập trung vào bản thân nhiều hơn có thể tạo ra sự xa cách hoặc cảm giác độc đoán trong mắt người thân. Nếu độc thân, đây là thời điểm dễ gặp những mối duyên mới đầy bất ngờ. Nếu đã có đôi, cần cẩn thận cái tôi quá lớn gây mâu thuẫn.</p>"
        },
        {
          "type": "text",
          "title": "Về Sức khỏe",
          "content": "<p>Năng lượng rất dồi dào, nhưng việc khởi động quá nhiều dự án mới dễ dẫn đến căng thẳng thần kinh hoặc các vấn đề về đầu, mắt. Cần duy trì thói quen tập thể dục đều đặn để giải phóng năng lượng dư thừa.</p>"
        },
        {
          "type": "text",
          "title": "Về Học tập & Thi cử",
          "content": "<p>Cực kỳ thuận lợi để học một kỹ năng hoàn toàn mới hoặc bắt đầu một lộ trình học tập dài hạn. Sự tập trung và ý chí đang ở mức cao, giúp việc tiếp thu kiến thức nhanh chóng và vượt qua các kỳ thi một cách độc lập.</p>"
        },
        {
          "type": "list",
          "title": "Kế hoạch cần chuẩn bị:",
          "items": [
            "Viết ra mục tiêu chi tiết cho 9 năm tới (Vision Board).",
            "Dám nói \"Có\" với những cơ hội mới.",
            "Thay đổi ngoại hình hoặc phong cách để làm mới bản thân.",
            "Rèn luyện sự tự tin và kỹ năng ra quyết định."
          ]
        },
        {
          "type": "quote",
          "content": "Tóm lại: Năm số 1 là năm của hành động. Đừng chần chừ, đừng nhìn lại quá khứ. Hãy cầm lái cuộc đời mình và đạp ga tiến về phía trước."
        }
      ]
    },
    "2": {
      "title": "Năm Cá Nhân Số 2 - Kết Nối & Kiên Nhẫn",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Sau sự khởi đầu mạnh mẽ của năm số 1, năm cá nhân số 2 là lúc mọi thứ chậm lại để đi vào chiều sâu. Đây là giai đoạn của sự ươm mầm, hợp tác và phát triển các mối quan hệ. Từ khóa chính là \"Kiên nhẫn\" và \"Lắng nghe\". Mọi thứ sẽ không diễn ra nhanh chóng, nhưng đang âm thầm phát triển dưới lòng đất.</p>"
        },
        {
          "type": "text",
          "title": "Về Công việc",
          "content": "<p>Thành công trong giai đoạn này đến từ việc làm việc nhóm (teamwork) và ngoại giao khéo léo. Đây không phải lúc để làm \"sói đơn độc\". Hãy chú trọng đến các chi tiết nhỏ và hỗ trợ đồng nghiệp. Sự mềm mỏng sẽ mang lại lợi thế lớn hơn là sự áp đặt.</p>"
        },
        {
          "type": "text",
          "title": "Về Tài chính",
          "content": "<p>Thu nhập có xu hướng ổn định nhưng không có nhiều biến động lớn. Dòng tiền có thể đến từ các hoạt động hợp tác hoặc đầu tư chung. Cần cẩn trọng và tỉ mỉ trong các hợp đồng, giấy tờ ký kết.</p>"
        },
        {
          "type": "text",
          "title": "Về Các mối quan hệ",
          "content": "<p>Đây là trọng tâm của năm số 2. Các mối quan hệ tình cảm sẽ được thử thách hoặc thăng hoa. Nếu độc thân, rất dễ tìm được tri kỷ. Nếu đang có mâu thuẫn, đây là thời điểm tốt nhất để hòa giải và chữa lành.</p>"
        },
        {
          "type": "text",
          "title": "Về Sức khỏe",
          "content": "<p>Hệ thần kinh và tiêu hóa có thể nhạy cảm hơn bình thường do cảm xúc dao động. Cần chú ý giữ tinh thần thư thái, tránh lo âu thái quá. Các hoạt động như thiền, yoga rất phù hợp trong thời gian này.</p>"
        },
        {
          "type": "text",
          "title": "Về Học tập & Thi cử",
          "content": "<p>Thích hợp cho việc học nhóm hoặc nghiên cứu các môn liên quan đến tâm lý, nghệ thuật, xã hội học. Trực giác nhạy bén giúp việc cảm thụ kiến thức trở nên sâu sắc hơn.</p>"
        },
        {
          "type": "list",
          "title": "Kế hoạch cần chuẩn bị:",
          "items": [
            "Mở rộng mạng lưới quan hệ (networking).",
            "Học cách kiểm soát cảm xúc và lắng nghe.",
            "Giải quyết các mâu thuẫn cũ còn tồn đọng.",
            "Tìm kiếm đối tác hoặc người đồng hành tin cậy."
          ]
        },
        {
          "type": "quote",
          "content": "Tóm lại: Đừng nóng vội khi thấy mọi việc tiến triển chậm. Hãy tận dụng thời gian này để xây dựng những kết nối bền vững. Sức mạnh của bạn nằm ở sự mềm mỏng."
        }
      ]
    },
    "3": {
      "title": "Năm Cá Nhân Số 3 - Sáng Tạo & Tỏa Sáng",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Năng lượng của năm số 3 mang đến sự vui tươi, sáng tạo và bùng nổ. Đây là lúc những hạt mầm bắt đầu vươn lên mặt đất và đón ánh nắng. Giai đoạn này cuộc sống xã hội sẽ rất sôi động, trí não được kích thích và nhu cầu thể hiện bản thân tăng cao.</p>"
        },
        {
          "type": "text",
          "title": "Về Công việc",
          "content": "<p>Cơ hội tuyệt vời để thực hiện các ý tưởng sáng tạo, marketing, xây dựng thương hiệu cá nhân hoặc các công việc liên quan đến nói và viết. Tuy nhiên, cần tránh sự phân tán năng lượng, làm nhiều việc cùng lúc nhưng không việc nào tới nơi tới chốn.</p>"
        },
        {
          "type": "text",
          "title": "Về Tài chính",
          "content": "<p>Tiền bạc có thể đến nhanh nhờ các cơ hội bất ngờ, nhưng cũng dễ \"đội nón ra đi\" vì thói quen chi tiêu theo cảm hứng hoặc mua sắm xa xỉ để làm đẹp hình ảnh. Cần quản lý túi tiền chặt chẽ hơn.</p>"
        },
        {
          "type": "text",
          "title": "Về Các mối quan hệ",
          "content": "<p>Bạn sẽ trở nên thu hút và quyến rũ hơn trong mắt người khác. Các mối quan hệ bạn bè mở rộng, nhiều tiệc tùng và giao lưu. Tuy nhiên, coi chừng những mối quan hệ hời hợt hoặc thị phi từ lời ăn tiếng nói.</p>"
        },
        {
          "type": "text",
          "title": "Về Sức khỏe",
          "content": "<p>Năng lượng tích cực giúp sức khỏe khá tốt, nhưng cần chú ý đến cân nặng (do tiệc tùng nhiều) và các vấn đề về họng, thanh quản. Tránh làm việc quá sức dẫn đến kiệt quệ năng lượng.</p>"
        },
        {
          "type": "text",
          "title": "Về Học tập & Thi cử",
          "content": "<p>Tư duy nhanh nhạy giúp việc học ngoại ngữ, nghệ thuật hoặc các môn xã hội rất thuận lợi. Tuy nhiên, sự thiếu tập trung có thể là rào cản lớn nhất trong các kỳ thi quan trọng.</p>"
        },
        {
          "type": "list",
          "title": "Kế hoạch cần chuẩn bị:",
          "items": [
            "Đăng ký một khóa học nghệ thuật hoặc kỹ năng nói.",
            "Lên kế hoạch du lịch hoặc giải trí để tái tạo năng lượng.",
            "Xây dựng hình ảnh cá nhân chuyên nghiệp hơn.",
            "Rèn luyện sự tập trung, tránh \"cả thèm chóng chán\"."
          ]
        },
        {
          "type": "quote",
          "content": "Tóm lại: Hãy cứ tỏa sáng và tận hưởng niềm vui, nhưng đừng quên giữ đôi chân trên mặt đất. Sáng tạo có kỷ luật mới mang lại thành công thực sự."
        }
      ]
    },
    "4": {
      "title": "Năm Cá Nhân Số 4 - Củng Cố & Kỷ Luật",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Sau một năm số 3 bay bổng, năm cá nhân số 4 yêu cầu sự nghiêm túc quay trở lại. Đây là giai đoạn của việc \"làm móng nhà\". Mọi thứ cần được sắp xếp lại trật tự, ngăn nắp và thực tế. Không có chỗ cho sự lười biếng hay mơ mộng trong thời điểm này.</p>"
        },
        {
          "type": "text",
          "title": "Về Công việc",
          "content": "<p>Khối lượng công việc sẽ tăng lên đáng kể, đòi hỏi sự chăm chỉ và chi tiết. Đây là lúc để xây dựng quy trình, củng cố chuyên môn và làm những việc nền tảng. Kết quả có thể không đến nhanh, nhưng sẽ rất bền vững.</p>"
        },
        {
          "type": "text",
          "title": "Về Tài chính",
          "content": "<p>Thích hợp để tích lũy, tiết kiệm và đầu tư vào các tài sản cố định (nhà đất, cơ sở vật chất). Tránh các khoản đầu tư mạo hiểm hay lướt sóng. Cần lập kế hoạch chi tiêu rõ ràng và thắt chặt hầu bao.</p>"
        },
        {
          "type": "text",
          "title": "Về Các mối quan hệ",
          "content": "<p>Các mối quan hệ mang tính cam kết lâu dài và trách nhiệm sẽ được ưu tiên. Đây không phải năm của sự lãng mạn bay bổng mà là năm của sự đồng cam cộng khổ, cùng nhau xây dựng tương lai.</p>"
        },
        {
          "type": "text",
          "title": "Về Sức khỏe",
          "content": "<p>Cần đặc biệt chú ý đến xương khớp, răng và dạ dày. Áp lực công việc có thể gây mệt mỏi thể chất. Việc duy trì chế độ ăn ngủ điều độ và tập thể dục là bắt buộc để duy trì sức bền.</p>"
        },
        {
          "type": "text",
          "title": "Về Học tập & Thi cử",
          "content": "<p>Rất tốt cho việc học chuyên sâu, lấy chứng chỉ nghề hoặc các môn kỹ thuật, logic. Sự kiên trì và kỷ luật trong giai đoạn này sẽ giúp vượt qua các kỳ thi khó khăn nhất.</p>"
        },
        {
          "type": "list",
          "title": "Kế hoạch cần chuẩn bị:",
          "items": [
            "Lập kế hoạch tài chính và tiết kiệm dài hạn.",
            "Kiểm tra sức khỏe tổng quát định kỳ.",
            "Dọn dẹp, sửa sang nhà cửa hoặc không gian làm việc.",
            "Học thêm các kỹ năng chuyên môn sâu."
          ]
        },
        {
          "type": "quote",
          "content": "Tóm lại: Đừng ngại vất vả. Những giọt mồ hôi đổ xuống trong năm số 4 sẽ hóa thành nền móng vững chắc cho thành công của bạn sau này."
        }
      ]
    },
    "5": {
      "title": "Năm Cá Nhân Số 5 - Thay Đổi & Tự Do",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Nằm ở giữa chu kỳ 9 năm, năm số 5 mang đến làn gió của sự thay đổi và bứt phá. Những trật tự cũ của năm số 4 có thể bị phá vỡ để nhường chỗ cho những cơ hội mới. Đây là năm của sự dịch chuyển, tự do và những bất ngờ không báo trước.</p>"
        },
        {
          "type": "text",
          "title": "Về Công việc",
          "content": "<p>Có thể có sự thay đổi về vị trí, công ty hoặc hướng đi mới. Các cơ hội kinh doanh, mở rộng thị trường hoặc đi công tác xa sẽ xuất hiện nhiều. Cần sự linh hoạt và khả năng thích nghi cao độ để nắm bắt thời cơ.</p>"
        },
        {
          "type": "text",
          "title": "Về Tài chính",
          "content": "<p>Dòng tiền biến động mạnh, có thể thu vào nhiều nhưng chi ra cũng lắm. Cơ hội kiếm tiền đến từ sự mạo hiểm hoặc các ý tưởng đột phá. Tuy nhiên, cần cảnh giác với các rủi ro tài chính quá lớn.</p>"
        },
        {
          "type": "text",
          "title": "Về Các mối quan hệ",
          "content": "<p>Bạn sẽ muốn thoát khỏi những ràng buộc ngột ngạt. Các mối quan hệ mới đến rất nhanh và thú vị, nhưng có thể thiếu tính cam kết bền vững. Dễ xảy ra những rung động nhất thời.</p>"
        },
        {
          "type": "text",
          "title": "Về Sức khỏe",
          "content": "<p>Cần cẩn thận khi đi lại, di chuyển để tránh tai nạn nhỏ do bất cẩn. Hệ thần kinh có thể bị căng thẳng do quá nhiều thay đổi diễn ra cùng lúc. Nên chú ý giấc ngủ.</p>"
        },
        {
          "type": "text",
          "title": "Về Học tập & Thi cử",
          "content": "<p>Thích hợp học các khóa ngắn hạn, ngôn ngữ mới hoặc các kỹ năng mềm. Khó tập trung vào các môn học đòi hỏi sự kiên nhẫn quá lâu. Sự tò mò sẽ là động lực học tập chính.</p>"
        },
        {
          "type": "list",
          "title": "Kế hoạch cần chuẩn bị:",
          "items": [
            "Sẵn sàng tâm thế đón nhận sự thay đổi bất ngờ.",
            "Lên kế hoạch cho các chuyến đi du lịch, trải nghiệm.",
            "Mở rộng giao lưu kết nối xã hội.",
            "Học cách quản trị rủi ro."
          ]
        },
        {
          "type": "quote",
          "content": "Tóm lại: Hãy dang rộng cánh tay đón nhận những cơn gió lạ. Đừng cố kiểm soát mọi thứ, hãy học cách lướt trên những con sóng thay đổi."
        }
      ]
    },
    "6": {
      "title": "Năm Cá Nhân Số 6 - Trách Nhiệm & Yêu Thương",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Sau một năm số 5 bay nhảy, năm số 6 gọi bạn trở về với tổ ấm. Trọng tâm của giai đoạn này là Gia đình, Trách nhiệm và Tình yêu thương. Bạn sẽ thấy mình cần quan tâm chăm sóc người khác nhiều hơn và giải quyết các vấn đề nội bộ.</p>"
        },
        {
          "type": "text",
          "title": "Về Công việc",
          "content": "<p>Công việc thường gắn liền với trách nhiệm tập thể hoặc các dự án mang tính cộng đồng, chăm sóc khách hàng. Sự thăng tiến đến từ việc bạn gánh vác trách nhiệm và được mọi người tin tưởng. Tuy nhiên, đừng ôm đồm quá mức.</p>"
        },
        {
          "type": "text",
          "title": "Về Tài chính",
          "content": "<p>Tiền bạc thường được chi tiêu cho gia đình, sửa sang nhà cửa hoặc đầu tư cho giáo dục con cái. Tài chính khá ổn định nếu bạn biết cân đối giữa thu và chi cho người thân.</p>"
        },
        {
          "type": "text",
          "title": "Về Các mối quan hệ",
          "content": "<p>Năm thuận lợi cho việc kết hôn, sinh con hoặc hàn gắn các mối quan hệ rạn nứt. Tình cảm gia đình đi vào chiều sâu. Nếu có mâu thuẫn, đây là lúc bạn cần đứng ra hòa giải bằng sự bao dung.</p>"
        },
        {
          "type": "text",
          "title": "Về Sức khỏe",
          "content": "<p>Chú ý các bệnh liên quan đến tim mạch, phổi hoặc các vấn đề do lo lắng quá nhiều sinh ra. Cần chăm sóc bản thân mình tốt như cách bạn chăm sóc người khác.</p>"
        },
        {
          "type": "text",
          "title": "Về Học tập & Thi cử",
          "content": "<p>Thuận lợi cho việc học các ngành liên quan đến giáo dục, y tế, nghệ thuật hoặc tâm lý. Động lực học tập thường xuất phát từ mong muốn giúp đỡ người khác.</p>"
        },
        {
          "type": "list",
          "title": "Kế hoạch cần chuẩn bị:",
          "items": [
            "Dành thời gian chất lượng cho gia đình.",
            "Trang trí, sửa sang lại không gian sống.",
            "Học cách nói lời từ chối để tránh bị lợi dụng lòng tốt.",
            "Chăm sóc sức khỏe cho cha mẹ/con cái."
          ]
        },
        {
          "type": "quote",
          "content": "Tóm lại: Hạnh phúc nằm ngay dưới mái nhà của bạn. Hãy yêu thương và gánh vác, nhưng đừng quên yêu thương chính bản thân mình."
        }
      ]
    },
    "7": {
      "title": "Năm Cá Nhân Số 7 - Chiêm Nghiệm & Nội Tâm",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Đây là \"khoảng lặng\" cần thiết trong chu kỳ 9 năm. Năm số 7 hướng năng lượng vào bên trong để chiêm nghiệm, học hỏi và rà soát lại hành trình đã qua. Bạn có thể cảm thấy muốn tách biệt, thích sự riêng tư hơn là ồn ào náo nhiệt.</p>"
        },
        {
          "type": "text",
          "title": "Về Công việc",
          "content": "<p>Thích hợp cho việc nghiên cứu, phân tích, lên kế hoạch chiến lược hoặc viết lách. Tiến độ công việc bên ngoài có thể chậm lại, nhưng sự phát triển về tư duy và kỹ năng chuyên môn lại tăng vọt.</p>"
        },
        {
          "type": "text",
          "title": "Về Tài chính",
          "content": "<p>Không phải là năm thuận lợi để đầu tư mạo hiểm hay mong cầu lợi nhuận nhanh chóng. Tài chính nên giữ ở mức an toàn. Đầu tư tốt nhất trong năm nay là đầu tư vào tri thức và trí tuệ.</p>"
        },
        {
          "type": "text",
          "title": "Về Các mối quan hệ",
          "content": "<p>Có thể xuất hiện cảm giác cô đơn hoặc bị người khác hiểu lầm là lạnh lùng. Các mối quan hệ xã giao sẽ được lọc bớt, chỉ giữ lại những kết nối thực sự sâu sắc và ý nghĩa.</p>"
        },
        {
          "type": "text",
          "title": "Về Sức khỏe",
          "content": "<p>Sức khỏe tinh thần là ưu tiên hàng đầu. Dễ bị stress, mất ngủ hoặc đau đầu do suy nghĩ quá nhiều. Cần kết nối với thiên nhiên, thiền định để cân bằng năng lượng.</p>"
        },
        {
          "type": "text",
          "title": "Về Học tập & Thi cử",
          "content": "<p>Năm tuyệt vời nhất cho việc học chuyên sâu, nghiên cứu khoa học hoặc tìm hiểu về triết học/tâm linh. Khả năng tập trung và phân tích đạt đỉnh cao.</p>"
        },
        {
          "type": "list",
          "title": "Kế hoạch cần chuẩn bị:",
          "items": [
            "Dành thời gian tĩnh lặng mỗi ngày (thiền, đọc sách).",
            "Tham gia một khóa học chuyên sâu nâng cao tay nghề.",
            "Hạn chế các quyết định lớn về vật chất nếu chưa chắc chắn.",
            "Kết nối với thiên nhiên để chữa lành."
          ]
        },
        {
          "type": "quote",
          "content": "Tóm lại: Đừng sợ sự cô đơn, đó là lúc bạn đối thoại với chính mình. Hãy mài sắc trí tuệ, vì đó là vũ khí cho sự bùng nổ ở năm sau."
        }
      ]
    },
    "8": {
      "title": "Năm Cá Nhân Số 8 - Thành Tựu & Quyền Lực",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Sau năm số 7 tích lũy nội lực, năm số 8 là lúc bạn bước ra ánh sáng để gặt hái thành quả. Đây là năm của quyền lực, tài chính và sự nghiệp. Luật Nhân Quả vận hành rất mạnh trong năm nay: bạn nỗ lực bao nhiêu sẽ nhận lại bấy nhiêu.</p>"
        },
        {
          "type": "text",
          "title": "Về Công việc",
          "content": "<p>Cơ hội thăng tiến, mở rộng quy mô kinh doanh hoặc nắm giữ trọng trách lớn sẽ đến. Đây là lúc để thể hiện bản lĩnh lãnh đạo và khả năng điều hành. Cần quyết đoán và tập trung cao độ vào mục tiêu.</p>"
        },
        {
          "type": "text",
          "title": "Về Tài chính",
          "content": "<p>Dòng tiền chảy về mạnh mẽ, thuận lợi cho việc mua bán tài sản lớn, đầu tư sinh lời. Tuy nhiên, cần quản lý tài chính minh bạch và hợp pháp, tránh tham lam kẻo gặp rắc rối pháp lý.</p>"
        },
        {
          "type": "text",
          "title": "Về Các mối quan hệ",
          "content": "<p>Các mối quan hệ mang tính hỗ trợ công việc, đối tác làm ăn sẽ được ưu tiên. Trong tình cảm, cần tránh sự áp đặt hoặc mang áp lực công việc về nhà. Có thể gặp được những người có địa vị giúp đỡ.</p>"
        },
        {
          "type": "text",
          "title": "Về Sức khỏe",
          "content": "<p>Dễ gặp các vấn đề liên quan đến huyết áp, tim mạch hoặc chấn thương do làm việc quá sức. Cần cân bằng giữa tham vọng sự nghiệp và thời gian nghỉ ngơi.</p>"
        },
        {
          "type": "text",
          "title": "Về Học tập & Thi cử",
          "content": "<p>Thích hợp học các ngành quản trị kinh doanh, tài chính, luật hoặc lãnh đạo. Các kỳ thi mang tính quyết định sự nghiệp thường đạt kết quả tốt nếu có sự chuẩn bị kỹ.</p>"
        },
        {
          "type": "list",
          "title": "Kế hoạch cần chuẩn bị:",
          "items": [
            "Đặt ra các mục tiêu tài chính tham vọng.",
            "Tận dụng tối đa các cơ hội kinh doanh.",
            "Xây dựng hình ảnh cá nhân uy quyền và chuyên nghiệp.",
            "Học cách quản lý và đầu tư tiền bạc."
          ]
        },
        {
          "type": "quote",
          "content": "Tóm lại: Thời cơ đã đến, hãy nắm bắt lấy. Nhưng hãy nhớ, thành công bền vững phải đi kèm với đạo đức và trách nhiệm."
        }
      ]
    },
    "9": {
      "title": "Năm Cá Nhân Số 9 - Hoàn Tất & Buông Bỏ",
      "blocks": [
        {
          "type": "text",
          "title": "Tổng quan",
          "content": "<p>Đây là năm cuối cùng của chu kỳ 9 năm, mang năng lượng của sự tổng kết, dọn dẹp và hoàn tất. Đây không phải lúc để bắt đầu những cái mới to tát, mà là lúc để loại bỏ những gì không còn phù hợp, trả nợ (cả tiền bạc lẫn ân tình) để nhẹ nhàng bước sang chu kỳ mới.</p>"
        },
        {
          "type": "text",
          "title": "Về Công việc",
          "content": "<p>Nên tập trung hoàn thành các dự án dang dở. Có thể có sự kết thúc một công việc cũ hoặc thay đổi môi trường. Đừng cố níu kéo những gì đã hết duyên. Hãy làm việc với tinh thần cống hiến và cho đi.</p>"
        },
        {
          "type": "text",
          "title": "Về Tài chính",
          "content": "<p>Tài chính nên được dùng để thanh toán các khoản nợ nần, làm từ thiện hoặc hỗ trợ người khác. Tránh đầu tư mạo hiểm hay ký kết các hợp đồng dài hạn mới trong giai đoạn này.</p>"
        },
        {
          "type": "text",
          "title": "Về Các mối quan hệ",
          "content": "<p>Sẽ có những cuộc chia ly cần thiết (với những người tiêu cực) và những cuộc hội ngộ đầy ý nghĩa. Lòng bao dung và tha thứ là chìa khóa để chữa lành các mối quan hệ trong năm nay.</p>"
        },
        {
          "type": "text",
          "title": "Về Sức khỏe",
          "content": "<p>Cần chú ý thải độc cơ thể và chăm sóc hệ miễn dịch. Sức khỏe tinh thần cần được vỗ về để tránh cảm giác hụt hẫng hay tiếc nuối quá khứ.</p>"
        },
        {
          "type": "text",
          "title": "Về Học tập & Thi cử",
          "content": "<p>Thích hợp để hoàn thành khóa học, tốt nghiệp hoặc tổng hợp kiến thức. Các môn học về xã hội, nhân văn hoặc nghệ thuật sẽ mang lại nhiều cảm hứng.</p>"
        },
        {
          "type": "list",
          "title": "Kế hoạch cần chuẩn bị:",
          "items": [
            "Dọn dẹp nhà cửa, vứt bỏ đồ đạc không dùng đến (Declutter).",
            "Tha thứ cho những người đã làm tổn thương mình.",
            "Hoàn thành mọi công việc còn tồn đọng.",
            "Làm từ thiện và chia sẻ với cộng đồng."
          ]
        },
        {
          "type": "quote",
          "content": "Tóm lại: Hãy dũng cảm buông tay những gì đã cũ. Một cánh cửa đóng lại là để một cánh cửa khác tốt đẹp hơn mở ra."
        }
      ]
    }
  },

  "personalMonth": {
    "1": {
      "title": "Tháng Cá Nhân Số 1 - Khởi Đầu & Quyết Đoán",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Năng lượng tháng này:</strong> Đây là thời điểm tuyệt vời để nhấn nút \"Start\". Năng lượng của số 1 thúc đẩy sự độc lập và tiên phong. Những gì bạn trì hoãn bấy lâu nay, hãy bắt đầu thực hiện ngay trong tháng này.</p>"
        },
        {
          "type": "list",
          "title": "Việc cần làm ngay:",
          "items": [
            "Bắt đầu một dự án mới hoặc một thói quen mới (tập gym, học ngoại ngữ...).",
            "Đưa ra các quyết định quan trọng mà bạn đã chần chừ.",
            "Thay đổi kiểu tóc hoặc phong cách ăn mặc để làm mới bản thân.",
            "Làm việc độc lập, tự mình giải quyết vấn đề thay vì nhờ vả."
          ]
        },
        {
          "type": "quote",
          "content": "Lời khuyên: Đừng sợ đi một mình. Sự tự tin của bạn là thỏi nam châm thu hút thành công trong tháng này."
        }
      ]
    },
    "2": {
      "title": "Tháng Cá Nhân Số 2 - Kết Nối & Lắng Nghe",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Năng lượng tháng này:</strong> Sau tháng 1 bùng nổ, tháng 2 là lúc mọi thứ chậm lại để đi vào chiều sâu. Đây là tháng của ngoại giao, tình cảm và sự hợp tác. Đừng cố gắng lấn lướt, hãy học cách lùi một bước để tiến hai bước.</p>"
        },
        {
          "type": "list",
          "title": "Việc cần làm ngay:",
          "items": [
            "Hẹn hò, gặp gỡ bạn bè hoặc đối tác để hàn gắn kết nối.",
            "Lắng nghe nhiều hơn nói trong các cuộc họp.",
            "Giải quyết các mâu thuẫn cũ bằng thái độ hòa giải.",
            "Chăm sóc các chi tiết nhỏ trong công việc mà tháng trước bạn đã bỏ qua."
          ]
        },
        {
          "type": "quote",
          "content": "Lời khuyên: Sự dịu dàng là vũ khí mạnh nhất của bạn lúc này. Hãy kiên nhẫn chờ đợi kết quả."
        }
      ]
    },
    "3": {
      "title": "Tháng Cá Nhân Số 3 - Sáng Tạo & Tỏa Sáng",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Năng lượng tháng này:</strong> Chào mừng bạn đến với tháng vui vẻ nhất! Năng lượng số 3 mang đến cảm hứng sáng tạo dồi dào và các cơ hội giao tiếp xã hội. Hãy bước ra ngoài, gặp gỡ mọi người và để bản thân được tỏa sáng.</p>"
        },
        {
          "type": "list",
          "title": "Việc cần làm ngay:",
          "items": [
            "Tham gia các bữa tiệc, sự kiện hoặc hội thảo networking.",
            "Viết lách, vẽ tranh, ca hát hoặc thực hiện các ý tưởng sáng tạo.",
            "Mua sắm quần áo mới hoặc làm đẹp cho bản thân.",
            "Cười nhiều hơn và chia sẻ niềm vui với mọi người."
          ]
        },
        {
          "type": "quote",
          "content": "Lời khuyên: Hãy cẩn thận lời ăn tiếng nói để tránh thị phi, và đừng chi tiêu quá đà cho những cuộc vui."
        }
      ]
    },
    "4": {
      "title": "Tháng Cá Nhân Số 4 - Củng Cố & Kỷ Luật",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Năng lượng tháng này:</strong> Đã đến lúc quay lại mặt đất. Tháng này đòi hỏi bạn phải làm việc chăm chỉ, tập trung vào chi tiết và sắp xếp lại cuộc sống ngăn nắp. Đây là tháng để xây dựng nền móng vững chắc.</p>"
        },
        {
          "type": "list",
          "title": "Việc cần làm ngay:",
          "items": [
            "Dọn dẹp nhà cửa, bàn làm việc và sắp xếp lại hồ sơ.",
            "Lập kế hoạch tài chính, rà soát lại các khoản chi tiêu.",
            "Hoàn thành các công việc tồn đọng đòi hỏi sự tỉ mỉ.",
            "Kiểm tra sức khỏe tổng quát hoặc sửa chữa đồ đạc hỏng hóc."
          ]
        },
        {
          "type": "quote",
          "content": "Lời khuyên: Đừng tìm kiếm đường tắt. Sự nỗ lực bền bỉ trong tháng này sẽ mang lại kết quả lâu dài."
        }
      ]
    },
    "5": {
      "title": "Tháng Cá Nhân Số 5 - Thay Đổi & Tự Do",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Năng lượng tháng này:</strong> Hãy chuẩn bị cho những bất ngờ! Tháng số 5 mang đến những thay đổi thú vị và cơ hội để phá vỡ sự nhàm chán. Đây là thời điểm lý tưởng để xê dịch và làm mới cuộc sống.</p>"
        },
        {
          "type": "list",
          "title": "Việc cần làm ngay:",
          "items": [
            "Đi du lịch ngắn ngày hoặc thay đổi lộ trình đi làm hàng ngày.",
            "Thử một món ăn mới, trải nghiệm một sở thích mới.",
            "Quảng bá bản thân, marketing hoặc mở rộng quan hệ xã hội.",
            "Linh hoạt đón nhận những thay đổi bất ngờ trong công việc."
          ]
        },
        {
          "type": "quote",
          "content": "Lời khuyên: Đừng cố kiểm soát mọi thứ. Hãy thả lỏng và tận hưởng những làn gió mới."
        }
      ]
    },
    "6": {
      "title": "Tháng Cá Nhân Số 6 - Gia Đình & Trách Nhiệm",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Năng lượng tháng này:</strong> Tâm điểm của tháng này là \"Nhà\". Bạn sẽ thấy mình quan tâm nhiều hơn đến gia đình và những người thân yêu. Trách nhiệm và tình yêu thương là từ khóa chính.</p>"
        },
        {
          "type": "list",
          "title": "Việc cần làm ngay:",
          "items": [
            "Dành thời gian ăn tối cùng gia đình, thăm hỏi cha mẹ.",
            "Trang trí, sửa sang lại nhà cửa cho ấm cúng hơn.",
            "Giúp đỡ đồng nghiệp hoặc tham gia hoạt động thiện nguyện.",
            "Giải quyết các vấn đề tình cảm cá nhân một cách êm đẹp."
          ]
        },
        {
          "type": "quote",
          "content": "Lời khuyên: Hãy yêu thương nhưng đừng bao bọc thái quá. Đôi khi từ chối cũng là một cách yêu thương."
        }
      ]
    },
    "7": {
      "title": "Tháng Cá Nhân Số 7 - Chiêm Nghiệm & Học Hỏi",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Năng lượng tháng này:</strong> Đây là \"khoảng lặng\" cần thiết để bạn sạc lại năng lượng. Tháng này không thích hợp để lao ra ngoài tranh đấu, mà thích hợp để quay vào bên trong, học hỏi và nâng cao trí tuệ.</p>"
        },
        {
          "type": "list",
          "title": "Việc cần làm ngay:",
          "items": [
            "Đăng ký một khóa học chuyên sâu hoặc đọc sách nghiên cứu.",
            "Dành thời gian ở một mình để suy ngẫm và viết nhật ký.",
            "Thiền định, yoga hoặc đi dạo giữa thiên nhiên.",
            "Tránh đưa ra các quyết định lớn về tài chính nếu chưa chắc chắn."
          ]
        },
        {
          "type": "quote",
          "content": "Lời khuyên: Đừng sợ sự cô đơn. Trí tuệ sinh ra trong tĩnh lặng."
        }
      ]
    },
    "8": {
      "title": "Tháng Cá Nhân Số 8 - Thành Tựu & Tài Chính",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Năng lượng tháng này:</strong> Thời cơ gặt hái đã đến! Tháng số 8 tập trung mạnh mẽ vào công việc, tiền bạc và quyền lực. Đây là lúc bạn cần thể hiện bản lĩnh để đạt được những mục tiêu thực tế.</p>"
        },
        {
          "type": "list",
          "title": "Việc cần làm ngay:",
          "items": [
            "Tập trung cao độ vào các dự án kinh doanh, kiếm tiền.",
            "Đàm phán hợp đồng, đề xuất thăng chức hoặc tăng lương.",
            "Quản lý tài chính rõ ràng, rà soát lại các khoản đầu tư.",
            "Thể hiện sự chuyên nghiệp và uy quyền trong công việc."
          ]
        },
        {
          "type": "quote",
          "content": "Lời khuyên: Hãy quyết đoán nhưng đừng thực dụng. Giữ cân bằng giữa tham vọng và sức khỏe."
        }
      ]
    },
    "9": {
      "title": "Tháng Cá Nhân Số 9 - Hoàn Tất & Buông Bỏ",
      "blocks": [
        {
          "type": "text",
          "content": "<p><strong>Năng lượng tháng này:</strong> Đây là tháng để dọn dẹp sạch sẽ mọi thứ (cả vật chất lẫn tinh thần) để chuẩn bị cho chu kỳ mới. Hãy hoàn thành nốt những việc dang dở và buông bỏ những gì không còn phù hợp.</p>"
        },
        {
          "type": "list",
          "title": "Việc cần làm ngay:",
          "items": [
            "Kết thúc các dự án cũ, trả hết nợ nần.",
            "Dọn dẹp nhà cửa, vứt bỏ những đồ đạc không dùng đến (Declutter).",
            "Tha thứ cho người khác và buông bỏ những nỗi buồn quá khứ.",
            "Làm từ thiện, giúp đỡ cộng đồng."
          ]
        },
        {
          "type": "quote",
          "content": "Lời khuyên: Đừng bắt đầu cái mới trong tháng này. Hãy kết thúc thật trọn vẹn để mở ra cánh cửa mới vào tháng sau."
        }
      ]
    }
  },

  "default": {
      "title": "Thông báo",
      "blocks": [ { "type": "text", "content": "<p>Chưa có dữ liệu chi tiết.</p>" } ]
  }
}